Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SLP_EN_3</name>
               <description>Sleep Enable 3 Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HDMI_CEC_SLP_EN</name>
                     <description>HDMI_CEC Sleep Enable (ADC_SLP_EN)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_SLP_EN</name>
                     <description>ADC Sleep Enable (ADC_SLP_EN)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_0_SLP_EN</name>
                     <description>PS2_0 Sleep Enable (PS2_0_SLP_EN)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_1_SLP_EN</name>
                     <description>PS2_1 Sleep Enable (PS2_1_SLP_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_0_SLP_EN</name>
                     <description>Hibernation Timer 0 Sleep Enable (HTM_0_SLP_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB1_SLP_EN</name>
                     <description>SMB1 Sleep Enable (SMB1_SLP_EN)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB2_SLP_EN</name>
                     <description>SMB2 Sleep Enable (SMB2_SLP_EN)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB3_SLP_EN</name>
                     <description>SMB3 Sleep Enable (SMB3_SLP_EN)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED0_SLP_EN</name>
                     <description>LED0 Sleep Enable (LED0_SLP_EN)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED1_SLP_EN</name>
                     <description>LED1 Sleep Enable (LED1_SLP_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED2_SLP_EN</name>
                     <description>LED2 Sleep Enable (LED2_SLP_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB4_SLP_EN</name>
                     <description>SMB4 Sleep Enable (SMB4_SLP_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_0_SLP_EN</name>
                     <description>TIMER32_0 Sleep Enable (TIMER32_0_SLP_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_1_SLP_EN</name>
                     <description>TIMER32_1 Sleep Enable (TIMER32_1_SLP_EN)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKE_SLP_EN</name>
                     <description>PKE Sleep Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG_SLP_EN</name>
                     <description>RNG Sleep Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH_SLP_EN</name>
                     <description>AES_HASH Sleep Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_1_SLP_EN</name>
                     <description>Hibernation TIMER 1 Sleep Enable (HTM_1_SLP_EN)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCT_SLP_EN</name>
                     <description>Capture Compare Timer Sleep Enable (CCTIMER_SLP_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLP_EN_4</name>
               <description>Sleep Enable 4 Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMSPI_SLP_EN</name>
                     <description>Quad Master SPI Sleep Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C5_SLP_EN</name>
                     <description>I2C5 Sleep Enable (I2C5_SLP_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C6_SLP_EN</name>
                     <description>I2C6 Sleep Enable (I2C6_SLP_EN)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C7_SLP_EN</name>
                     <description>I2C7 Sleep Enable (I2C7_SLP_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO0_SLP_EN</name>
                     <description>SGPIO0 Sleep Enable (SGPIO0_SLP_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO1_SLP_EN</name>
                     <description>SGPIO1 Sleep Enable (SGPIO1_SLP_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO2_SLP_EN</name>
                     <description>SGPIO2 Sleep Enable (SGPIO2_SLP_EN)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO3_SLP_EN</name>
                     <description>SGPIO3 Sleep Enable (SGPIO3_SLP_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_0</name>
               <description>Clock Required 0 Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTAG_STAP_CLK_REQ</name>
                     <description>JTAG STAP Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTP_CLK_REQ</name>
                     <description>OTP Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_1</name>
               <description>Clock Required 1 Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_CLK_REQ</name>
                     <description>Interrupt Clock Required</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECI_CLK_REQ</name>
                     <description>PECI Clock Required</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH0_CLK_REQ</name>
                     <description>TACH0 Clock Required (TACH0_CLK_REQ)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM0_CLK_REQ</name>
                     <description>PWM0 Clock Required (PWM0_CLK_REQ)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PMC_CLK_REQ</name>
                     <description>PMC Clock Required (PMC_CLK_REQ)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_CLK_REQ</name>
                     <description>DMA Clock Required (DMA_CLK_REQ)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFDP_CLK_REQ</name>
                     <description>TFDP Clock Required (TFDP_CLK_REQ)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROC_CLK_REQ</name>
                     <description>PROCESSOR Clock Required (PROCESSOR_CLK_REQ)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_CLK_REQ</name>
                     <description>WDT Clock Required (WDT_CLK_REQ)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB0_CLK_REQ</name>
                     <description>SMB0 Clock Required (SMB0_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH1_CLK_REQ</name>
                     <description>TACH1 Clock Required (TACH1_CLK_REQ)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH2_CLK_REQ</name>
                     <description>TACH2 Clock Required (TACH2_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH3_CLK_REQ</name>
                     <description>TACH3 Clock Required (TACH3_CLK_REQ)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM1_CLK_REQ</name>
                     <description>PWM1 Clock Required (PWM1_CLK_REQ)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM2_CLK_REQ</name>
                     <description>PWM2 Clock Required (PWM2_CLK_REQ)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM3_CLK_REQ</name>
                     <description>PWM3 Clock Required (PWM3_CLK_REQ)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM4_CLK_REQ</name>
                     <description>PWM4 Clock Required (PWM4_CLK_REQ)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM5_CLK_REQ</name>
                     <description>PWM5 Clock Required (PWM5_CLK_REQ)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM6_CLK_REQ</name>
                     <description>PWM6 Clock Required (PWM6_CLK_REQ)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM7_CLK_REQ</name>
                     <description>PWM7 Clock Required (PWM7_CLK_REQ)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM8_CLK_REQ</name>
                     <description>PWM8 Clock Required (PWM8_CLK_REQ)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_REG_BANK_CLK_REQ</name>
                     <description>EC_REG_BANK Clock Required (EC_REG_BANK_CLK_REQ)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_0_CLK_REQ</name>
                     <description>TIMER16_0 Clock Required (TIMER16_0_CLK_REQ)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_1_CLK_REQ</name>
                     <description>TIMER16_1 Clock Required (TIMER16_1_CLK_REQ)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_2</name>
               <description>Clock Required 2 Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMAP_CLK_REQ</name>
                     <description>IMAP Clock Required (IMAP_CLK_REQ)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART0_CLK_REQ</name>
                     <description>UART 0 Clock Required</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART1_CLK_REQ</name>
                     <description>UART 1 Clock Required</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GLBL_CFG_CLK_REQ</name>
                     <description>GLBL_CFG (GLBL_CFG_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KBCEM_CLK_REQ</name>
                     <description>8042EM Clock Required (8042EM_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_CLK_REQ</name>
                     <description>RTC Clock Required (RTC_CLK_REQ)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESPI_CLK_REQ</name>
                     <description>eSPI Clock Required</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_BRDG_CLK_REQ</name>
                     <description>SAF BRIDGE Clock Required</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART2_CLK_REQ</name>
                     <description>UART 2 Clock Required</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
