Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>CLK_REQ_3</name>
               <description>Clock Required 3 Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HDMI_CEC_CLK_REQ</name>
                     <description>HDMI_CEC Clock Required (ADC_CLK_REQ)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_CLK_REQ</name>
                     <description>ADC Clock Required (ADC_CLK_REQ)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_0_CLK_REQ</name>
                     <description>PS2_0 Clock Required (PS2_0_CLK_REQ)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_1_CLK_REQ</name>
                     <description>PS2_1 Clock Required (PS2_1_CLK_REQ)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM0_CLK_REQ</name>
                     <description>Hibernation TIMER 0 Clock Required (HTM_0_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KMS_CLK_REQ</name>
                     <description>KEYSCAN Clock Required (KMS_CLK_REQ)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB1_CLK_REQ</name>
                     <description>SMB1 Clock Required (SMB1_CLK_REQ)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB2_CLK_REQ</name>
                     <description>SMB2 Clock Required (SMB2_CLK_REQ)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB3_CLK_REQ</name>
                     <description>SMB3 Clock Required (SMB3_CLK_REQ)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED0_CLK_REQ</name>
                     <description>LED0 Clock Required (LED0_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED1_CLK_REQ</name>
                     <description>LED1 Clock Required (LED1_CLK_REQ)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED2_CLK_REQ</name>
                     <description>LED2 Clock Required (LED2_CLK_REQ)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB_4_CLK_REQ</name>
                     <description>SMB 4 Clock Required (SMB_4_CLK_REQ)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_0_CLK_REQ</name>
                     <description>TIMER32_0 Clock Required (TIMER32_0_CLK_REQ)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_1_CLK_REQ</name>
                     <description>TIMER32_1 Clock Required (TIMER32_1_CLK_REQ)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKE_CLK_REQ</name>
                     <description>PKE Clock Required</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG_CLK_REQ</name>
                     <description>RNG Clock Required</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH_CLK_REQ</name>
                     <description>AES_HASH Clock Required</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_1_CLK_REQ</name>
                     <description>Hibernation TIMER 1 Clock Required (HTM_1_CLK_REQ)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCTIMER_CLK_REQ</name>
                     <description>Capture Compare Timer Clock Required (CCTIMER_CLK_REQ)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_REQ_4</name>
               <description>Clock Required 4 Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTOS_CLK_REQ</name>
                     <description>RTOS Clock Required (RTOS_CLK_REQ)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QMSPI_CLK_REQ</name>
                     <description>Quad Master SPI Clock Required</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C5_CLK_REQ</name>
                     <description>I2C5 Clock Required (I2C5_CLK_REQ)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C6_CLK_REQ</name>
                     <description>I2C6 Clock Required (I2C6_CLK_REQ)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C7_CLK_REQ</name>
                     <description>I2C7 Clock Required (I2C7_CLK_REQ)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_SLAVE_CLK_REQ</name>
                     <description>SPI SLAVE Clock Required (SPI_SLAVE_CLK_REQ)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO0_CLK_REQ</name>
                     <description>SGPIO0 Clock Required (SGPIO0_CLK_REQ)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO1_CLK_REQ</name>
                     <description>SGPIO1 Clock Required (SGPIO1_CLK_REQ)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO2_CLK_REQ</name>
                     <description>SGPIO2 Clock Required (SGPIO2_CLK_REQ)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO3_CLK_REQ</name>
                     <description>SGPIO3 Clock Required (SGPIO3_CLK_REQ)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_0</name>
               <description>Reset Enable 0 Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTP_RST_EN</name>
                     <description>OTP Reset Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_1</name>
               <description>Reset Enable 1 Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT_RST_EN</name>
                     <description>Interrupt Reset Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECI_RST_EN</name>
                     <description>PECI Reset Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH0_RST_EN</name>
                     <description>TACH0 Reset Enable (TACH0_RST_EN)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM0_RST_EN</name>
                     <description>PWM0 Reset Enable (PWM0_RST_EN)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_RST_EN</name>
                     <description>DMA Reset Enable (DMA_RST_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFDP_RST_EN</name>
                     <description>TFDP Reset Enable (TFDP_RST_EN)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_RST_EN</name>
                     <description>WDT Reset Enable (WDT_RST_EN)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB0_RST_EN</name>
                     <description>SMB0 Reset Enable (SMB0_RST_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH1_RST_EN</name>
                     <description>TACH1 Reset Enable (TACH1_RST_EN)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH2_RST_EN</name>
                     <description>TACH2 Reset Enable (TACH2_RST_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TACH3_RST_EN</name>
                     <description>TACH3 Reset Enable (TACH3_RST_EN)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM1_RST_EN</name>
                     <description>PWM1 Reset Enable (PWM1_RST_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM2_RST_EN</name>
                     <description>PWM2 Reset Enable (PWM2_RST_EN)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM3_RST_EN</name>
                     <description>PWM3 Reset Enable (PWM3_RST_EN)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM4_RST_EN</name>
                     <description>PWM4 Reset Enable (PWM4_RST_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM5_RST_EN</name>
                     <description>PWM5 Reset Enable (PWM5_RST_EN)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM6_RST_EN</name>
                     <description>PWM6 Reset Enable (PWM6_RST_EN)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM7_RST_EN</name>
                     <description>PWM7 Reset Enable (PWM7_RST_EN)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWM8_RST_EN</name>
                     <description>PWM8 Reset Enable (PWM8_RST_EN)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_0_RST_EN</name>
                     <description>TIMER16_0 Reset Enable (TIMER16_0_RST_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR16_1_RST_EN</name>
                     <description>TIMER16_1 Reset Enable (TIMER16_1_RST_EN)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_2</name>
               <description>Reset Enable 2 Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IMAP_RST_EN</name>
                     <description>IMAP Reset Enable (IMAP_RST_EN)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART0_RST_EN</name>
                     <description>UART 0 Reset Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART1_RST_EN</name>
                     <description>UART 1 Reset Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACPI_EC0_RST_EN</name>
                     <description>ACPI EC 0 Reset Enable (ACPI_EC_0_RST_EN)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACPI_EC1_RST_EN</name>
                     <description>ACPI EC 1 Reset Enable (ACPI_EC_1_RST_EN)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACPI_PM1_RST_EN</name>
                     <description>ACPI PM1 Reset Enable (ACPI_PM1_RST_EN)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KBCEM_RST_EN</name>
                     <description>8042EM Reset Enable (8042EM_RST_EN)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MBX_RST_EN</name>
                     <description>Mailbox Reset Enable (MBX_RST_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_RST_EN</name>
                     <description>RTC Reset Enable (RTC_RST_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCRATCH_32_RST_EN</name>
                     <description>SCRATCH 32 Reset Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACPI_EC_2_RST_EN</name>
                     <description>ACPI EC 2 Reset Enable (ACPI_EC_2_RST_EN)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACPI_EC_3_RST_EN</name>
                     <description>ACPI EC 3 Reset Enable (ACPI_EC_3_RST_EN)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_80_0_RST_EN</name>
                     <description>Port 80 0 Reset Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_80_1_RST_EN</name>
                     <description>Port 80 1 Reset Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART2_RST_EN</name>
                     <description>UART 2 Reset Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
