Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>RST_EN_3</name>
               <description>Reset Enable 3 Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HDMI_CEC_RST_EN</name>
                     <description>HDMI_CEC Reset Enable (HDMI_CEC_RST_EN)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_RST_EN</name>
                     <description>ADC Reset Enable (ADC_RST_EN)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_0_RST_EN</name>
                     <description>PS2_0 Reset Enable (PS2_0_RST_EN)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS2_1_RST_EN</name>
                     <description>PS2_1 Reset Enable (PS2_1_RST_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_0_RST_EN</name>
                     <description>Hibernation TIMER 0 Reset Enable (HTM_0_RST_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KMS_RST_EN</name>
                     <description>KEYSCAN Reset Enable (KMS_RST_EN)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB1_RST_EN</name>
                     <description>SMB1 Reset Enable (SMB1_RST_EN)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB2_RST_EN</name>
                     <description>SMB2 Reset Enable (SMB2_RST_EN)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB3_RST_EN</name>
                     <description>SMB3 Reset Enable (SMB3_RST_EN)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED0_RST_EN</name>
                     <description>LED0 Reset Enable (LED0_RST_EN)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED1_RST_EN</name>
                     <description>LED1 Reset Enable (LED1_RST_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LED2_RST_EN</name>
                     <description>LED2 Reset Enable (LED2_RST_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMB_4_RST_EN</name>
                     <description>SMB 4 Reset Enable (SMB_4_RST_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_0_RST_EN</name>
                     <description>TIMER32_0 Reset Enable (TIMER32_0_RST_EN)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMR32_1_RST_EN</name>
                     <description>TIMER32_1 Reset Enable (TIMER32_1_RST_EN)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKE_RST_EN</name>
                     <description>PKE Reset Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNG_RST_EN</name>
                     <description>RNG Reset Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH_RST_EN</name>
                     <description>AES_HASH Reset Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTM_1_RST_EN</name>
                     <description>Hibernation TIMER 1 Reset Enable (HTM_1_RST_EN)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCTIMER_RST_EN</name>
                     <description>Capture Compare Timer Reset Enable (CCTIMER_RST_EN)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_EN_4</name>
               <description>Reset Enable 4 Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTOS_RST_EN</name>
                     <description>RTOS Reset Enable (RTOS_RST_EN)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QMSPI_RST_EN</name>
                     <description>Quad Master SPI Reset Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C5_RST_EN</name>
                     <description>I2C5 Reset Enable (I2C5_RST_EN)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C6_RST_EN</name>
                     <description>I2C6 Reset Enable (I2C6_RST_EN)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C7_RST_EN</name>
                     <description>I2C7 Reset Enable (I2C7_RST_EN)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_SLAVE_RST_EN</name>
                     <description>SPI SLAVE Reset Enable (SPI_SLAVE_RST_EN)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO0_RST_EN</name>
                     <description>SGPIO0 Reset Enable (SGPIO0_RST_EN)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO1_RST_EN</name>
                     <description>SGPIO1 Reset Enable (SGPIO1_RST_EN)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO2_RST_EN</name>
                     <description>SGPIO2 Reset Enable (SGPIO2_RST_EN)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SGPIO3_RST_EN</name>
                     <description>SGPIO3 Reset Enable (SGPIO3_RST_EN)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCK_REG</name>
               <description>LOCK Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0xA6382D4D</resetValue>
               <fields>
                  <field>
                     <name>PCR_RST_EN_LOCK</name>
                     <description>PCR Reset Enable Lock Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
