Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMA_CHAN02</name>
         <version>85d1.0</version>
         <description>DMA Channel 02 Registers</description>
         <baseAddress>0x400024C0</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x19</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMA_CH02</name>
            <value>26</value>
         </interrupt>
         <registers>
            <register>
               <name>ACTIVATE</name>
               <description>Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHN</name>
                     <description>Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSTART</name>
               <description>This is the starting address for the Memory device.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>MEND</name>
               <description>This is the ending address for the Memory device.</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DSTART</name>
               <description>This is the Master Device address.</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>DMA Channel N Control</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUN</name>
                     <description>This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REQ</name>
                     <description>This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STS</name>
                     <description>This is a status signal. The status decode is listed in priority order with the highest priority first.                  3: Error detected by the DMA                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address                  0: DMA Channel Control:Run is Disabled (0x0)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STSSelect</name>
                        <enumeratedValue>
                           <name>ERROR</name>
                           <description>3: Error detected by the DMA</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_DONE</name>
                           <description>2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOC_DONE</name>
                           <description>1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>0: DMA Channel Control:Run is Disabled (0x0)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_DIR</name>
                     <description>This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HW_FLOW_CTRL_DEV</name>
                     <description>This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>INC_MEM_ADDR</name>
                     <description>This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INC_DEV_ADDR</name>
                     <description>This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions).</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS_HW_FLOW_CTRL</name>
                     <description>This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRANS_SIZE</name>
                     <description>This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TRANS_GO</name>
                     <description>This is used for the Firmware Flow Control DMA transfer.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRANS_ABORT</name>
                     <description>This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISTS</name>
               <description>DMA Channel N Interrupt Status</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>BUS_ERR</name>
                     <description>This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLOW_CTRL</name>
                     <description>This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <description>DMA CHANNEL N INTERRUPT ENABLE</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>STS_EN_BUS_ERR</name>
                     <description>This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STS_EN_FLOW_CTRL</name>
                     <description>This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STS_EN_DONE</name>
                     <description>This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
