Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN03</name>
         <baseAddress>0x40002500</baseAddress>
         <interrupt>
            <name>DMA_CH03</name>
            <value>27</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN04</name>
         <baseAddress>0x40002540</baseAddress>
         <interrupt>
            <name>DMA_CH04</name>
            <value>28</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN05</name>
         <baseAddress>0x40002580</baseAddress>
         <interrupt>
            <name>DMA_CH05</name>
            <value>29</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN06</name>
         <baseAddress>0x400025C0</baseAddress>
         <interrupt>
            <name>DMA_CH06</name>
            <value>30</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN07</name>
         <baseAddress>0x40002600</baseAddress>
         <interrupt>
            <name>DMA_CH07</name>
            <value>31</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN08</name>
         <baseAddress>0x40002640</baseAddress>
         <interrupt>
            <name>DMA_CH08</name>
            <value>32</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN09</name>
         <baseAddress>0x40002680</baseAddress>
         <interrupt>
            <name>DMA_CH09</name>
            <value>33</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN10</name>
         <baseAddress>0x400026C0</baseAddress>
         <interrupt>
            <name>DMA_CH10</name>
            <value>34</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="DMA_CHAN02">
         <name>DMA_CHAN11</name>
         <baseAddress>0x40002700</baseAddress>
         <interrupt>
            <name>DMA_CH11</name>
            <value>35</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>ECIA</name>
         <description>The ECIA works in conjunction with the processor interrupt interface to handle hardware interrupts andd exceptions.</description>
         <baseAddress>0x4000E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SRC8</name>
               <description>GIRQ8 Source Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET8</name>
               <description>GIRQ8 Enable Set Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT8</name>
               <description>GIRQ8 Result Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR8</name>
               <description>GIRQ8 Enable Clear Register</description>
               <addressOffset>0xc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC9</name>
               <description>GIRQ9 Source Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET9</name>
               <description>GIRQ9 Enable Set Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT9</name>
               <description>GIRQ9 Result Register</description>
               <addressOffset>0x1c</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR9</name>
               <description>GIRQ9 Enable Clear Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC10</name>
               <description>GIRQ10 Source Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET10</name>
               <description>GIRQ10 Enable Set Register</description>
               <addressOffset>0x2c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT10</name>
               <description>GIRQ10 Result Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR10</name>
               <description>GIRQ10 Enable Clear Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC11</name>
               <description>GIRQ11 Source Register</description>
               <addressOffset>0x3c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET11</name>
               <description>GIRQ11 Enable Set Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT11</name>
               <description>GIRQ11 Result Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR11</name>
               <description>GIRQ11 Enable Clear Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC12</name>
               <description>GIRQ12 Source Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET12</name>
               <description>GIRQ12 Enable Set Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT12</name>
               <description>GIRQ12 Result Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR12</name>
               <description>GIRQ12 Enable Clear Register</description>
               <addressOffset>0x5c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC13</name>
               <description>GIRQ13 Source Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET13</name>
               <description>GIRQ13 Enable Set Register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT13</name>
               <description>GIRQ13 Result Register</description>
               <addressOffset>0x6c</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR13</name>
               <description>GIRQ13 Enable Clear Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC14</name>
               <description>GIRQ14 Source Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET14</name>
               <description>GIRQ14 Enable Set Register</description>
               <addressOffset>0x7c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT14</name>
               <description>GIRQ14 Result Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR14</name>
               <description>GIRQ14 Enable Clear Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC15</name>
               <description>GIRQ15 Source Register</description>
               <addressOffset>0x8c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET15</name>
               <description>GIRQ15 Enable Set Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT15</name>
               <description>GIRQ15 Result Register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR15</name>
               <description>GIRQ15 Enable Clear Register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC16</name>
               <description>GIRQ16 Source Register</description>
               <addressOffset>0xa0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET16</name>
               <description>GIRQ16 Enable Set Register</description>
               <addressOffset>0xa4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT16</name>
               <description>GIRQ16 Result Register</description>
               <addressOffset>0xa8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR16</name>
               <description>GIRQ16 Enable Clear Register</description>
               <addressOffset>0xac</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC17</name>
               <description>GIRQ17 Source Register</description>
               <addressOffset>0xb4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET17</name>
               <description>GIRQ17 Enable Set Register</description>
               <addressOffset>0xb8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT17</name>
               <description>GIRQ17 Result Register</description>
               <addressOffset>0xbc</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR17</name>
               <description>GIRQ17 Enable Clear Register</description>
               <addressOffset>0xc0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC18</name>
               <description>GIRQ18 Source Register</description>
               <addressOffset>0xc8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET18</name>
               <description>GIRQ18 Enable Set Register</description>
               <addressOffset>0xcc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT18</name>
               <description>GIRQ18 Result Register</description>
               <addressOffset>0xd0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR18</name>
               <description>GIRQ18 Enable Clear Register</description>
               <addressOffset>0xd4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC19</name>
               <description>GIRQ19 Source Register</description>
               <addressOffset>0xdc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET19</name>
               <description>GIRQ19 Enable Set Register</description>
               <addressOffset>0xe0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT19</name>
               <description>GIRQ19 Result Register</description>
               <addressOffset>0xe4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR19</name>
               <description>GIRQ19 Enable Clear Register</description>
               <addressOffset>0xe8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC20</name>
               <description>GIRQ20 Source Register</description>
               <addressOffset>0xf0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET20</name>
               <description>GIRQ20 Enable Set Register</description>
               <addressOffset>0xf4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT20</name>
               <description>GIRQ20 Result Register</description>
               <addressOffset>0xf8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR20</name>
               <description>GIRQ20 Enable Clear Register</description>
               <addressOffset>0xfc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC21</name>
               <description>GIRQ21 Source Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET21</name>
               <description>GIRQ21 Enable Set Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT21</name>
               <description>GIRQ21 Result Register</description>
               <addressOffset>0x10c</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR21</name>
               <description>GIRQ21 Enable Clear Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC22</name>
               <description>GIRQ22 Source Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET22</name>
               <description>GIRQ22 Enable Set Register</description>
               <addressOffset>0x11c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT22</name>
               <description>GIRQ22 Result Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR22</name>
               <description>GIRQ22 Enable Clear Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC23</name>
               <description>GIRQ23 Source Register</description>
               <addressOffset>0x12c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET23</name>
               <description>GIRQ23 Enable Set Register</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT23</name>
               <description>GIRQ23 Result Register</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR23</name>
               <description>GIRQ23 Enable Clear Register</description>
               <addressOffset>0x138</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC24</name>
               <description>GIRQ24 Source Register</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET24</name>
               <description>GIRQ24 Enable Set Register</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT24</name>
               <description>GIRQ24 Result Register</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR24</name>
               <description>GIRQ24 Enable Clear Register</description>
               <addressOffset>0x14c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SRC25</name>
               <description>GIRQ25 Source Register</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET25</name>
               <description>GIRQ25 Enable Set Register</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT25</name>
               <description>GIRQ25 Result Register</description>
               <addressOffset>0x15c</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR25</name>
               <description>GIRQ25 Enable Clear Register</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
