Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SRC26</name>
               <description>GIRQ26 Source Register</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_SET26</name>
               <description>GIRQ26 Enable Set Register</description>
               <addressOffset>0x16c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RESULT26</name>
               <description>GIRQ26 Result Register</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EN_CLR26</name>
               <description>GIRQ26 Enable Clear Register</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>BLK_EN_SET</name>
               <description>Block Enable Set Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR_EN_SET</name>
                     <description>Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLK_EN_CLR</name>
               <description>Block Enable Clear Register.</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR_EN_CLR</name>
                     <description>Each GIRQx bit can be individually disabled to inhibit an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WC)\n      1=All interrupts in the GIRQx Source Register are disabled\n      0=No effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLK_IRQ_VTOR</name>
               <description>Block IRQ Vector Register</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTOR</name>
                     <description>Each bit in this field reports the status of the group GIRQ interrupt assertion to the NVIC. If the GIRQx interrupt\n      is disabled as a group, by the Block Enable Clear Register, then the corresponding bit will be '0'b and no interrupt will be asserted.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>25</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>ESPI_IO</name>
         <version>143a1.0</version>
         <description>The ESPI is used by the system host to configure the chip and communicate with the logical devices implemented in the design</description>
         <baseAddress>0x400F3400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3F1</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ19</name>
            <value>11</value>
         </interrupt>
         <interrupt>
            <name>INTR_PC</name>
            <value>103</value>
         </interrupt>
         <interrupt>
            <name>INTR_BM1</name>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>INTR_BM2</name>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>INTR_LTR</name>
            <value>106</value>
         </interrupt>
         <interrupt>
            <name>INTR_OOB_UP</name>
            <value>107</value>
         </interrupt>
         <interrupt>
            <name>INTR_OOB_DOWN</name>
            <value>108</value>
         </interrupt>
         <interrupt>
            <name>INTR_FLASH</name>
            <value>109</value>
         </interrupt>
         <interrupt>
            <name>ESPI_RESET</name>
            <value>110</value>
         </interrupt>
         <interrupt>
            <name>ESPI_VWIRE</name>
            <value>156</value>
         </interrupt>
         <registers>
            <register>
               <name>IND</name>
               <description>The INDEX register, which is part of the Configuration Port, is used as a pointer to a Configuration Register Address.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DAT_REG</name>
               <description>The DATA register, which is part of the Configuration Port, is used to read or write data to the register currently being selected by the INDEX Register.</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>PC_LC_ADDR_LSW</name>
               <description>Peripheral Channel Last Cycle Register (DWord 0)</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LADR</name>
                     <description>This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_LC_ADDR_MSW</name>
               <description>Peripheral Channel Last Cycle Register (DWord 1)</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MADR</name>
                     <description>This field records bits[63:32] of the 64 bit address of the most recent eSPI transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_LC_LEN_TYPE_TAG</name>
               <description>Peripheral Channel Last Cycle Register (DWord 2)</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PC_LEN</name>
                     <description>This field records the length of the most recent eSPI transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PC_CY_TYPE</name>
                     <description>This field records the cycle type of the most recent eSPI transaction.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PC_TAG</name>
                     <description>This field records the tag of the most recent eSPI transaction.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_ERR_ADDR_LSW</name>
               <description>Peripheral Channel Error Address Register (DWord 0)</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSDW</name>
                     <description>This field records bits[31:0] of the 64 bit address of the most recent eSPI transaction that incurred an error.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_ERR_ADDR_MSW</name>
               <description>Peripheral Channel Error Address Register (DWord 1)</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSDW</name>
                     <description>This field records bits[63:32] of the 64 bit  address of the most recent eSPI transaction that incurred an error.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_STATUS</name>
               <description>Peripheral Channel Status Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VIR_RD</name>
                     <description>This bit is set whenever a eSPI read transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VIR_WR</name>
                     <description>This bit is set whenever a eSPI write transaction targeting a Logical Device with an I/O BAR or a Memory BAR in which the VIRTUALIZED bit\n      is set. (R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VIR_TYP</name>
                     <description>This bit returns the type of Virtualized eSPI transaction that is\n      1=Peripheral Channel Memory Address access\n      0=Peripheral Channel I/O Address access.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VIR_BAR_LDN</name>
                     <description>This field returns the Logical Device Number of the device targeted by the most recent virtual transaction.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PC_BUS_ERROR</name>
                     <description>This bit is set to '1' whenever an eSPI access causes an internal bus error. Once set, it remains set until cleared by being written\n      with a 1. (R/WC)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAR_CONFL</name>
                     <description>This bit is set to '1' whenever a BAR conflict occurs on an eSPI address. A BAR conflict occurs when more than one BAR matches\n      the address of an eSPI transaction. Once set, it remains set until cleared by being written with a 1. (R/WC)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN_STS</name>
                     <description>This bit reflects the Host writable configuration field.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_CHNG</name>
                     <description>This bit is set to '1' whenever the field PC_CHANNEL_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1. (R/WC)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M_EN_STS</name>
                     <description>This bit is 1 if three bits in the Peripheral Channel Capabilities and Configurations register, Peripheral Channel Mastering Enable,\n      Peripheral Channel Ready and Peripheral Channel Enable, are all 1, and 0 otherwise.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M_EN_CHNG</name>
                     <description>This bit is set to '1' whenever the field PC_MASTERING_ENABLE_STATUS in this register changes. Once set, it remains set until cleared by being written with a 1 (R/WC)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_IEN</name>
               <description>Peripheral Channel Interrupt Enable Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VIR_RD_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_READ in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VIR_WR_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit PC_VIRTUAL_WRITE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUS_ERR_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit PC_BUS_ERROR in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAR_CONFL_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit BAR_CONFLICT in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_CHNG_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit PC_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M_EN_CHNG_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit PC_MASTERING_ENABLE_CHANGE in the Peripheral Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOBAR_INH_LSW</name>
               <description>BAR Inhibit Register (DWord 0)</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSDW</name>
                     <description>When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOBAR_INH_MSW</name>
               <description>BAR Inhibit Register (DWord 1)</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSDW</name>
                     <description>When bit Di of BAR_Inhibit is 1, the BAR for Logical Device i is disabled and its addresses will not be claimed on the eSPI\n      bus, independent of the value of the Valid bit in the BAR. The BAR Inhibit function applies to both I/O transactions and Memory transactions.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOBAR_INIT</name>
               <description>eSPI BAR Init Register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <resetValue>0x0000002E</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>This field is loaded into the Base Address Register register for Logical Device Ch (eSPI, I/O Configuration Port) on RESET_SIO.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_CTRL_IRQ</name>
               <description>EC IRQ Register</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>This bit can be used as a firmware-controlled interrupt source for the EC. When the EC entry in the IRQ Assignment Table is set to a\n      valid IRQ number, changes in this bit will be transmitted to the Host over a Virtual Wire IRQ channel.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASE_ADDR</name>
               <description>eSPI I/O Base Address Register</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <resetValue>0x00000D01</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
