Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>ESPI_MEM_BASE_ADDR</name>
               <description>eSPI Memory Base Address Register</description>
               <addressOffset>0x138</addressOffset>
               <size>32</size>
               <resetValue>0x00000E00</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBX_BASE_ADDR</name>
               <description>Mailbox BAR  Register</description>
               <addressOffset>0x13C</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EM8042_BASE_ADDR</name>
               <description>8042 Emulated Keyboard Controller BAR Register</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <resetValue>0x00000104</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC_0_BASE_ADDR</name>
               <description>ACPI EC Channel 0 Register</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <resetValue>0x00000204</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC_1_BASE_ADDR</name>
               <description>ACPI EC Channel 1 BAR Register</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <resetValue>0x00000307</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC_2_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <resetValue>0x00000407</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC_3_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <resetValue>0x00000507</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_PM1_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <resetValue>0x00000707</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FAST_KDB_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART_0_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <resetValue>0x00000907</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART_1_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x164</addressOffset>
               <size>32</size>
               <resetValue>0x00000A07</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI_0_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <resetValue>0x0000100F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI_1_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x16C</addressOffset>
               <size>32</size>
               <resetValue>0x0000110F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
