Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>PORT80_0_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <resetValue>0x00002000</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PORT80_1_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <resetValue>0x00002100</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x17C</addressOffset>
               <size>32</size>
               <resetValue>0x0000141F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART_2_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <resetValue>0x00000B07</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GLUE_BASE_ADDR</name>
               <description>I/O Base Address Register</description>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <resetValue>0x00000F1F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTR_STS</name>
               <description>LTR Peripheral Status Register</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_DON_STS</name>
                     <description>This bit is set to '1' whenever a Transmit operation terminates (the TRANSMIT_DONE bit in this register goes from 1 to 0). (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_OVRUN_STS</name>
                     <description>A Start was attempted while the TRANSMIT_BUSY bit in this register was '1'. Any Transmit in progress is immediately terminated. (R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS_H_STS</name>
                     <description>A '1' in this bit indicates that the last requested Transmit operation was aborted because Bus Mastering has been disabled by the Host.\n      Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral Channel Enable bit is '0'.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUSY</name>
                     <description>This bit is set to '1' when firmware writes '1' to the LTR_START (ltr_initiate) bit in the LTR Peripheral Control Register. It is cleared\n      by hardware when the transfer is sufficiently complete so that another packet can be transmitted. If the LTR_START bit is written to '1' while this bit\n      is also '1', then START_OVERRUN_STATUS in this register will be set to '1' and the transfer will terminate immediately.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTR_EN</name>
               <description>LTR Peripheral Enable Register</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_DONE_IEN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the LTR Peripheral Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTR_CTRL</name>
               <description>LTR Peripheral Control Register</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRT</name>
                     <description>Writing '1' to this bit triggers the transmission of an LTR packet defined by the LTR Peripheral Message register. Writing '0' to this bit has no effect.\n      The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUTG_TAG</name>
                     <description>This 4-bit value will be inserted as the TAG number in the next transmitted LTR packet. According to current understanding of Intel\n      specs, this field should be kept zero by firmware.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTR_MESG</name>
               <description>LTR Peripheral Message Register</description>
               <addressOffset>0x22C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>This field declares a time, in units expressed by the Scale field. Zero in both this field and the Scale field (zero time) demands best\n      possible effort (minimal latency) by the chipset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>SCAL</name>
                     <description>This field declares the time unit expressed by each count of the Value field of this register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RES_TX_BITS</name>
                     <description>These bits are Read/Write, but are undefined in the 16-bit LTR message format. These bits are transmitted, but according to current\n      specs they must always be kept as zeros when writing this register.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REQ_BIT</name>
                     <description>1 = Maximum latency tolerated is defined by the Scale and Length fields of this register. 0 = No Requirement. Infinite latency tolerated. (Default).</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_RX_ADDR_LSW</name>
               <description>OOB Channel Receive Address Register</description>
               <addressOffset>0x240</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RX_BUF</name>
                     <description>This field must be initialized to contain the Base Address for accepting the next OOB packet.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_TX_ADDR_LSW</name>
               <description>OOB Channel Transmit Address Register</description>
               <addressOffset>0x248</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_BUF</name>
                     <description>Before starting an OOB Transmit, this field must be initialized to contain the Base Address of the buffer in SRAM.\n      The contents of the transmit buffer should not be modified while TRANSMIT_BUSY is asserted.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_RX_LEN</name>
               <description>OOB Channel Receive Length Register</description>
               <addressOffset>0x250</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSG</name>
                     <description>This 13-bit read-only field reports how many bytes were received into SRAM in the last packet. This is necessary, independent of\n      any 'byte count' in the packet itself to distinguish between an SMBus packet with or without a PEC byte.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>BUF</name>
                     <description>Before setting the Receive Enable bit to allow incoming traffic to the Receive Buffer area, this 13-bit field must be initialized to\n      contain the length in bytes of the receiving buffer in SRAM. This limits the number of bytes that can be received into SRAM. Any additional incoming\n      bytes must be discarded by hardware, posting the Data Overrun error flag. Practically, the maximum value that can be placed in this field is the\n      configured Max Packet Length. This limit, or anything higher, is legal, but will effectively disable the limit check.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_TX_LEN</name>
               <description>OOB Channel Transmit Length Register</description>
               <addressOffset>0x254</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSG</name>
                     <description>This 13-bit field declares how many bytes are to be transmitted from the Tramsit Buffer memory. A value of zero,\n      or a value greater than the defined Max Packet Size (73 decimal, or 4Dh, by default) is illegal, and will trigger Bad Request handling.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_RX_CTRL</name>
               <description>OOB Channel Receive Control Register</description>
               <addressOffset>0x258</addressOffset>
               <size>32</size>
               <resetValue>0x00010000</resetValue>
               <fields>
                  <field>
                     <name>SET_RX_AVAIL</name>
                     <description>Firmware sets this bit to '1' to indicate that an SRAM buffer is available to receive the next Down OOB packet. This\n      forces the bit RECEIVE_ENABLE bit in the OOB Channel Receive Status Register register to be set to '1'. The OOB Channel Receive\n      Address Register and OOB Channel Receive Length Register must have already been initialized before setting this bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN</name>
                     <description>This allows firmware to read the OOB Message Channel Enabled field in the eSPI Configuration register. The Master\n      sets the bit to '1' to enable the OOB channel.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAX_PAYLD_SIZE_SEL</name>
                     <description>This allows firmware to read the correspondingly-named field in the eSPI Configuration register. The 001b default\n      code selects 64-byte mode, which is actually a 73-byte max payload size for eSPI (64 bytes plus MCTP wrapper bytes).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_RX_IEN</name>
               <description>OOB Channel Receive Interrupt Enable Register</description>
               <addressOffset>0x25C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RX_IEN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit RECEIVE_DONE_STATUS in the OOB Channel Receive Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
