Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>OOB_RX_STS</name>
               <description>OOB Channel Receive Status Register</description>
               <addressOffset>0x260</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>This bit is set to '1' whenever the RECEIVE_ENABLE bit in this register is cleared to '0' by hardware when an incoming\n      packet is completely transferred to SRAM. This bit is also set whenever either OVERRUN_STATUS or INTERNAL_BUS_ERROR_STATUS in\n      this register are set to '1'. (R/WC).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_BUS_ERR_STS</name>
                     <description>This bit is set to '1' whenever the channel tries to write an incoming byte into an invalid area of the internal\n      addressing space. This could happen if the OOB Channel Receive Address Register was set to something invalid by firmware. If\n      this error occurs mid-packet(crossing a boundary into an invalid space), then the remaining data is discarded. (R/WC).</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN_STS</name>
                     <description>This bit is set to '1' whenever an incoming packet is truncated because it was longer than the RECEIVE_BUFFER_LENGTH\n      field. Incoming extra bytes are discarded when this error is triggered, but the buffer receives the data up to its limit, for\n      debugging purposes. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_EN</name>
                     <description>This bit is set to '1' when firmware sets the bit SET_RECEIVE_AVAILABLE in the OOB Channel Receive Control Register\n      to '1', to indicate that an SRAM buffer is available to receive the next Down OOB packet. The OOB Channel Receive Address\n      Register and OOB Channel Receive Length Register must have already been initialized before setting this bit.\n      This bit is cleared by hardware when the next packet is received. The RECEIVE_DONE_STATUS bit is set to '1' after this bit is\n      cleared. A '0' in this bit does not necessarily present 'Not Free' status to the eSPI Master. As long as FIFO space is available\n      for a complete OOB packet, the packet can be input and held in the FIFO until this bit is again set by firmware.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IN_TAG</name>
                     <description>This field holds the 4-bit TAG in the last message received from the Master.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_TX_CTRL</name>
               <description>OOB Channel Transmit Control Register</description>
               <addressOffset>0x264</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_STRT</name>
                     <description>A write of '1' to this bit starts the transmission of an OOB packet defined by the OOB Channel Transmit Address Register and OOB\n      Channel Transmit Length Register registers. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI OOB Channel Ready Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUTG_TAG</name>
                     <description>This 4-bit value will be inserted as the TAG number in the next transmitted OOB packet. This field must be 0.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_TX_IEN</name>
               <description>OOB Channel Transmit Interrupt Enable Register</description>
               <addressOffset>0x268</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>When this bit is '1' an interrupt is generated when the bit TRANSMIT_DONE_STATUS in the OOB Channel Transmit Status\n      Register is 1. When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN_CHNG</name>
                     <description>When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the OOB Channel Transmit\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_TX_STS</name>
               <description>OOB Channel Transmit Status Register</description>
               <addressOffset>0x26C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>This bit is set to '1' whenever a Transmit operation terminates (TRANSMIT_BUSY in this register goes from '1' to '0'). (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN_CHNG_STS</name>
                     <description>This bit is set to '1' whenever the eSPI Master changes the state of the OOB Message Channel Enable bit in the OOB\n      Channel Capabilities and Configurations Master register. (R/WC).</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_BUS_ERR_STS</name>
                     <description>This error flag indicates an internal bus violation occurred in trying to transmit. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_OVRUN_STS</name>
                     <description>This error flag indicates a Start was attempted while the channel was Busy. Any Transmit in progress is\n      immediately halted. (R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD_REQ</name>
                     <description>This bit is intended for any situation where a firmware request cannot be started because it expresses\n      something impossible. This bit will be set for a request to Transmit 0 bytes or if a Transmit length is more than the\n      selected Max Payload Length. This condition brings the state machine to the Done state, as if something had actually\n      finished, with everything including the Done interrupt triggered. (R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUSY</name>
                     <description>This bit is set to '1' when firmware writes '1' to the TRANSMIT_START bit. It is cleared by hardware when\n      the transfer is complete. If the TRANSMIT_START bit is written '1' while this bit is also '1', then this will set the\n      START_OVERRUN_STATUS bit to '1' and terminate the transfer attempt immediately (Transmit Done).</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN_IMG</name>
                     <description>This bit is an image of the OOB Channel Enabled bit in the OOB Channel Receive Control Register register.\n      It is provided here so that it can be seen with the CHANNEL_ENABLE_CHANGE_STATUS Interrupt Status bit for efficiency.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_FLASH_ADDR_LSW</name>
               <description>Flash Access Channel Flash Address Register</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLSW</name>
                     <description>Before starting a Flash access, this field must be initialized to contain the value used by eSPI for addressing the Flash contents.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_BUF_ADDR_LSW</name>
               <description>Flash Access Channel Buffer Address Register</description>
               <addressOffset>0x288</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BLSW</name>
                     <description>Before starting a Flash access, this field must be initialized with the address of the data buffer in the EC's memory space.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_XFR_LEN</name>
               <description>Flash Access Channel Transfer Length Register</description>
               <addressOffset>0x290</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TLEN</name>
                     <description>Before starting a Flash access, this field must be initialized with the total number of bytes to be transferred in the\n      requested transaction sequence. If the Master attempts to transfer more bytes than this in Read Completions, the transfer is faulted\n      and the DATA_OVERRUN bit in the Flash Access Channel Status Register register is asserted.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_CTRL</name>
               <description>Flash Access Channel Control Register</description>
               <addressOffset>0x294</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSTRT</name>
                     <description>A write of '1' to this bit starts the transmission and sets the Busy status bit. A write of '0' has no effect.\n      The transmission will be inhibited if the OOB channel is not Ready, as defined in the eSPI Flash Channel Ready Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUNC</name>
                     <description>This bit selects the requested Flash function as follows:\n      11=Erase Flash Range=Larger of two ranges, if a choice exists\n      10=Erase Flash Range=Smaller of two ranges, if a choice exists\n      01=Write to Flash\n      00=Read from Flash.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>This field should always be written to zero, which is the only expected Tag value for Flash Access traffic. It provides\n      the 4-bit TAG value in the eSPI Transaction Header sent by the EC. Completion traffic from the Master is required to match this field also.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ABRT</name>
                     <description>By writing '1' to this bit while Busy==1, the transaction sequence last triggered by the Start bit is terminated, and the\n      Busy bit is cleared, at the next protocol-compliant opportunity. The clearing of the Busy bit will set the DONE status bit and the\n      ABORTED_BY_SLAVE status bit is set to '1' to acknowledge this specific action as the cause. The action of writing '1' to this bit is\n      ignored while Busy==0. This bit reads as '0' always.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_IEN</name>
               <description>Flash Access Channel Interrupt Enable Register</description>
               <addressOffset>0x298</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>When this bit is '1' an interrupt is generated when the bit DONE in the Flash Access Channel Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_STS_CHNG</name>
                     <description>When this bit is '1' an interrupt is generated when the bit CHANNEL_ENABLE_CHANGE_STATUS in the Flash Access Channel\n      Status Register is 1. When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_CFG</name>
               <description>Flash Access Channel Configuration Register</description>
               <addressOffset>0x29C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00001100</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>This bit is set to '1' when a '1' is written to the FLASH_START bit, and cleared either by hardware completion of the\n      requested operation or by firmware writing '1' to the ABORT_ACCESS bit. 1=The Channel is busy. 0=The Channel is not busy.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERAS_BLK_SIZE</name>
                     <description>This is a read-only image of the equivalent field of the eSPI Configuration register. This field is set by the Master to\n      define what the Erase block size is for the Flash being used, and whether there is a choice available to firmware.\n      111b = Reserved\n      110b = Reserved\n      101b = 256K\n      100b = 128K\n      010b = 64K\n      011b = Both 4K and 64K allowed (see FUNCTION field)\n      001b = 4K\n      000b = Reserved.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MAX_PAYLD_SEL</name>
                     <description>This is a read-only image of the equivalent field of the eSPI Configuration register, set by the Master to declare the\n      maximum number of bytes that can be used in a single Flash payload, in either direction. It will never be set greater than the value\n      provided by the EC in the FLASH_MAXIMUM_PAYLOAD_SIZE_SUPPORTED field in the eSPI Flash Channel Capabilities Register.\n      100b -- 111b = Reserved\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MAX_RD_REQ</name>
                     <description>This comes read-only from the eSPI Configuration register, set by the Master to declare the maximum number of bytes\n      that can be requested by the EC in a single Flash Read request packet.\n      111b = 4K bytes\n      110b = 2K bytes\n      101b = 1K bytes\n      100b = 512 bytes\n      011b = 256 bytes\n      010b = 128 bytes\n      001b = 64 bytes\n      000b = Reserved.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
