Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>FC_STS</name>
               <description>Flash Access Channel Status Register</description>
               <addressOffset>0x2A0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHN_EN</name>
                     <description>This bit is a Read-only image of the bit Flash Access Channel Enable in the eSPI Configuration space. Rising or\n      falling edges of this bit will set the CHANNEL_ENABLE_CHANGE_STATUS bit to 1, and may be used to trigger interrupts. A falling edge\n      on this bit, while Busy==1, will also clear the Busy bit and set the DONE bit, with DISABLED_BY_MASTER status.\n      1=Flash Access Channel Enable bit = 1. 0=Flash Access Channel Enable bit = 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHN_EN_CHNG</name>
                     <description>0=Flash Access Enable bit in eSPI Configuration space has not been changed since this bit was last cleared.\n      1=Flash Access Enable bit in eSPI Configuration space has been changed since this bit was last cleared.\n      The current state of the Flash Access Enable bit can be seen as the read-only bit CHANNEL_ENABLE_STATUS in this register.\n      This bit is cleared by writing '1'. (R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>1=Channel is done=Busy bit has been cleared since this bit was last cleared. It is cleared by writing '1'. (R/WC)\n      0=Channel is not done=Busy bit has not been cleared since this bit was last cleared.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS_MAST</name>
                     <description>This bit is set to '1' if the Flash Channel is disabled by the Master while the Busy bit is '1'. It is cleared by writing '1'. (R/WC)      1=The command finished because the Enable bit became 0. 0=The command finished without a change in the Enable bit.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_BUS_ERR</name>
                     <description>This bit is set to '1' if the internal bus master associated with the Flash Access Channel encounters a Bus Fault condition.\n      It is cleared by writing '1'. (R/WC)\n      1=Bus Error detected. 0=The command finished without a Bus Error.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT_SLAVE</name>
                     <description>This bit is set to '1' if the Abort bit is set to '1' by firmware while the Busy bit is '1', thereby clearing Busy status.\n      It is cleared by writing '1'. (R/WC)\n      1=The command finished because of the Abort bit. 0=The command finished without an Abort bit activation.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAT_OVRUN</name>
                     <description>This bit is set to '1' by a SUCCESSFUL COMPLETION response by the eSPI Master to a Read sequence, but either without\n      indicating Final Completion when the requested byte count is reached or with too many bytes provided while indicating Final Completion.\n      It is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too much data. 0=The eSPI Master finished without too much data.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCMPL</name>
                     <description>This bit is set to '1' by a SUCCESSFUL COMPLETION Read response from the eSPI Master, indicating a Final Completion, but\n      with too few bytes provided for the Transaction step that was issued by the eSPI Slave. It is cleared by writing '1'.\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master finished with too little data. 0=The eSPI Master finished with at least enough data.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAIL</name>
                     <description>This bit is set to '1' by an explicit UNSUCCESSFUL COMPLETION response from the eSPI Master, which also terminates\n      the transaction sequence. This may occur if an invalid or illegal section of Flash memory is accessed, and only at Runtime (post-boot).\n      This bit is cleared by writing '1'. (R/WC)\n      1=The eSPI Master indicated unsuccessful completion.\n      0=The eSPI Master indicated successful completion.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_OVRFLW</name>
                     <description>This bit is set if a command (initiated by setting the Start bit) has been ignored because the Busy bit was already on.\n      The transfer in progress is also brought to the Done state at the next opportunity allowed by the eSPI protocol, as if the Abort bit\n      had been set by the firmware, so that this bit will be present at a Done interrupt. This bit is cleared by writing '1'. (R/WC)\n      This flag represents a serious mis-communication between the firmware and hardware, and should be handled cautiously as a\n      special case by firmware.\n      1=Start Overflow. Firmware has attempted to trigger a transaction sequence before allowing the previous sequence to finish and\n      without using the Abort bit to terminate it first\n      0=No Start Overflow detected.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD_REQ</name>
                     <description>This bit is set to '1' when a firmware Flash Access request is invalid. For example, this bit is set for a request\n      to Read or Write 0 bytes. This bit is cleared by writing '1'. (R/WC)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VW_EN_STS</name>
               <description>Virtual Wire Status Register</description>
               <addressOffset>0x2B0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHN_EN_STS</name>
                     <description>This bit is a Read-only image of the bit Virtual Wire Channel Enable in the eSPI Configuration space.\n      1=Virtual Wire Channel Enable bit = 1; 0=Virtual Wire Channel Enable bit = 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP_ID</name>
               <description>eSPI Capabilities ID Register</description>
               <addressOffset>0x2E0</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>ESP_DEVID</name>
                     <description>The default value should not be changed.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GLB_CAP0</name>
               <description>eSPI Capabilities Global Capabilities 0 Register</description>
               <addressOffset>0x2E1</addressOffset>
               <size>8</size>
               <resetValue>0x0F</resetValue>
               <fields>
                  <field>
                     <name>PHL_CHN</name>
                     <description>1=Peripheral Channel is supported by the slave; 0=Peripheral Channel not supported by the slave.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VW_CHN</name>
                     <description>1=Virtual Wire Channel is supported by the slave; 0=Virtual Wire Channel Channel not supported by the slave.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOB_MSG_CHN</name>
                     <description>1=OOB Message Channel is supported by the slave; 0=OOB Message Channel not supported by the slave.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FC_CHN</name>
                     <description>1=Flash Access Channel is supported by the slave; 0=Flash Access Channel not supported by the slave.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GLB_CAP1</name>
               <description>eSPI Capabilities Global Capabilities 1 Register</description>
               <addressOffset>0x2E2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>MAX_FREQ</name>
                     <description>This field identifies the maximum frequency of operation supported by the slave. It corresponds to the field\n      Maximum Frequency Supported, bits [18:16] of the eSPI General Capabilities and Configurations register.\n      111b - 101b=Reserved\n      100b=66 MHz\n      011b=50 MHz\n      010b=33 MHz\n      001b=25 MHz\n      000b=20 MHz (default).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ALERT</name>
                     <description>This field is a read-only copy of the ALERT Mode field, bit 28 of the Config Offset 8h=General Capabilities\n      and Configurations Register.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IO_MODE</name>
                     <description>This field identifies the I/O modes supported by the slave. It corresponds to the field I/O Mode Support,\n      bits [25:24] of the eSPI General Capabilities and Configurations register.\n      11b=Single, Dual and Quad I/O\n      10b=Single and Quad I/O\n      01b=Single and Dual I/O\n      00b=Single I/O (default).</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_CAP</name>
               <description>eSPI Peripheral Channel Capabilities Register</description>
               <addressOffset>0x2E3</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>MAX_PAYLD_SIZE</name>
                     <description>This field identifies the maximum payload size supported by the slave. It corresponds to the field\n      Peripheral Channel Maximum Payload Size Supported, bits [6:4] of the Peripheral Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VW_CAP</name>
               <description>eSPI Virtual Wire Channel Capabilities Register</description>
               <addressOffset>0x2E4</addressOffset>
               <size>8</size>
               <resetValue>0x3F</resetValue>
               <fields>
                  <field>
                     <name>MAX_CNT</name>
                     <description>This field identifies the maximum Virtual Wire Count supported by the slave. It corresponds to the field\n      Maximum Virtual Wire Count Supported, bits [13:8] of the Virtual Wire Channel Capabilities and Configurations Register.\n      This field must be set to a number greater than or equal to 7h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_CAP</name>
               <description>eSPI OOB Channel Capabilities Register</description>
               <addressOffset>0x2E5</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>MAX_PAYLD_SIZ</name>
                     <description>This field identifies the maximum payload size supported by the slave. It corresponds to the field OOB Message\n      Channel Maximum Payload Size Supported, bits [6:4] of the OOB Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=265 bytes address max payload size\n      010b=137 bytes address max payload size\n      001b=73 bytes address max payload size\n      000b=Reserved.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_CAP</name>
               <description>eSPI Flash Channel Capabilities Register</description>
               <addressOffset>0x2E6</addressOffset>
               <size>8</size>
               <resetValue>0x21</resetValue>
               <fields>
                  <field>
                     <name>MAX_PAY_LD</name>
                     <description>This field identifies the maximum payload size supported by the slave. It corresponds to the field Flash Access\n      Channel Maximum Payload Size Supported, bits [7:0] of the Flash Channel Capabilities and Configurations Register.\n      111b - 100b=Reserved\n      011b=256 bytes address aligned max payload size\n      010b=128 bytes address aligned max payload size\n      001b=64 bytes address aligned max payload size\n      000b=Reserved.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SHAR_MODE</name>
                     <description>This field identifies the flash sharing scheme supported by the slave. It corresponds to the field Flash Sharing Mode,\n      bit [11] of the Flash Channel Capabilities and Configurations Register.\n      1=Slave attached flash sharing\n      0=Master attached flash sharing</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PC_READY</name>
               <description>eSPI Peripheral Channel Ready Register</description>
               <addressOffset>0x2E7</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PHL_CHN_RDY</name>
                     <description>Firmware sets this bit to '1' to inform the Master than the Peripheral channel is ready for transactions. It corresponds to\n      the field Peripheral Channel Ready, bit 1 of the Config Offset 10h=Peripheral Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Peripheral Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Bus Master and LTR transactions initiated by the Slave are inhibited.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OOB_READY</name>
               <description>eSPI OOB Channel Ready Register</description>
               <addressOffset>0x2E8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHN</name>
                     <description>Firmware sets this bit to '1' to inform the Master that the OOB channel is ready for transactions. It corresponds to\n      the field OOB Message Channel Ready, bit 1 of Config Offset 30h=OOB ChannelCapabilities and Configurations Register. It is\n      forced to '0' while the OOB Message Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all OOB up transactions initiated by the Slave are inhibited.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_READY</name>
               <description>eSPI Flash Channel Ready Register</description>
               <addressOffset>0x2E9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHN</name>
                     <description>Firmware sets this bit to '1' to inform the Master that the Flash channel is ready for transactions. It corresponds to\n      the field Flash Channel Ready, bit 1 of Config Offset 40h=Flash Channel Capabilities and Configurations Register. It is\n      forced to '0' while the Flash Channel Enabled bit in the Capabilities and Configurations register is 0. Once set to '1'\n      it cannot be set to '0' by firmware. It is only set to '0'by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Flash transactions initiated by the Slave are inhibited.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESET_STS</name>
               <description>eSPI Reset Interrupt Status Register</description>
               <addressOffset>0x2EA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ESP_INTR</name>
                     <description>This bit is set to '1' whenever the ESPI_RESET_PIN_STATE bit in this register changes state. It is cleared to\n      '0' whenever it is written with a '1'. Writes of a '0' have no effect. (R/WC) This bit is the source for the eSPI_RESET Interrupt.\n      The interrupt is asserted when both this bit and the ESPI_RESET_INTERRUPT_ENABLE bit in the eSPI Reset Interrupt Enable Register are '1'.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESPI_RST_PIN_STATE</name>
                     <description>This field reflects the current state of the eSPI_RESET# pin.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESET_IEN</name>
               <description>eSPI Reset Interrupt Enable Register</description>
               <addressOffset>0x2EB</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ESP_RIEN</name>
                     <description>1=The RESET_ESPI Interrupt will be asserted when the ESPI_RESET_INTERRUPT_STATUS bit in the eSPI Reset Interrupt\n      Status Register register is '1'\n      0=The RESET_ESPI Interrupt will not be asserted.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLTRST_SRC</name>
               <description>PLTRST Source Register</description>
               <addressOffset>0x2EC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>1=The PLTRST reset signal is determined a signal external to the eSPI block. The PLTRST# virtual wire is ignored\n      0=The PLTRST reset signal is determined by the PLTRST# virtual wire.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VW_READY</name>
               <description>eSPI Virtual Wire Channel Ready Register</description>
               <addressOffset>0x2ED</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CHN</name>
                     <description>Firmware sets this bit to '1' to inform the Master than the Virtual Wire channel is ready for transactions. It corresponds to\n      the field Virtual Wire Channel Ready, bit 1 of the Config Offset 20h=Channel 1 Capabilities and Configurations Register. It is\n      forced to '0' while the Virtual Wire Channel Enable bit in the Capabilities and Configurations register is 0. Once set to '1' it cannot\n      be set to '0' by firmware. It is only set to '0' by a reset, or when the Master changes the Enabled bit to '0'.\n      While this bit is '0' all Virtual Wire transactions initiated by the Slave are inhibited.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
