Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>ACTIVATE</name>
               <description>eSPI Activate Register</description>
               <addressOffset>0x330</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>1=Activate. When this bit is '1', the eSPI Logical Device is powered and functional.\n      0=Deactivate. When this bit is 0, the logical device is powered down and inactive.\n      Except for the eSPI Activate Register itself, clocks to the block are gated and the eSPI Logical Device will permit the\n      main oscillator to be shut down.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>eSPI I/O Base Address Configuration Register</description>
               <addressOffset>0x334</addressOffset>
               <size>32</size>
               <resetValue>0x002E0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESPI_MEM_ADDR</name>
               <description>eSPI Memory Base Address Configuration Register</description>
               <addressOffset>0x338</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBX_ADDR</name>
               <description>Mailbox Base Address Configuration Register</description>
               <addressOffset>0x33C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EM8042_ADDR</name>
               <description>8042 Emulated Keyboard Controller Base Address Configuration Register</description>
               <addressOffset>0x340</addressOffset>
               <size>32</size>
               <resetValue>0x00600000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC0_ADDR</name>
               <description>ACPI EC 0 Base Address Configuration Register</description>
               <addressOffset>0x344</addressOffset>
               <size>32</size>
               <resetValue>0x00620000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC1_ADDR</name>
               <description>ACPI EC 1 Base Address Configuration Register</description>
               <addressOffset>0x348</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC2_ADDR</name>
               <description>ACPI EC 2 Base Address Configuration Register</description>
               <addressOffset>0x34C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC3_ADDR</name>
               <description>ACPI EC 3 Base Address Configuration Register</description>
               <addressOffset>0x350</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_PM1_ADDR</name>
               <description>ACPI PM1 Base Address Configuration Register</description>
               <addressOffset>0x358</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FAST_KBD_ADDR</name>
               <description>I/O Base Address Configuration Register</description>
               <addressOffset>0x35C</addressOffset>
               <size>32</size>
               <resetValue>0x00920000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART0_ADDR</name>
               <description>UART 0 Base Address Configuration Register</description>
               <addressOffset>0x360</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART1_ADDR</name>
               <description>UART 1 Base Address Configuration Register</description>
               <addressOffset>0x364</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI0_ADDR</name>
               <description>Embedded Memory Interface (EMI) 2 BAR Config Register</description>
               <addressOffset>0x368</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI1_ADDR</name>
               <description>Embedded Memory Interface (EMI) 1 BAR Config Register</description>
               <addressOffset>0x36C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PORT80_0_ADDR</name>
               <description>BIOS Debug Port (Port 80) 0 BAR Config Register</description>
               <addressOffset>0x374</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PORT80_1_ADDR</name>
               <description>BIOS Debug Port (Port 80) 1 BAR Config Register</description>
               <addressOffset>0x378</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_ADDR</name>
               <description>RTC BAR Config Register</description>
               <addressOffset>0x37C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART2_ADDR</name>
               <description>UART 2 Base Address Configuration Register</description>
               <addressOffset>0x384</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GLUE_ADDR</name>
               <description>GLUE Base Address Configuration Register</description>
               <addressOffset>0x38C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESP_H_ADDR</name>
                     <description>These 16 bits are used to match eSPI I/O addresses.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBX_HOST_SIRQ_IRQ</name>
               <description>Mailbox (MBX_Host_SIRQ Interrupt) Selection Register</description>
               <addressOffset>0x3AC</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MBX_HOST_SMI_IRQ</name>
               <description>Mailbox (MBX_Host_SMI Interrupt) Selection Register</description>
               <addressOffset>0x3AD</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KIRQ_8042_IRQ</name>
               <description>8042 (KIRQ Interrupt) Selection Register</description>
               <addressOffset>0x3AE</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIRQ_8042_IRQ</name>
               <description>8042 (MIRQ Interrupt) Selection Register</description>
               <addressOffset>0x3AF</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC0_OBF_IRQ</name>
               <description>ACPI EC 0 (EC_OBF Interrupt) Selection Register</description>
               <addressOffset>0x3B0</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
