Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>ACPI_EC1_OBF_IRQ</name>
               <description>ACPI EC 1 (EC_OBF Interrupt) Selection Register</description>
               <addressOffset>0x3B1</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC2_OBF_IRQ</name>
               <description>ACPI EC 2 (EC_OBF Interrupt) Selection Register</description>
               <addressOffset>0x3B2</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPI_EC3_OBF_IRQ</name>
               <description>ACPI EC 3 (EC_OBF Interrupt) Selection Register</description>
               <addressOffset>0x3B3</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART0_IRQ</name>
               <description>UART 0 (UART Interrupt) Selection Register</description>
               <addressOffset>0x3B5</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART1_IRQ</name>
               <description>UART 1 (UART Interrupt) Selection Register</description>
               <addressOffset>0x3B6</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI0_HOST_IRQ</name>
               <description>EMI 0 (Host Event Interrupt) Selection Register</description>
               <addressOffset>0x3B7</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI0_EC_HOST_IRQ</name>
               <description>EMI 0 (EC-to-Host Interrupt) Selection Register</description>
               <addressOffset>0x3B8</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI1_HOST_IRQ</name>
               <description>EMI 1 (Host Event Interrupt) Selection Register</description>
               <addressOffset>0x3B9</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMI1_EC_HOST_IRQ</name>
               <description>EMI 1 (EC-to-Host Interrupt) Selection Register</description>
               <addressOffset>0x3BA</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_IRQ</name>
               <description>RTC (RTC Interrupt) Selection Register</description>
               <addressOffset>0x3BD</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_IRQ</name>
               <description>EC (EC_IRQ Interrupt) Selection Register</description>
               <addressOffset>0x3BE</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UART2_IRQ</name>
               <description>UART 2 (UART Interrupt) Selection Register</description>
               <addressOffset>0x3BF</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>FFh= IRQ generation from this device is disabled.\n      FEh-0=Changes in the value of the signal associated with this register are sent as a Virtual Wire transaction to the Master.\n      The Virtual Wire index is 0 for IRQ values 7Fh to 0h, and the index is 1 for IRQ values FEh to 80h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESPI_VW_ERR</name>
               <description>eSPI Virtual Wire Errors Register</description>
               <addressOffset>0x3F0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FTL_STS</name>
                     <description>This bit is a Master-readable copy of the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR_FTL_STATUS</name>
                     <description>When this field is written with a 1 the Virtual Wire ERROR_FATAL (bit 1 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent\n      to the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NFTL_STS</name>
                     <description>This bit is a Master-readable copy of the Virtual Wire ERROR_NON_FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h).</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR_NFTL_STS</name>
                     <description>When this field is written with a 1 the Virtual Wire ERROR_NON_- FATAL (bit 2 in Slave-to-Master Virtual Wire Index 5h)\n      is cleared to 0. Because clearing the status bit changes its state, a Virtual Wire packet reporting the new state will be sent to\n      the Master. Writes of 0 to this bit have no effect. Reads of this bit always return '0'.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
