Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ESPI_MEMORY</name>
         <version>143b1.0</version>
         <description>The eSPI Memory Component is one of two Logical Devices (along with the I/O Component) that provide access to all the registers in the device.</description>
         <baseAddress>0x400F3800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3C0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>BAR_LDI_MBX_H0</name>
               <description>Mailbox Memory Base Address</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC0_H0</name>
               <description>ACPI EC Channel 0 Memory BAR (LSB)</description>
               <addressOffset>0x13A</addressOffset>
               <size>16</size>
               <resetValue>0x0204</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC0_H1</name>
               <description>ACPI EC Channel 0 Memory BAR (MSB)</description>
               <addressOffset>0x13C</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC1_H0</name>
               <description>ACPI EC Channel 1 Memory BAR</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <resetValue>0x00000307</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC2_H0</name>
               <description>ACPI EC Channel 2 Memory BAR (LSB)</description>
               <addressOffset>0x14E</addressOffset>
               <size>16</size>
               <resetValue>0x0407</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC2_H1</name>
               <description>ACPI EC Channel 2 Memory BAR (MSB)</description>
               <addressOffset>0x150</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_ACPI_EC3_H0</name>
               <description>ACPI EC Channel 3 Memory BAR</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <resetValue>0x00000507</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_EM0_H0</name>
               <description>Embedded Memory Interface (EMI) 0 Memory Base Address</description>
               <addressOffset>0x16C</addressOffset>
               <size>32</size>
               <resetValue>0x0000100F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_EM1_H0</name>
               <description>Embedded Memory Interface (EMI) 1 Memory Base Address (LSB)</description>
               <addressOffset>0x176</addressOffset>
               <size>16</size>
               <resetValue>0x110F</resetValue>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LDN</name>
                     <description>These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDI_EM1_H1</name>
               <description>Embedded Memory Interface (EMI) 1 Memory Base Address (MSB)</description>
               <addressOffset>0x178</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VIR</name>
                     <description>1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_H0</name>
               <description>SRAM 0 Memory Base Address Config</description>
               <addressOffset>0x1AC</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCESS</name>
                     <description>These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_H1</name>
               <description>SRAM 0 Memory Base Address LSB</description>
               <addressOffset>0x1AE</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_H2</name>
               <description>SRAM 0 Memory Base Address MSB</description>
               <addressOffset>0x1B0</addressOffset>
               <size>32</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This is the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_H0</name>
               <description>SRAM 1 Memory Base Address Config</description>
               <addressOffset>0x1B6</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCESS</name>
                     <description>These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_H1</name>
               <description>SRAM 1 Memory Base Address LSB</description>
               <addressOffset>0x1B8</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_H2</name>
               <description>SRAM 1 Memory Base Address MSB</description>
               <addressOffset>0x1BA</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
