Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>BM_STS</name>
               <description>Bus Master Status Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_DONE1</name>
                     <description>This bit is set to '1' when a START transfer on Bus Master Channel 1 has completed, and occurs simultaneously with\n      the clearing of the BM1_BUSY bit. This may happen normally, but it is also guaranteed to happen if any of the Error bits in this\n      register section (bits[11:2]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed\n      to be in their final states, and can be examined. Firmware is required to clear this bit, by writing '1' to this bit position, before\n      altering any BM1 registers or making a new START request, otherwise interrupts from this block will be unreliable. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY1</name>
                     <description>Hardware sets this bit to 1 when the control bit BM1_START in the Bus Master 1 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[11:2]) is set by an error condition.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT1_EC</name>
                     <description>This bit is set when the control bit BM1_ABORT in the Bus Master 1 Control Register is written with a 1 during an active\n      transfer. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT1_H</name>
                     <description>A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been\n      disabled by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the\n      Peripheral Channel Enable bit is '0'. (R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT_CH2_ERR</name>
                     <description>This bit is set if an error occurs on Bus Master Channel 2 while a Channel 1 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM1_WAIT_BM2_NOT_BUSY in register Bus Master 1 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM1_TRANSFER_DONE bit is set. (R/WC)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT1_OVRFLW</name>
                     <description>This bit is set if the bit BM1_START in the Bus Master 1 Control Register is written with a 1 while the bit BM1_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM1_TRANSFER_DONE=1). (R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAT1_OVRUN</name>
                     <description>This bit is set if the transfer on Bus Master Channel 1 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCMPL1</name>
                     <description>This bit is set if the transfer on Bus Master Channel 1 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAIL1</name>
                     <description>This bit is set if a Layer 3 transaction from Bus Master Channel 1 completes with an Unsuccessful Completion packet from\n      the eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTR1_BUS_ERR</name>
                     <description>This bit is set if a transfer on Bus Master Channel 1 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 1 internal Address register. (R/WC)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD1_REQ</name>
                     <description>This bit is set, and the START request is terminated immediately (BM1_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM1_START bit is written to '1' by firmware.  (R/WC)\n      Examples of a Bad Request are:\n      Length of zero\n      Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather structure\n      of the Host memory, so is not allowed.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_DONE2</name>
                     <description>This bit is set to '1' when a START transfer on Bus Master Channel 2 has completed, and occurs simultaneously with the\n      clearing of the BM2_BUSY bit. This may happen normally, but it is guaranteed to happen also if any of the Error bits in this register\n      section (bits[27:18]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed to be in their\n      final states, and can be examined. (R/WC)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY2</name>
                     <description>Hardware sets this bit to 1 when the control bit BM2_START in the Bus Master 2 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[27:18]) is set by an error condition.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT2_EC</name>
                     <description>This bit is set when the control bit BM2_ABORT in the Bus Master 2 Control Register is written with a 1 during an active transfer. (R/WC)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT2_H</name>
                     <description>A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been disabled\n      by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral\n      Channel Enable bit is '0'. (R/WC)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT_CH1_ERR</name>
                     <description>This bit is set if an error occurs on Bus Master Channel 1 while a Channel 2 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM2_WAIT_BM1_NOT_BUSY in register Bus Master 2 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM2_TRANSFER_DONE bit is set. (R/WC)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT2_OVRFLW</name>
                     <description>This bit is set if the bit BM2_START in the Bus Master 2 Control Register is written with a 1 while the bit BM2_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM2_TRANSFER_DONE=1). (R/WC)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAT2_OVRUN</name>
                     <description>This bit is set if the transfer on Bus Master Channel 2 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCMPL2</name>
                     <description>This bit is set if the transfer on Bus Master Channel 2 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAIL2</name>
                     <description>This bit is set if a Layer 3 transaction from Bus Master Channel 2 completes with an Unsuccessful Completion packet from the\n      eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTR2_BUS_ERR</name>
                     <description>This bit is set if a transfer on Bus Master Channel 2 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 2 internal Address register. (R/WC)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD2_REQ</name>
                     <description>This bit is set, and the START request is terminated immediately (BM2_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM2_START bit is written to '1' by firmware. (R/WC)\n      Examples of a Bad Request are:\n      Length of zero, or Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather\n      structure of the Host memory, so is not allowed.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM_IEN</name>
               <description>Bus Master Interrupt Enable Register</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX1_DONE_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit BM1_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX2_DONE_EN</name>
                     <description>When this bit is '1' an interrupt is generated when the bit BM2_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM_CFG</name>
               <description>Bus Master Configuration Register</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <resetValue>0x00010000</resetValue>
               <fields>
                  <field>
                     <name>TAG1</name>
                     <description>This 4-bit Tag value is included in all eSPI traffic originating from the BM1 Bus Master instance.\n      This bit should not be modified while the bit BM1_BUSY in the Bus Master Status Register is '1'.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TAG2</name>
                     <description>This 4-bit Tag value is included in all eSPI traffic originating from the BM2 Bus Master instance.\n      This bit should not be modified while the bit BM2_BUSY in the Bus Master Status Register is '1'.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM1_CTRL</name>
               <description>Bus Master 1 Control Register</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 1. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>A write of '1' to this bit will cause an active transfer on Bus Master Channel 1 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_INTER_INCR</name>
                     <description>1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BM1WAIT_BM2NOTBUSY</name>
                     <description>1=The transfer on Bus Master Channel 1 will be held until a transfer in progress on Bus Master Channel 2 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM1_ABORTED_BY_CH2_ERROR flag set.\n      0=The transfer on Bus Master Channel 1 will proceed independently of the status of Bus Master Channel 2.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYC_TYPE</name>
                     <description>This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LEN</name>
                     <description>This field sets the length in bytes of a transfer on Bus Master Channel 1. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 1 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM1_HOST_ADDR_LSW</name>
               <description>Bus Master 1 Host Address Register (DWord 0)</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSDW</name>
                     <description>This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM1_HOST_ADDR_MSW</name>
               <description>Bus Master 1 Host Address Register (DWord 1)</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSDW</name>
                     <description>This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM1_EC_ADDR_LSW</name>
               <description>Bus Master 1 Internal Address Register</description>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IN_ADDR</name>
                     <description>This register sets the internal address to be used for a transfer on Bus Master Channel 1.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
