Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>BM2_CTRL</name>
               <description>Bus Master 2 Control Register</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 2. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>A write of '1' to this bit will cause an active transfer on Bus Master Channel 2 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_INTER_INCR</name>
                     <description>1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BM2WAIT_BM1NOTBUSY</name>
                     <description>1=The transfer on Bus Master Channel 2 will be held until a transfer in progress on Bus Master Channel 1 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM2_ABORTED_BY_CH1_ERROR flag set.\n      0=The transfer on Bus Master Channel 2 will proceed independently of the status of Bus Master Channel 1.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CYC_TYPE</name>
                     <description>This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LEN</name>
                     <description>This field sets the length in bytes of a transfer on Bus Master Channel 2. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 2 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM2_HOST_ADDR_LSW</name>
               <description>Bus Master 2 Host Address Register (DWord 0)</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSDW</name>
                     <description>This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM2_HOST_ADDR_MSW</name>
               <description>Bus Master 2 Host Address Register (DWord 1)</description>
               <addressOffset>0x22C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSDW</name>
                     <description>This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BM2_EC_ADDR_LSW</name>
               <description>Bus Master 2 Internal Address Register</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IN_ADDR</name>
                     <description>This register sets the internal address to be used for a transfer on Bus Master Channel 2.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_MBX_H0</name>
               <description>Mailbox Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x330</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_MBX_H1</name>
               <description>Mailbox Memory BAR Configuration Register (Word 1)</description>
               <addressOffset>0x332</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_MBX_H2</name>
               <description>Mailbox Memory BAR Configuration Register (Word 2)</description>
               <addressOffset>0x334</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_MBX_H3</name>
               <description>Mailbox Memory BAR Configuration Register (Word 3)</description>
               <addressOffset>0x336</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_MBX_H4</name>
               <description>Mailbox Memory BAR Configuration Register (Word 4)</description>
               <addressOffset>0x338</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC0_H0</name>
               <description>ACPI EC Channel 0 Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x33A</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC0_H1</name>
               <description>ACPI EC Channel 0 Memory BAR Configuration Register (Word 1)</description>
               <addressOffset>0x33C</addressOffset>
               <size>16</size>
               <resetValue>0x0062</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC0_H2</name>
               <description>ACPI EC Channel 0 Memory BAR Configuration Register (Word 2)</description>
               <addressOffset>0x33E</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC0_H3</name>
               <description>ACPI EC Channel 0 Memory BAR Configuration Register (Word 3)</description>
               <addressOffset>0x340</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC0_H4</name>
               <description>ACPI EC Channel 0 Memory BAR Configuration Register (Word 4)</description>
               <addressOffset>0x342</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC1_H0</name>
               <description>ACPI EC Channel 1 Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x344</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC1_H1</name>
               <description>ACPI EC Channel 1 Memory BAR Configuration Register (Word 1)</description>
               <addressOffset>0x346</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC1_H2</name>
               <description>ACPI EC Channel 1 Memory BAR Configuration Register (Word 2)</description>
               <addressOffset>0x348</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC1_H3</name>
               <description>ACPI EC Channel 1 Memory BAR Configuration Register (Word 3)</description>
               <addressOffset>0x34A</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC1_H4</name>
               <description>ACPI EC Channel 1 Memory BAR Configuration Register (Word 4)</description>
               <addressOffset>0x34C</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC2_H0</name>
               <description>ACPI EC Channel 2 Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x34E</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC2_H1</name>
               <description>ACPI EC Channel 2 Memory BAR Configuration Register (Word 1)</description>
               <addressOffset>0x350</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC2_H2</name>
               <description>ACPI EC Channel 2 Memory BAR Configuration Register (Word 2)</description>
               <addressOffset>0x352</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC2_H3</name>
               <description>ACPI EC Channel 2 Memory BAR Configuration Register (Word 3)</description>
               <addressOffset>0x354</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC2_H4</name>
               <description>ACPI EC Channel 2 Memory BAR Configuration Register (Word 4)</description>
               <addressOffset>0x356</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC3_H0</name>
               <description>ACPI EC Channel 3 Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x358</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC3_H1</name>
               <description>ACPI EC Channel 3 Memory BAR Configuration Register (Word 1)</description>
               <addressOffset>0x35A</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC3_H2</name>
               <description>ACPI EC Channel 3 Memory BAR Configuration Register (Word 2)</description>
               <addressOffset>0x35C</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC3_H3</name>
               <description>ACPI EC Channel 3 Memory BAR Configuration Register (Word 3)</description>
               <addressOffset>0x35E</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_ACPI_EC3_H4</name>
               <description>ACPI EC Channel 3 Memory BAR Configuration Register (Word 4)</description>
               <addressOffset>0x360</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
