Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>BAR_LDH_EM0_H0</name>
               <description>EMI 0 Memory BAR Configuration Register (Word 0)</description>
               <addressOffset>0x36C</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM0_H1</name>
               <description>EMI 0 Memory BAR Configuration Address Register  (Word 1)</description>
               <addressOffset>0x36E</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM0_H2</name>
               <description>EMI 0 Memory BAR Configuration Address Register  (Word 2)</description>
               <addressOffset>0x370</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM0_H3</name>
               <description>EMI 0 Memory BAR Configuration Address Register  (Word 3)</description>
               <addressOffset>0x372</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM0_H4</name>
               <description>EMI 0 Memory BAR Configuration Address Register  (Word 4)</description>
               <addressOffset>0x374</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM1_H0</name>
               <description>EMI 1 Memory BAR Configuration Register (Word 0) )</description>
               <addressOffset>0x376</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM1_H1</name>
               <description>EMI 1 Memory BAR Configuration Register (Word 1) )</description>
               <addressOffset>0x378</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM1_H2</name>
               <description>EMI 1 Memory BAR Configuration Register (Word 2) )</description>
               <addressOffset>0x37A</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM1_H3</name>
               <description>EMI 1 Memory BAR Configuration Register (Word 3) )</description>
               <addressOffset>0x37C</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_LDH_EM1_H4</name>
               <description>EMI 1 Memory BAR Configuration Register (Word 4) )</description>
               <addressOffset>0x37E</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_HOST_H0</name>
               <description>SRAM BAR 0 Configuration Register (Word 0) )</description>
               <addressOffset>0x3AC</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_HOST_H1</name>
               <description>SRAM BAR 0 Configuration Register (Word 1) )</description>
               <addressOffset>0x3AE</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_HOST_H2</name>
               <description>SRAM BAR 0 Configuration Register (Word 2) )</description>
               <addressOffset>0x3B0</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_HOST_H3</name>
               <description>SRAM BAR 0 Configuration Register (Word 3) )</description>
               <addressOffset>0x3B2</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM0_HOST_H4</name>
               <description>SRAM BAR 0 Configuration Register (Word 4) )</description>
               <addressOffset>0x3B4</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_HOST_H0</name>
               <description>SRAM BAR 1 Configuration Register (Word 0) )</description>
               <addressOffset>0x3B6</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALID</name>
                     <description>1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_HOST_H1</name>
               <description>SRAM BAR 1 Configuration Register (Word 1) )</description>
               <addressOffset>0x3B8</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W0</name>
                     <description>Bits[15:0] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_HOST_H2</name>
               <description>SRAM BAR 1 Configuration Register (Word 2) )</description>
               <addressOffset>0x3BA</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W1</name>
                     <description>Bits[31:16] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_HOST_H3</name>
               <description>SRAM BAR 1 Configuration Register (Word 3) )</description>
               <addressOffset>0x3BC</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W2</name>
                     <description>Bits[47:32] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAR_SRAM1_HOST_H4</name>
               <description>SRAM BAR 1 Configuration Register (Word 4) )</description>
               <addressOffset>0x3BE</addressOffset>
               <size>16</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ESP_H_ADDR_W3</name>
                     <description>Bits[63:48] of the 64 bits that are used to match eSPI memory addresses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
