Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ESPI_MSVW00_06</name>
         <version>143c1.0</version>
         <description>The ESPI VW Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC</description>
         <baseAddress>0x400F9C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x54</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ24</name>
            <value>15</value>
         </interrupt>
         <registers>
            <register>
               <name>MSVW00_DW0</name>
               <description>Master-to-Slave Virtual Wire 0 Register (DW 0)</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. When the Index field of an incoming Master-to-Slave Virtual Wire transaction\n      matches this value, the fields SRC0, SRC1, SRC2 and SRC3 are updated by the data contained in the respective bit positions in the\n      transaction. Setting the INDEX field to 0 disables the register from accepting any Virtual Wire traffic from the Master. Setting the\n      INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by M2S RESET SRC is\n      asserted. If MTOS_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW00_DW1</name>
               <description>Master-to-Slave Virtual Wire 0 Register (DW 1)</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x04040404</resetValue>
               <fields>
                  <field>
                     <name>SRC0IRQ_SEL</name>
                     <description>A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC1IRQ_SEL</name>
                     <description>A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC2IRQ_SEL</name>
                     <description>A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC3IRQ_SEL</name>
                     <description>A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW00_DW2</name>
               <description>Master-to-Slave Virtual Wire 0 Register (DW 2)</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW01_DW0</name>
               <description>Master-to-Slave Virtual Wire 1 Register (DW 0)</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. When the Index field of an incoming Master-to-Slave Virtual Wire transaction\n      matches this value, the fields SRC0, SRC1, SRC2 and SRC3 are updated by the data contained in the respective bit positions in the\n      transaction. Setting the INDEX field to 0 disables the register from accepting any Virtual Wire traffic from the Master. Setting the\n      INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by M2S RESET SRC is\n      asserted. If MTOS_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW01_DW1</name>
               <description>Master-to-Slave Virtual Wire 1 Register  (DW 1)</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x04040404</resetValue>
               <fields>
                  <field>
                     <name>SRC0IRQ_SEL</name>
                     <description>A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC1IRQ_SEL</name>
                     <description>A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC2IRQ_SEL</name>
                     <description>A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC3IRQ_SEL</name>
                     <description>A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW01_DW2</name>
               <description>Master-to-Slave Virtual Wire 1 Register (DW 2)</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW02_DW0</name>
               <description>Master-to-Slave Virtual Wire 2 Register (DW 0)</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000307</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. When the Index field of an incoming Master-to-Slave Virtual Wire transaction\n      matches this value, the fields SRC0, SRC1, SRC2 and SRC3 are updated by the data contained in the respective bit positions in the\n      transaction. Setting the INDEX field to 0 disables the register from accepting any Virtual Wire traffic from the Master. Setting the\n      INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by M2S RESET SRC is\n      asserted. If MTOS_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW02_DW1</name>
               <description>Master-to-Slave Virtual Wire 2 Register (DW 1)</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x04040404</resetValue>
               <fields>
                  <field>
                     <name>SRC0IRQ_SEL</name>
                     <description>A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC1IRQ_SEL</name>
                     <description>A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC2IRQ_SEL</name>
                     <description>A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC3IRQ_SEL</name>
                     <description>A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW02_DW2</name>
               <description>Master-to-Slave Virtual Wire 2 Register (DW 2)</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW03_DW0</name>
               <description>Master-to-Slave Virtual Wire 3 Register (DW 0)</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000041</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. When the Index field of an incoming Master-to-Slave Virtual Wire transaction\n      matches this value, the fields SRC0, SRC1, SRC2 and SRC3 are updated by the data contained in the respective bit positions in the\n      transaction. Setting the INDEX field to 0 disables the register from accepting any Virtual Wire traffic from the Master. Setting the\n      INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MTOS_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by M2S RESET SRC is\n      asserted. If MTOS_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW03_DW1</name>
               <description>Master-to-Slave Virtual Wire 3 Register (DW 1)</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x04040404</resetValue>
               <fields>
                  <field>
                     <name>SRC0IRQ_SEL</name>
                     <description>A change in the value of SRC0 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC1IRQ_SEL</name>
                     <description>A change in the value of SRC1 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC2IRQ_SEL</name>
                     <description>A change in the value of SRC2 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC3IRQ_SEL</name>
                     <description>A change in the value of SRC3 will generate an interrupt to the EC. Changes in the SRC register value caused by a Reset Event\n      do not generate an interrupt.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSVW03_DW2</name>
               <description>Master-to-Slave Virtual Wire 3 Register (DW 2)</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Master-to-Slave data for Bit Position 0 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Master-to-Slave data for Bit Position 1 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Master-to-Slave data for Bit Position 2 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Master-to-Slave data for Bit Position 3 for the virtual wire associated with the index defined by INDEX.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
