Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SMVW03_DW0</name>
               <description>Slave-to-Master Virtual Wire 3 Register (DWord 0)</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. A write to this register that changes the value of any one or more of SRC0, SRC1,\n      SRC2 or SRC3 will generate a Slave-to-Master Virtual Wire transaction with this index. Setting the INDEX field to 0 disables the register\n      from generating any Virtual Wire traffic to the Master. Setting the INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STOM_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>STOM_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by S2M RESET SRC is\n      asserted. If STOM_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CHNG0</name>
                     <description>This bit is set to 1 whenever the value in Bit0 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG1</name>
                     <description>This bit is set to 1 whenever the value in Bit1 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG2</name>
                     <description>This bit is set to 1 whenever the value in Bit2 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG3</name>
                     <description>This bit is set to 1 whenever the value in Bit3 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMVW03_DW1</name>
               <description>Slave-to-Master Virtual Wire 3 Register (DWord 1)</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMVW04_DW0</name>
               <description>Slave-to-Master Virtual Wire 4 Register (DWord 0)</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000045</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. A write to this register that changes the value of any one or more of SRC0, SRC1,\n      SRC2 or SRC3 will generate a Slave-to-Master Virtual Wire transaction with this index. Setting the INDEX field to 0 disables the register\n      from generating any Virtual Wire traffic to the Master. Setting the INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STOM_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>STOM_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by S2M RESET SRC is\n      asserted. If STOM_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CHNG0</name>
                     <description>This bit is set to 1 whenever the value in Bit0 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG1</name>
                     <description>This bit is set to 1 whenever the value in Bit1 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG2</name>
                     <description>This bit is set to 1 whenever the value in Bit2 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG3</name>
                     <description>This bit is set to 1 whenever the value in Bit3 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMVW04_DW1</name>
               <description>Slave-to-Master Virtual Wire 4 Register (DWord 1)</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMVW05_DW0</name>
               <description>Slave-to-Master Virtual Wire 5 Register (DWord 0)</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000046</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>The Index for SRC0, SRC1, SRC2 and SRC3. A write to this register that changes the value of any one or more of SRC0, SRC1,\n      SRC2 or SRC3 will generate a Slave-to-Master Virtual Wire transaction with this index. Setting the INDEX field to 0 disables the register\n      from generating any Virtual Wire traffic to the Master. Setting the INDEX field to 1 is illegal, since INDEX=1 is reserved for Serial IRQ.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STOM_SRC</name>
                     <description>This field determines which reset signal in addition to RESET_SYS resets SRC[3:0] in this register:\n      3=PLTRST\n      2=RESET_SIO\n      1=RESET_SYS. This is the only reset signal that will reset the SRC fields.\n      0=RESET_ESPI.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>STOM_R_STATE</name>
                     <description>The four bits in this field are loaded into SRC0, SRC1, SRC2 and SRC3 when the reset signal selected by S2M RESET SRC is\n      asserted. If STOM_SRC is set for RESET_SYS, the SRC bits are set to the default value of this field, rather than its programmed value,\n      since this field is also reset on RESET_SYS.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CHNG0</name>
                     <description>This bit is set to 1 whenever the value in Bit0 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG1</name>
                     <description>This bit is set to 1 whenever the value in Bit1 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG2</name>
                     <description>This bit is set to 1 whenever the value in Bit2 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHNG3</name>
                     <description>This bit is set to 1 whenever the value in Bit3 in this register changes. This bit is set to 0 whenever the 4 data bits in\n      this register are transmitted to the Host by a Slave-to-Master Virtual Wire transaction. It is also set to 0 when this entire register is\n      reset, ignoring any change in the data bit value caused by the reset event.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMVW05_DW1</name>
               <description>Slave-to-Master Virtual Wire 5 Register (DWord 1)</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC0</name>
                     <description>Slave-to-Master data for Bit Position 0 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Slave-to-Master data for Bit Position 1 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Slave-to-Master data for Bit Position 2 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Slave-to-Master data for Bit Position 3 for the virtual wire associated with the index defined by INDEX. The most recent value\n      of this bit is transmitted to the Master, even if the bit changes multiple times before the Master issues the Virtual Wire read transaction.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
