Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GCR</name>
         <version>1011.0</version>
         <description>The Logical Device Configuration registers support motherboard designs in\n        which the resources required by their components are known and assigned by the BIOS\n        at POST.</description>
         <baseAddress>0x400FFF00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x22</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>LDN</name>
               <description>A write to this register selects the current logical device. This allows access to the control and configuration\n     registers for each logical device. Note: The Activate command operates only on the selected logical device.</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DEV_REV</name>
               <description>A read-only register which provides device revision information.</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DEV_SUBID</name>
               <description>A read-only register which provides device sub ID information.</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x24</resetValue>
            </register>
            <register>
               <name>DEV_ID</name>
               <description>A read-only register which provides device identification.</description>
               <addressOffset>0x1E</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0020</resetValue>
            </register>
            <register>
               <name>LEG_DEV_ID</name>
               <description>A read-only register which provides legacy device identification.</description>
               <addressOffset>0x20</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFE</resetValue>
            </register>
            <register>
               <name>LEG_DEV_REV</name>
               <description>A read-only register which provides legacy device revision information.</description>
               <addressOffset>0x21</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xA0</resetValue>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>KBC</name>
         <version>321.0</version>
         <description>The Keyboard Controller is a Host/EC Message Interface with hardware assists to emulate 8042 behavior</description>
         <baseAddress>0x400F0400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x331</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>KBC_OBE</name>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>KBC_IBF</name>
            <value>59</value>
         </interrupt>
         <registers>
            <register>
               <name>HOST_DATA</name>
               <description>READ_DATA. This 8-bit register is read-only. When read by the Host, the PCOBF and/or AUXOBF interrupts are cleared and the\n     OBF flag in the status register is cleared.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HOST_EC_DATA</name>
               <description>WRITE_DATA. This 8-bit register is write-only. When written, the C/D bit in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host,\n     it functions as the EC_HOST Data / AUX Data Register.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HOST_WC</name>
               <description>WRITE_CMD. This 8-bit register is write-only and is an alias of the register at offset 0h. When written, the C/D bit in the\n     Keyboard Status Read Register is set to '1', signifying a command, and the IBF in the same register is set to '1'. When the Runtime\n     Register at offset 4h is read by the Host, it functions as the Keyboard Status Read Register.</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HOST_RS</name>
               <description>Keyboard Status Read Register. This register is a read-only alias of the EC Keyboard Status Register.</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>OBF</name>
                     <description>Output Buffer Full.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF</name>
                     <description>Input Buffer Full.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD0</name>
                     <description>User-defined data.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD_DAT</name>
                     <description>Command Data. This bit specifies whether the input data register contains data or a command ('0' = data, '1' = command).</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD1</name>
                     <description>User-defined data.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUXOBF</name>
                     <description>Auxiliary Output Buffer Full.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD2</name>
                     <description>User-defined data.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>H2EC_DATA</name>
               <description>Host_EC Data/Cmd Register  This register is an alias of the HOST_EC Data / CMD Register. When read at the EC-Only offset\n     of 0h, it returns the data written by the Host to either Runtime Register offset 0h or Runtime Register offset 04h.</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EC_DATA</name>
               <description>EC_Host Data Register</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EC_KBD_STS</name>
               <description>Keyboard Status Register</description>
               <addressOffset>0x104</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>OBF</name>
                     <description>Output Buffer Full.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF</name>
                     <description>Input Buffer Full.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD0</name>
                     <description>User-defined data.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD_DAT</name>
                     <description>Command Data. This bit specifies whether the input data register contains data or a command ('0' = data, '1' = command).</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD1</name>
                     <description>User-defined data.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUXOBF</name>
                     <description>Auxiliary Output Buffer Full.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD2</name>
                     <description>User-defined data.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KBCTRL</name>
               <description>Keyboard Control Register</description>
               <addressOffset>0x108</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UD3</name>
                     <description>User-defined data.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAEN</name>
                     <description>Software-assist enable. 1=This bit allows control of the GATEA20 signal via firmware\n      0=GATEA20 corresponds to either the last Host-initiated control of GATEA20 or the firmware write to the Keyboard Control Register or the EC AUX Data Register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCOBFEN</name>
                     <description>1= reflects the value written to the PCOBF Register, 0=PCOBF reflects the status of writes to the EC Data Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD4</name>
                     <description>User-defined data.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OBFEN</name>
                     <description>When this bit is '1', the system interrupt signal KIRQ is driven by the bit PCOBF and MIRQ is driven by AUXOBF. When this\n      bit is '0', KIRQ and MIRQ are driven low. This bit must not be changed when OBF of the status register is equal to '1'.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UD5</name>
                     <description>User-defined data.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUXH</name>
                     <description>AUX in Hardware. 1=AUXOBF of the Keyboard Status Read Register is set in hardware by a write to the EC AUX Data Register\n                0=AUXOBF is not modified in hardware, but can be read and written by the EC using the EC-Only alias of the EC Keyboard Status Register</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_AUX_DATA</name>
               <description>EC_Host Aux Register. This 8-bit register is write-only. When written, the C/D in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host, it\n     functions as the EC_HOST Data / AUX Data Register.</description>
               <addressOffset>0x10C</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>PCOBF</name>
               <description>8042 Emulated Keyboard Controller PCOBF Register</description>
               <addressOffset>0x114</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PCOBF</name>
                     <description>PCOBF Register: If enabled by the bit OBFEN, the bit PCOBF is gated onto KIRQ. The KIRQ signal is a system interrupt\n      which signifies that the EC has written to the HOST2EC Data Register (EC-Only offset 0h).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACTIVATE</name>
               <description>Activate Register</description>
               <addressOffset>0x330</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>1=The 8042 Interface is powered and functional. 0=The 8042 Interface is powered down and inactive.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
