Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EMI0</name>
         <version>841.0</version>
         <description>The EMI provides a communication between system host and Embedded Controller</description>
         <groupName>EMI</groupName>
         <prependToName>EMI_</prependToName>
         <baseAddress>0x400F4000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x118</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EMI0</name>
            <value>42</value>
         </interrupt>
         <registers>
            <register>
               <name>RT_HOST2EC</name>
               <description>Host-to-EC Mailbox Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RT_EC2HOST</name>
               <description>EC-to-Host Mailbox Register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RT_EC_ADDR_LSB</name>
               <description>EC Address Access Control Register</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACCESS_TYPE</name>
                     <description>This field defines the type of access that occurs when the EC Data Register is read or written.\n                11b=Auto-increment 32-bit access. 10b=32-bit access. 01b=16-bit access. 00b=8-bit access.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>This field defines bits[7:2] of EC_Address [15:0]. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_EC_ADDR_MSB</name>
               <description>EC Address Access Control Register</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This field defines bits[14:8] of EC_Address. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REGION</name>
                     <description>The field specifies which of two segments in the 32-bit internal address space is to be accessed by the EC_Address[14:2]\n      to generate accesses to the memory.\n      1=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 1 Register.\n      0=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 0 Register.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_DATA</name>
               <description>EC Data Byte Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RT_INTR_SRC_LSB</name>
               <description>Interrupt Source LSB Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EC_WR</name>
                     <description>EC Mailbox Write. This bit is set when the EC-to-HOST Mailbox Register has been written by the EC at offset 01h\n      of the EC-Only registers. Note: there is no corresponding mask bit in the Interrupt Mask LSB Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_SWI_LSB</name>
                     <description>EC Software Interrupt Least Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_INTR_SRC_MSB</name>
               <description>Interrupt Source MSB Register</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EC_SWI_MSB</name>
                     <description>EC Software Interrupt Most Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_INTR_MASK_LSB</name>
               <description>Interrupt Mask LSB Register</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>Test Bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_SWI_EN_LSB</name>
                     <description>EC Software Interrupt Enable Least Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source LSB Register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_INTR_MASK_MSB</name>
               <description>Interrupt Mask MSB Register</description>
               <addressOffset>0xB</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EC_SWI_EN_MSB</name>
                     <description>EC Software Interrupt Enable Most Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source MSB Register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RT_APP_ID</name>
               <description>Application ID Register, APPLICATION_ID When this field is 00h it can be written with any value. When set to a non-zero value, writing that value will clear this register to 00h. When set to a non-zero value, writing any value other than the current contents will have no effect.</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HOST2EC</name>
               <description>Host-to-EC Mailbox Register, 8-bit mailbox used communicate information from the system host to the embedded controller. Writing this register generates an event to notify the embedded controller. (R/WC)</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EC2HOST</name>
               <description>EC-to-Host Mailbox Register, 8-bit mailbox used communicate information from the embedded controller to the system host. Writing this register generates an event to notify the system host.</description>
               <addressOffset>0x101</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>MEM0_BASE</name>
               <description>Memory Base Address 0 Register [31:2] This memory base address defines the beginning of region 0 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 0 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 0. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_0 + EC_Address.</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>MEM0_RD_LIMITS</name>
               <description>Memory Read Limit 0 Register [14:2] Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_Address is 0, the field EC_Address[14:2] in the EC_Address_Register is compared to this field. As long as EC_Address[14:2] is less than this field the EC_Data_Register will be loaded from the 24-bit internal address space.</description>
               <addressOffset>0x108</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>MEM0_WR_LIMITS</name>
               <description>Memory Write Limit 0 Register [14:2] Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 0, the field EC_ADDRESS_MSB in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_0[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_0[14:2] no writes will take place.</description>
               <addressOffset>0x10A</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>MEM1_BASE</name>
               <description>Memory Base Address 1 Register. [31:2] This memory base address defines the beginning of region 1 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 1 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 1. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_1 + EC_Address.</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>MEM1_RD_LIMITS</name>
               <description>Memory Read Limit 1 Register, [14:2]: Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_ADDRESS is 1, the field EC_ADDRESS in the EC_Address_Register is compared to this field. As long as EC_ADDRESS is less than this value, the EC_Data_Register will be loaded from the 24-bit internal address space.</description>
               <addressOffset>0x110</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>MEM1_WR_LIMITS</name>
               <description>Memory Write Limit 1 Register, [14:2]: Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 1, the field EC_Address[14:2] in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_1[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_1[14:2] no writes will take place.</description>
               <addressOffset>0x112</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>INTR_SET</name>
               <description>[15:1] Interrupt Set Register, Writing a bit in this field with a '1b' sets the corresponding bit in the Interrupt Source Register to '1b'. Writing a bit in this field with a '0b' has no effect. Reading this field returns the current contents of the Interrupt Source Register.</description>
               <addressOffset>0x114</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
            <register>
               <name>HOST_CLR_EN</name>
               <description>[15:1] Host Clear Enable Register, When a bit in this field is '0b', the corresponding bit in the Interrupt Source Register cannot be cleared by writes to the Interrupt Source Register. When a bit in this field is '1b', the corresponding bit in the Interrupt Source Register can be cleared when that register bit is written with a '1b'.</description>
               <addressOffset>0x116</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
            </register>
