Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="EMI0">
         <name>EMI1</name>
         <baseAddress>0x400F4400</baseAddress>
         <interrupt>
            <name>EMI1</name>
            <value>43</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>MBX</name>
         <version>1501.0</version>
         <description>The Mailbox provides a standard run-time mechanism for the host to communicate with the Embedded Controller (EC).</description>
         <baseAddress>0x400F0000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x130</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MBOX</name>
            <value>60</value>
         </interrupt>
         <registers>
            <register>
               <name>RT_IDX</name>
               <description>MBX_Index Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RT_DATA</name>
               <description>MBX_Data_Register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>H2EC</name>
               <description>If enabled, an interrupt to the EC marked by the MBX_DATA bit in the Interrupt Aggregator will be generated whenever the Host writes this register. This register is cleared when written with FFh.</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>EC2H</name>
               <description>An EC write to this register will set bit EC_WR in the SMI Interrupt Source Register to '1b'. If enabled, this will generate a Host SMI. This register is cleared when written with FFh.</description>
               <addressOffset>0x104</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>SMI_SRC</name>
               <description>SMI Interrupt Source Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EC_WR</name>
                     <description>EC Mailbox Write. This bit is set automatically when the EC-to-Host Mailbox Register has been written. An SMI or SIRQ\n      to the Host is generated when n this bit is '1b' and the corresponding bit in the SMI Interrupt Mask Register register is '1b'.\n      This bit is automatically cleared by a read of the EC-to-Host Mailbox Register through the Host Access Port.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC_SWI</name>
                     <description>EC Software Interrupt. An SIRQ to the Host is generated when any bit in this register when this bit is set to '1b' and\n      the corresponding bit in the SMI Interrupt Mask Register register is '1b'.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMI_MASK</name>
               <description>SMI Interrupt Mask Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ECWR_EN</name>
                     <description>EC Mailbox Write.Interrupt Enable. Each bit in this field that is '1b' enables the generation of SIRQ interrupts when the\n      corresponding bit in the EC_SWI field in the SMI Interrupt Source Register is '1b'.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECSWI_EN</name>
                     <description>EC Software Interrupt Enable. If this bit is '1b', the bit EC_WR in the SMI Interrupt Source Register is enabled for the\n      generation of SIRQ or nSMI events.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>0x4</dimIncrement>
               <name>MBX_REG[%s]</name>
               <description/>
               <addressOffset>0x110</addressOffset>
               <register>
                  <name>u32</name>
                  <description>SOURCE</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>2</dimIncrement>
                  <name>u16[%s]</name>
                  <description>ENABLE SET</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <resetValue>0x00000000</resetValue>
               </register>
               <register>
                  <dim>4</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>u08[%s]</name>
                  <description>RESULT</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00000000</resetValue>
               </register>
            </cluster>
