Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>UART0</name>
         <version>391.0</version>
         <description>The 16550 UART is a full-function Two Pin Serial Port that supports the standard RS-232 Interface.</description>
         <groupName>UART</groupName>
         <prependToName>UART_</prependToName>
         <baseAddress>0x400F2400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3F1</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ15</name>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>UART0</name>
            <value>40</value>
         </interrupt>
         <registers>
            <cluster>
               <name>DATA</name>
               <description>UART when DLAB=0</description>
               <headerStructName>UartData</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>RX_DAT</name>
                  <description>UART Receive (Read) Buffer Register (DLAB=0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>TX_DAT</name>
                  <description>UART Transmit (Write) Buffer Register (DLAB=0)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <access>write-only</access>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>IEN</name>
                  <description>UART Interrupt Enable Register (DLAB=0)</description>
                  <addressOffset>0x1</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>ERDAI</name>
                        <description>ERDAI This bit enables the Received Data Available Interrupt (and timeout interrupts in the FIFO mode) when set to logic '1'.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETHREI</name>
                        <description>ETHREI This bit enables the Transmitter Holding Register Empty Interrupt when set to logic '1'.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ELSI</name>
                        <description>ELSI This bit enables the Received Line Status Interrupt when set to logic '1'.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EMSI</name>
                        <description>EMSI  This bit enables the MODEM Status Interrupt when set to logic '1'.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFO_CR</name>
                  <description>UART FIFO Control Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>write-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EXRF</name>
                        <description>EXRF Enable XMIT and RECV FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLR_RECV_FIFO</name>
                        <description>CLEAR_RECV_FIFO  Setting this bit to a logic '1' clears all bytes in the RCVR FIFO and resets its counter logic to '0'.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLR_XMIT_FIFO</name>
                        <description>CLEAR_XMIT_FIFO  Setting this bit to a logic '1' clears all bytes in the XMIT FIFO and resets its counter logic to '0' . The shift register is not cleared. This bit is self-clearing.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMA_MODE_SEL</name>
                        <description>DMA_MODE_SELECT  Writing to this bit has no effect on the operation of the UART. The RXRDY and TXRDY pins are not available on this chip.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RECV_FIFO_TRIG_LVL</name>
                        <description>RECV_FIFO_TRIGGER_LEVEL These bits are used to set the trigger level for the RCVR FIFO interrupt.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INT_ID</name>
                  <description>UART Interrupt Identification Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>IPEND</name>
                        <description>IPEND  This bit can be used in either a hardwired prioritized or polled environment to indicate whether an interrupt is pending.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTID</name>
                        <description>INTID  These bits identify the highest priority interrupt pending</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FIFO_EN</name>
                        <description>These two bits are set when the FIFO CONTROL Register bit 0 equals 1.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LCR</name>
                  <description>UART Line Control Register</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>WORD_LEN</name>
                        <description>WORD_LENGTH These two bits specify the number of bits in each transmitted or received serial character.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>STOP_BITS</name>
                        <description>STOP_BITS  This bit specifies the number of stop bits in each transmitted or received serial character.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EN_PAR</name>
                        <description>ENABLE_PARITY  Parity Enable bit.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PAR_SEL</name>
                        <description>PARITY_SELECT Even Parity Select bit.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STICK_PAR</name>
                        <description>STICK_PARITY  Stick Parity bit.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BRK_CTRL</name>
                        <description>BREAK_CONTROL Set Break Control bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DLAB</name>
                        <description>DLAB Divisor Latch Access Bit (DLAB).</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MCR</name>
                  <description>UART Modem Control Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DTR</name>
                        <description>DTR  This bit controls the Data Terminal Ready (nDTR) output.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RTS</name>
                        <description>RTS  This bit controls the Request To Send (nRTS) output.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1</name>
                        <description>OUT1 This bit controls the Output 1 (OUT1) bit.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2</name>
                        <description>OUT2  This bit is used to enable an UART interrupt.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOOPBACK</name>
                        <description>LOOPBACK  This bit provides the loopback feature for diagnostic testing of the Serial Port.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSR</name>
                  <description>UART Line Status Register</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DATA_READY</name>
                        <description>DATA_READY  Data Ready. It is set to a logic '1' whenever a complete incoming character has been received and transferred into the Receiver Buffer Register or the FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVERRUN</name>
                        <description>OVERRUN  Overrun Error.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PE</name>
                        <description>PARITY ERROR  Parity Error.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRAME_ERR</name>
                        <description>FRAME_ERROR Framing Error.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BRK_INTR</name>
                        <description>BREAK_INTERRUPT   Break Interrupt.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRANS_EMPTY</name>
                        <description>TRANSMIT_EMPTY  Transmitter Holding Register Empty Bit 5 indicates that the Serial Port is ready to accept a new character for transmission.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRANS_ERR</name>
                        <description>Transmitter Empty. Bit 6 is set to a logic '1' whenever the Transmitter Holding Register (THR) and Transmitter Shift Register (TSR) are both empty.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFO_ERR</name>
                        <description>FIFO_ERROR</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MSR</name>
                  <description>UART Modem Status Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CTS</name>
                        <description>CTS  Delta Clear To Send (DCTS).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSR</name>
                        <description>DSR  Delta Data Set Ready (DDSR).</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RI</name>
                        <description>RI  Trailing Edge of Ring Indicator (TERI).</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCD</name>
                        <description>DCD  Delta Data Carrier Detect (DDCD).</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nCTS</name>
                        <description>nCTS  This bit is the complement of the Clear To Send (nCTS) input.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nDSR</name>
                        <description>This bit is the complement of the Data Set Ready (nDSR) input.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nRI</name>
                        <description>nRI This bit is the complement of the Ring Indicator (nRI) input.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nDCD</name>
                        <description>nDCD   This bit is the complement of the Data Carrier Detect (nDCD) input.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SCR</name>
                  <description>UART Scratchpad Register    This 8 bit read/write register has no effect on the operation of the Serial Port. It is intended as a scratchpad register to be used by the programmer to hold data temporarily.</description>
                  <addressOffset>0x7</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>ACTIVATE</name>
                  <description>UART Activate Register. [0:0] ACTIVATE When this bit is 1, the UART logical device is powered and functional. When this bit is 0, the UART logical device is powered down and inactive.</description>
                  <addressOffset>0x330</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>CFG_SEL</name>
                  <description>UART Config Select Register</description>
                  <addressOffset>0x3F0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CLK_SRC</name>
                        <description>CLK_SRC  1=The UART Baud Clock is derived from an external clock source, 0=The UART Baud Clock is derived from one of the two internal clock sources</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PWR</name>
                        <description>POWER  1=The RESET reset signal is derived from nSIO_RESET, 0=The RESET reset signal is derived from VCC1_RESET</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>POLAR</name>
                        <description>POLARITY  1=The UART_TX and UART_RX pins functions are inverted, 0=The UART_TX and UART_RX pins functions are not inverted</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>DLAB</name>
               <description>UART when DLAB=1</description>
               <alternateCluster>DATA</alternateCluster>
               <headerStructName>UartDlab</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>BAUDRT_LSB</name>
                  <description>UART Programmable BAUD Rate Generator (LSB) Register (DLAB=1)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>BAUDRT_MSB</name>
                  <description>UART Programmable BAUD Rate Generator (MSB) Register (DLAB=1). [6:0] BAUD_RATE_DIVISOR_MSB, [7:7] BAUD_CLK_SEL \n            1=If CLK_SRC is '0', the baud clock is derived from the 1.8432MHz_Clk. If CLK_SRC is '1', this bit has no effect\n            0=If CLK_SRC is '0', the baud clock is derived from the 24MHz_Clk. If CLK_SRC is '1', this bit has no effect</description>
                  <addressOffset>0x1</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>FIFO_CR</name>
                  <description>UART FIFO Control Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>write-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EXRF</name>
                        <description>EXRF Enable XMIT and RECV FIFO.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLR_RECV_FIFO</name>
                        <description>CLEAR_RECV_FIFO  Setting this bit to a logic '1' clears all bytes in the RCVR FIFO and resets its counter logic to '0'.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLR_XMIT_FIFO</name>
                        <description>CLEAR_XMIT_FIFO  Setting this bit to a logic '1' clears all bytes in the XMIT FIFO and resets its counter logic to '0' . The shift register is not cleared. This bit is self-clearing.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMA_MODE_SEL</name>
                        <description>DMA_MODE_SELECT  Writing to this bit has no effect on the operation of the UART. The RXRDY and TXRDY pins are not available on this chip.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RECV_FIFO_TRIG_LVL</name>
                        <description>RECV_FIFO_TRIGGER_LEVEL These bits are used to set the trigger level for the RCVR FIFO interrupt.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
