Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
               <register>
                  <name>INT_ID</name>
                  <description>UART Interrupt Identification Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>IPEND</name>
                        <description>IPEND  This bit can be used in either a hardwired prioritized or polled environment to indicate whether an interrupt is pending.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTID</name>
                        <description>INTID  These bits identify the highest priority interrupt pending</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FIFO_EN</name>
                        <description>These two bits are set when the FIFO CONTROL Register bit 0 equals 1.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LCR</name>
                  <description>UART Line Control Register</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>WORD_LEN</name>
                        <description>WORD_LENGTH These two bits specify the number of bits in each transmitted or received serial character.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>STOP_BITS</name>
                        <description>STOP_BITS  This bit specifies the number of stop bits in each transmitted or received serial character.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EN_PAR</name>
                        <description>ENABLE_PARITY  Parity Enable bit.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PAR_SEL</name>
                        <description>PARITY_SELECT Even Parity Select bit.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STICK_PAR</name>
                        <description>STICK_PARITY  Stick Parity bit.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BRK_CTRL</name>
                        <description>BREAK_CONTROL Set Break Control bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DLAB</name>
                        <description>DLAB Divisor Latch Access Bit (DLAB).</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MCR</name>
                  <description>UART Modem Control Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DTR</name>
                        <description>DTR  This bit controls the Data Terminal Ready (nDTR) output.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RTS</name>
                        <description>RTS  This bit controls the Request To Send (nRTS) output.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1</name>
                        <description>OUT1 This bit controls the Output 1 (OUT1) bit.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2</name>
                        <description>OUT2  This bit is used to enable an UART interrupt.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOOPBACK</name>
                        <description>LOOPBACK  This bit provides the loopback feature for diagnostic testing of the Serial Port.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LSR</name>
                  <description>UART Line Status Register</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DATA_READY</name>
                        <description>DATA_READY  Data Ready. It is set to a logic '1' whenever a complete incoming character has been received and transferred into the Receiver Buffer Register or the FIFO</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OVERRUN</name>
                        <description>OVERRUN  Overrun Error.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PE</name>
                        <description>PARITY ERROR  Parity Error.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRAME_ERR</name>
                        <description>FRAME_ERROR Framing Error.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BRK_INTR</name>
                        <description>BREAK_INTERRUPT   Break Interrupt.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRANS_EMPTY</name>
                        <description>TRANSMIT_EMPTY  Transmitter Holding Register Empty Bit 5 indicates that the Serial Port is ready to accept a new character for transmission.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRANS_ERR</name>
                        <description>Transmitter Empty. Bit 6 is set to a logic '1' whenever the Transmitter Holding Register (THR) and Transmitter Shift Register (TSR) are both empty.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFO_ERR</name>
                        <description>FIFO_ERROR</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MSR</name>
                  <description>UART Modem Status Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CTS</name>
                        <description>CTS  Delta Clear To Send (DCTS).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSR</name>
                        <description>DSR  Delta Data Set Ready (DDSR).</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RI</name>
                        <description>RI  Trailing Edge of Ring Indicator (TERI).</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCD</name>
                        <description>DCD  Delta Data Carrier Detect (DDCD).</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nCTS</name>
                        <description>nCTS  This bit is the complement of the Clear To Send (nCTS) input.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nDSR</name>
                        <description>This bit is the complement of the Data Set Ready (nDSR) input.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nRI</name>
                        <description>nRI This bit is the complement of the Ring Indicator (nRI) input.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>nDCD</name>
                        <description>nDCD   This bit is the complement of the Data Carrier Detect (nDCD) input.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SCR</name>
                  <description>UART Scratchpad Register    This 8 bit read/write register has no effect on the operation of the Serial Port. It is intended as a scratchpad register to be used by the programmer to hold data temporarily.</description>
                  <addressOffset>0x7</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>ACTIVATE</name>
                  <description>UART Activate Register. [0:0] ACTIVATE When this bit is 1, the UART logical device is powered and functional. When this bit is 0, the UART logical device is powered down and inactive.</description>
                  <addressOffset>0x330</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
               </register>
               <register>
                  <name>CFG_SEL</name>
                  <description>UART Config Select Register</description>
                  <addressOffset>0x3F0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CLK_SRC</name>
                        <description>CLK_SRC  1=The UART Baud Clock is derived from an external clock source, 0=The UART Baud Clock is derived from one of the two internal clock sources</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PWR</name>
                        <description>POWER  1=The RESET reset signal is derived from nSIO_RESET, 0=The RESET reset signal is derived from VCC1_RESET</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>POLAR</name>
                        <description>POLARITY  1=The UART_TX and UART_RX pins functions are inverted, 0=The UART_TX and UART_RX pins functions are not inverted</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
