Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>PAROUT[%s]</name>
               <description>The GPIO Output Registers.</description>
               <addressOffset>0x380</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P0[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x500</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P1[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x520</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P2[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x540</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P3[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P4[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x580</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P5[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x5a0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P6[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x5c0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P7[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x5e0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P10[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x600</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P11[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P12[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x640</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P13[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x660</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P14[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x680</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P15[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x6a0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P16[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x6c0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P17[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x6e0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P20[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x700</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P21[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x720</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P22[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x740</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P23[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x760</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P24[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x780</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P25[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x7a0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>1</dim>
               <dimIncrement>4</dimIncrement>
               <name>CTRL2P26[%s]</name>
               <description>The GPIO PIN_CTRL2 Registers</description>
               <addressOffset>0x7c0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEW_CTRL</name>
                     <description>Selects slew rate on the pin. 1=fast 0=slow</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIV_STREN</name>
                     <description>Selects the drive strength on the pin. 00 = 2mA, 01 = 4mA, 10 = 8mA, 11 = 12mA</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
