Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <version>881.0</version>
         <description>The function of the Watchdog Timer is to provide a mechanism to detect if the internal embedded controller has failed.</description>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x15</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ21</name>
            <value>13</value>
         </interrupt>
         <interrupt>
            <name>WDT</name>
            <value>171</value>
         </interrupt>
         <registers>
            <register>
               <name>LOAD</name>
               <description>Writing this field reloads the Watch Dog Timer counter.</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0xFFFF</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>WDT Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>WDT_EN</name>
                     <description>WDT Block enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_STS</name>
                     <description>WDT_STATUS is set by hardware if the last reset of the device was caused by an underflow of the WDT. This bit must\n      be cleared by the EC firmware writing a '1' to this bit. Writing a '0' to this bit has no effect.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HIB_TMR0_STL</name>
                     <description>This bit enables the WDT Stall function if the Hibernation Timer 0 is active.\n      1=The WDT is stalled while the Hibernation Timer 0 is active\n      0=The WDT is not affected by Hibernation Timer 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WK_TMR_STL</name>
                     <description>This bit enables the WDT Stall function if the Week Timer is active.\n      1=The WDT is stalled while the Week Timer is active\n      0=The WDT is not affected by the Week Timer.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JTAG_STL</name>
                     <description>This bit enables the WDT Stall function if JTAG or SWD debug functions are active\n      1=The WDT is stalled while either JTAG or SWD is active\n      0=The WDT is not affected by the JTAG debug interface.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_RST</name>
                     <description>If the WDT_RESET bit is set and the watch dog timer expires, the Watch dog module will         generate interrupt and clear the WDT_RESET to 0b.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KICK</name>
               <description>The WDT Kick Register is a strobe. Reads of this register return 0. Writes to this register cause the WDT to reload\n     the WDT Load Register value and start decrementing when the WDT_ENABLE bit in the WDT Control Register is set to '1'. When the WDT_ENABLE\n     bit in the WDT Control Register is cleared to '0', writes to the WDT Kick Register have no effect.</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>CNT</name>
               <description>This read-only register provides the current WDT count.</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0xFFFF</resetValue>
            </register>
            <register>
               <name>STS</name>
               <description>This register provides the current WDT count.</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>WDT_EV_IRQ</name>
                     <description>WDT_EVENT_IRQ : This bit indicates the status of interrupt from Watch dog module.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <description>Watch Dog Interrupt Enable Register.\n</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>WDT_INTEN</name>
                     <description>WDT_Int_Enable: This is the interrupt enables bit for WDT_INT interrupt.\n                   1= WDT_INT Interrupt Enable                   0= WDT_INT Interrupt Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
