Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TIMER16_0</name>
         <version>108a1.0</version>
         <description>This 16-bit timer block offers a simple mechanism for firmware to maintain a time base</description>
         <groupName>TIMER16</groupName>
         <prependToName>TIMER16_</prependToName>
         <baseAddress>0x40000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ23</name>
            <value>14</value>
         </interrupt>
         <interrupt>
            <name>TIMER16_0</name>
            <value>136</value>
         </interrupt>
         <registers>
            <register>
               <name>CNT</name>
               <description>This is the value of the Timer counter. This is updated by Hardware but may be set by Firmware.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PRLD</name>
               <description>This is the value of the Timer pre-load for the counter. This is used by H/W when the counter is to be restarted\n    automatically; this will become the new value of the counter upon restart.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>STS</name>
               <description>This is the interrupt status that fires when the timer reaches its limit</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVT_INT</name>
                     <description>This is the interrupt status that fires when the timer reaches its limit. This is the interrupt status that fires when\n        the timer reaches its limit. This may be level or a self clearing signal cycle pulse, based on the AUTO_RESTART bit in the Timer\n        Control Register. If the timer is set to automatically restart, it will provide a pulse, otherwise a level is provided.(R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <description>This is the interrupt enable for the status EVENT_INTERRUPT bit in the Timer Status Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>This is the interrupt enable for the status EVENT_INTERRUPT bit in the Timer Status Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>Timer Control Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>This enables the block for operation. 1=This block will function normally;\n     0=This block will gate its clock and go into its lowest power state</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNT_UP</name>
                     <description>This selects the counter direction. When the counter in incrementing the counter will saturate and trigger the event\n     when it reaches all F's. When the counter is decrementing the counter will saturate when it reaches 0h. 1=The counter will increment;\n     0=The counter will decrement</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AU_RESTRT</name>
                     <description>This will select the action taken upon completing a count.\n     1=The counter will automatically restart the count, using the contents of the Timer Preload Register to load the Timer Count Register.\n     The interrupt will be set in edge mode\n     0=The counter will simply enter a done state and wait for further control inputs. The interrupt will be set in level mode.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT_RST</name>
                     <description>This is a soft reset. This is self clearing 1 cycle after it is written. Firmware does not need\n     to wait before reconfiguring the Basic Timer following soft reset.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT</name>
                     <description>This bit triggers the timer counter. The counter will operate until it hits its terminating condition. This will\n     clear this bit. It should be noted that when operating in restart mode, there is no terminating condition for the counter, so\n     this bit will never clear. Clearing this bit will halt the timer counter.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLD</name>
                     <description>This bit reloads the counter without interrupting it operation. This will not function if the timer has already\n     completed (when the START bit in this register is '0'). This is used to periodically prevent the timer from firing when an\n     event occurs. Usage while the timer is off may result in erroneous behaviour.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HLT</name>
                     <description>This is a halt bit. This will halt the timer as long as it is active. Once the halt is inactive, the timer will\n     start from where it left off. 1=Timer is halted. It stops counting. The clock divider will also be reset. 0=Timer runs normally.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESCALE</name>
                     <description>This is used to divide down the system clock through clock enables to lower the power consumption of the block and allow\n     slow timers. Updating this value during operation may result in erroneous clock enable pulses until the clock divider restarts.\n     The number of clocks per clock enable pulse is (Value + 1); a setting of 0 runs at the full clock speed, while a setting of 1\n     runs at half speed.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
