Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TIMER32_0">
         <name>TIMER32_1</name>
         <baseAddress>0x40000CA0</baseAddress>
         <interrupt>
            <name>TIMER32_1</name>
            <value>141</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>CCT</name>
         <version>121.0</version>
         <description>This is a 16-bit auto-reloading timer/counter.</description>
         <baseAddress>0x40001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x34</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CCT</name>
            <value>146</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP0</name>
            <value>147</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP1</name>
            <value>148</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP2</name>
            <value>149</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP3</name>
            <value>150</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP4</name>
            <value>151</value>
         </interrupt>
         <interrupt>
            <name>CCT_CAP5</name>
            <value>152</value>
         </interrupt>
         <interrupt>
            <name>CCT_CMP0</name>
            <value>153</value>
         </interrupt>
         <interrupt>
            <name>CCT_CMP1</name>
            <value>154</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>This register controls the capture and compare timer.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x03030000</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>This bit is used to start the capture and compare timer running and power it down.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREE_EN</name>
                     <description>Free-Running Timer Enable. This bit is used to start and stop the free running timer.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREE_RST</name>
                     <description>Free Running Timer Reset. This bit stops the timer and resets the internal counter to 0000_0000h.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCLK</name>
                     <description>This 3-bit field sets the clock source for the Free-Running Counter.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CMP_EN0</name>
                     <description>Compare Enable for Compare 0 Register.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_EN1</name>
                     <description>Compare Enable for Compare 1 Register.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_SET1</name>
                     <description>When read, returns the current value off the Compare Timer Output 1 state.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_SET0</name>
                     <description>When read, returns the current value off the Compare Timer Output 0 state.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_CLR1</name>
                     <description>When read, returns the current value off the Compare Timer Output 1 state.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_CLR0</name>
                     <description>When read, returns the current value off the Compare Timer Output 0 state.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP0_CTRL</name>
               <description>This register is used to configure capture and compare timers 0-3.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_EDGE0</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP0</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 0, so that the input signal goes directly into the timer.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL0</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 0.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CAP_EDGE1</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 1.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP1</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 1, so that the input signal goes directly into the timer.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL1</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 1.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CAP_EDGE2</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 2.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP2</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 2, so that the input signal goes directly into the timer.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL2</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 2.</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CAP_EDGE3</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 3.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP3</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 3, so that the input signal goes directly into the timer.</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL3</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 3.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP1_CTRL</name>
               <description>This register is used to configure capture and compare timers 4-5.</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_EDGE4</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 4.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP4</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 4, so that the input signal goes directly into the timer.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL4</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 4.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CAP_EDGE5</name>
                     <description>This field selects the edge type that triggers the capture of the Free Running Counter into Capture Register 5.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FILTER_BYP5</name>
                     <description>This bit enables bypassing the input noise filter for Capture Register 5, so that the input signal goes directly into the timer.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCLK_SEL5</name>
                     <description>This 3-bit field sets the clock source for the input filter for Capture Register 5.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FREE_RUN</name>
               <description>This register contains the current value of the Free Running Timer.</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TMR</name>
                     <description>This register contains the current value of the Free Running Timer.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP0</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT0.</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_0</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP1</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT1.</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_1</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP2</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT0.</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_2</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT2.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP3</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT0.</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_3</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT3.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP4</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT4.</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_4</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT4.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP5</name>
               <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT5.</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP_5</name>
                     <description>This register saves the value copied from the Free Running timer on a programmed edge of ICT5.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP0</name>
               <description>A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer.</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP_0</name>
                     <description>A COMPARE 0 interrupt is generated when this register matches the value in the Free Running Timer.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP1</name>
               <description>A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer.</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP_1</name>
                     <description>A COMPARE 1 interrupt is generated when this register matches the value in the Free Running Timer.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUX_SEL</name>
               <description>This register selects the pin mapping to the capture register.</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00543210</resetValue>
               <fields>
                  <field>
                     <name>CAP0</name>
                     <description>Mux Select for Capture 0 register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAP1</name>
                     <description>Mux Select for Capture 1 register.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAP2</name>
                     <description>Mux Select for Capture 2 register.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAP3</name>
                     <description>Mux Select for Capture 3 register.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAP4</name>
                     <description>Mux Select for Capture 4 register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CAP5</name>
                     <description>Mux Select for Capture 5 register.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
