Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTC</name>
         <version>1261.0</version>
         <description>This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled</description>
         <baseAddress>0x400F5000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTC</name>
            <value>119</value>
         </interrupt>
         <interrupt>
            <name>RTC_ALARM</name>
            <value>120</value>
         </interrupt>
         <registers>
            <register>
               <name>SEC</name>
               <description>Seconds Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>SEC_ALARM</name>
               <description>Seconds Alarm Register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>MIN</name>
               <description>Minutes Register</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>MIN_ALARM</name>
               <description>Minutes Alarm Register</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HR</name>
               <description>Hours Register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>HR_ALARM</name>
               <description>Hours Alarm Register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DAY_OF_WK</name>
               <description>Day of Week Register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>DAY_OF_MON</name>
               <description>Day of Month Register</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>MONTH</name>
               <description>Month Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>YEAR</name>
               <description>Year Register</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>REGA</name>
               <description>Register A</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>REGB</name>
               <description>Register B</description>
               <addressOffset>0xB</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>REGC</name>
               <description>Register C</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>REGD</name>
               <description>Register D</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>RTC Control Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BLK_EN</name>
                     <description>BLOCK_ENABLE This bit must be '1' in order for the block to function internally. Registers may be initialized first, before\n      setting this bit to '1' to start operation.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFT_RST</name>
                     <description>SOFT_RESET A '1' written to this bit position will trigger the RTC_RST reset, resetting the block and all registers except\n      this one and the Test Register. This bit is self-clearing at the end of the reset, one cycle of Host Bus Clock later, and so requires\n      no waiting.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>TEST</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALM_EN</name>
                     <description>ALARM_ENABLE  1=Enables the Alarm features, 0=Disables the Alarm features</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WK_ALARM</name>
               <description>Week Alarm Register[7:0] - ALARM_DAY_OF_WEEK This register, if written to a value in the range 1- -7, will inhibit the Alarm\n     interrupt unless this field matches the contents of the Day of Week Register also.</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x000000FF</resetValue>
            </register>
            <register>
               <name>DAYLT_SAVF</name>
               <description>Daylight Savings Forward Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DST_MON</name>
                     <description>This field matches the Month Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DST_DAY_OF_WK</name>
                     <description>This field matches the Day of Week Register bits[2:0].</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DST_WK</name>
                     <description>5=Last week of month, 4 =Fourth week of month, 3=Third week of month, 2=Second week of month, 1=First week of month</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DST_HR</name>
                     <description>This field holds the matching value for bits[6:0] of the Hours register. The written value will be interpreted according\n      to the 24/12 Hour mode and DM mode settings at the time of writing.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DST_AM_PM</name>
                     <description>This bit selects AM vs. PM, to match bit[7] of the Hours Register if 12-Hour mode is selected in Register B at the time\n      of writing.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAYLT_SAVB</name>
               <description>Daylight Savings Backward Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DST_MON</name>
                     <description>This field matches the Month Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DST_DAY_OF_WK</name>
                     <description>This field matches the Day of Week Register bits[2:0].</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DST_WK</name>
                     <description>5=Last week of month, 4 =Fourth week of month, 3=Third week of month, 2=Second week of month, 1=First week of month</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DST_HR</name>
                     <description>This field holds the matching value for bits[6:0] of the Hours register. The written value will be interpreted according\n      to the 24/12 Hour mode and DM mode settings at the time of writing.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DST_AM_PM</name>
                     <description>This bit selects AM vs. PM, to match bit[7] of the Hours Register if 12-Hour mode is selected in Register B at the time\n      of writing.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
