Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TACH0</name>
         <version>661.0</version>
         <description>This block monitors TACH output signals from various types of fans, and determines their speed.</description>
         <groupName>TACH</groupName>
         <prependToName>TACH_</prependToName>
         <baseAddress>0x40006000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TACH0</name>
            <value>71</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>TACHx Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUTOF_LIM_EN</name>
                     <description>TACH_OUT_OF_LIMIT_ENABLE  This bit is used to enable the TACH_OUT_OF_LIMIT_STATUS bit in the TACHx Status Register to generate an interrupt event.\n                  1=Enable interrupt output from Tach block\n                  0=Disable interrupt output from Tach block (default)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>TACH_ENABLE  1= TACH Monitoring enabled, clocks enabled. 0= TACH Idle, clocks gated</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILT_EN</name>
                     <description>FILTER_ENABLE  This filter is used to remove high frequency glitches from Tach Input. When this filter is enabled, Tach input pulses less than two 100kHz_- Clk periods wide get filtered.\n                  1= Filter enabled\n                  0= Filter disabled (default)\n                  It is recommended that the Tach input filter always be enabled.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD_MOD_SEL</name>
                     <description>TACH_READING_MODE_SELECT\n                  1=Counter is incremented on the rising edge of the 100kHz_Clk input. The counter is latched into the TACHX_COUNTER field and reset when the programmed number of edges is detected.\n                  0=Counter is incremented when Tach Input transitions from low-tohigh state (default)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EDGES</name>
                     <description>TACH_EDGES A Tach signal is a square wave with a 50 percent duty cycle. Typically, two Tach periods represents one revolution of the fan. A Tach period consists of three Tach edges. This programmed value represents the number of Tach edges that will be used to determine the interval for which the number of 100kHz_Clk pulses will be counted\n                  11b=9 Tach edges (4 Tach periods)\n                  10b=5 Tach edges (2 Tach periods)\n                  01b=3 Tach edges (1 Tach period)\n                  00b=2 Tach edges (1/2 Tach period)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CNT_RDY_INT_EN</name>
                     <description>COUNT_READY_INT_EN 1=Enable Count Ready interrupt from Tach block, 0=Disable Count Ready interrupt from Tach block</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IN_INT_EN</name>
                     <description>TACH_INPUT_INT_EN 1=Enable Tach Input toggle interrupt from Tach block, 0=Disable Tach Input toggle interrupt from Tach block</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNTR</name>
                     <description>This 16-bit field contains the latched value of the internal Tach pulse counter, which may be configured by the Tach Reading Mode Select field to operate as a free-running counter or to be gated by the Tach input signal.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STS</name>
               <description>TACHx Status Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUTOF_LIM_STS</name>
                     <description>TACH_OUT_OF_LIMIT_STATUS  1=Tach is outside of limits, 0=Tach is within limits (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIN_STS</name>
                     <description>TACH_PIN_STATUS  1= Tach Input is high, 0= Tach Input is low</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOG_STS</name>
                     <description>TOGGLE_STATUS  1=Tach Input changed state (this bit is set on a low-to-high or high-tolow transition), 0=Tach stable (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNT_RDY_STS</name>
                     <description>COUNT_READY_STATUS  1=Reading ready, 0=Reading not ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM_HI</name>
               <description>TACH HIGH LIMIT Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>T_HIGH</name>
                     <description>This value is compared with the value in the TACHX_COUNTER field. If the value in the counter is greater than the value\n     programmed in this register, the TACH_OUT_OF_LIMIT_STATUS bit will be set. The TACH_OUT_OF_LIMIT_STATUS status event may be enabled\n     to generate an interrupt to the embedded controller via the TACH_OUT_OF_LIMIT_ENABLE bit in the TACHx Control Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIM_LO</name>
               <description>TACHx Low Limit Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T_LOW</name>
                     <description>This value is compared with the value in the TACHX_COUNTER field of the TACHx Control Register. If the value in the counter\n     is less than the value programmed in this register, the TACH_OUT_OF_LIMIT_STATUS bit will be set. The TACH_OUT_OF_LIMIT_STATUS\n     status event may be enabled to generate an interrupt to the embedded controller via the TACH_OUT_OF_LIMIT_ENABLE bit in the TACHx\n     Control Register To disable the TACH_OUT_OF_LIMIT_STATUS low event, program 0000h into this register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
