Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TACH0">
         <name>TACH1</name>
         <baseAddress>0x40006010</baseAddress>
         <interrupt>
            <name>TACH1</name>
            <value>72</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TACH0">
         <name>TACH2</name>
         <baseAddress>0x40006020</baseAddress>
         <interrupt>
            <name>TACH2</name>
            <value>73</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TACH0">
         <name>TACH3</name>
         <baseAddress>0x40006030</baseAddress>
         <interrupt>
            <name>TACH3</name>
            <value>159</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>PWM0</name>
         <version>541.0</version>
         <description>The PWM block generates an arbitrary duty cycle output at frequencies from less than 0.1 Hz to 24 MHz</description>
         <groupName>PWM</groupName>
         <prependToName>PWM_</prependToName>
         <baseAddress>0x40005800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CNT_ON</name>
               <description>This field determines both the frequency and duty cycle of the PWM signal. Setting this field to a value of n will\n    cause the On time of the PWM to be n+1 cycles of the PWM Clock Source.\n    When this field is set to zero and the PWMX_COUNTER_OFF_TIME is not set to zero, the PWM_OUTPUT is held low (Full Off).</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CNT_OFF</name>
               <description>This field determine both the frequency and duty cycle of the PWM signal. Setting this field to a value of n will\n    cause the Off time of the PWM to be n+1 cycles of the PWM Clock Source.\n    When this field is set to zero, the PWM_OUTPUT is held high (Full On).</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
            </register>
            <register>
               <name>CFG</name>
               <description>PWMx CONFIGURATION REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWM_EN</name>
                     <description>When the PWM_ENABLE is set to 0 the internal counters are reset and the internal state machine is set to the OFF state.\n     In addition, the PWM_OUTPUT signal is set to the inactive state as determined by the Invert bit. The PWMx Counter ON Time Register\n     and PWMx Counter OFF Time Register are not affected by the PWM_ENABLE bit and may be read and written while the PWM enable bit is 0.\n     1=Enabled (default); 0=Disabled (gates clocks to save power).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK_SEL</name>
                     <description>This bit determines the clock source used by the PWM duty cycle and frequency control logic.\n                  1=CLOCK_LOW\n                  0=CLOCK_HIGH</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>1= PWM_OUTPUT ON State is active low; 0=PWM_OUTPUT ON State is active high.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK_PRE_DIV</name>
                     <description>The Clock source for the 16-bit down counter (see PWMx Counter ON Time Register and PWMx Counter OFF Time Register)\n     is determined by bit D1 of this register. The Clock source is then divided by the value of Pre-Divider+1 and the resulting\n     signal determines the rate at which the down counter will be decremented. For example, a Pre-Divider value of 1 divides\n     the input clock by 2 and a value of 2 divides the input clock by 3. A Pre-Divider of 0 will disable the Pre-Divider option.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM1</name>
         <baseAddress>0x40005810</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM2</name>
         <baseAddress>0x40005820</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM3</name>
         <baseAddress>0x40005830</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM4</name>
         <baseAddress>0x40005840</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM5</name>
         <baseAddress>0x40005850</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM6</name>
         <baseAddress>0x40005860</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM7</name>
         <baseAddress>0x40005870</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PWM0">
         <name>PWM8</name>
         <baseAddress>0x40005880</baseAddress>
      </peripheral>
      <peripheral>
         <name>PECI</name>
         <version>481.0</version>
         <description>The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices.</description>
         <baseAddress>0x40006400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x48</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ17</name>
            <value>9</value>
         </interrupt>
         <interrupt>
            <name>PECI</name>
            <value>70</value>
         </interrupt>
         <registers>
            <register>
               <name>WDATA</name>
               <description>The Write Data Register provides access to a 32-byte Transmit FIFO.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>RDATA</name>
               <description>The Read Data Register provides access to a 32-byte Receive FIFO.</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>Control Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>PD</name>
                     <description>PD (Power Down) along with RST controls the Power Management Interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>RST indicates that the PECI Core should be reset.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRST</name>
                     <description>FRST is the FIFO Reset bit.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>TXEN is the Transmit Enable bit.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIEN</name>
                     <description>MIEN is the Master Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STS1</name>
               <description>Status Register 1</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>BOF</name>
                     <description>BOF (Beginning of Frame) is asserted when the PECI Core begins Address Timing Negotiation. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOF</name>
                     <description>EOF (End of Frame) is asserted following Message Stop (tSTOP). (R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>ERR Indicates that an error for the current transaction has been detected.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>RDY represents the state of the READY signal function</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDYLO</name>
                     <description>RDYLO is asserted '1' on the falling edge of the READY signal function (R/WC)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDYHI</name>
                     <description>RDYHI is asserted '1' on the rising edge of the READY signal function (R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MINT</name>
                     <description>MINT is the Master Interrupt Status bit and is asserted when any interrupt status bit in the Interrupt Interface is asserted.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STS2</name>
               <description>Status Register 2</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x8A</resetValue>
               <fields>
                  <field>
                     <name>WFF</name>
                     <description>WFF indicates that the Write Data Register FIFO is full. WFF does not generate an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WFE</name>
                     <description>WFE indicates that the Write Data Register FIFO is empty.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFF</name>
                     <description>RFF indicates that the Read Data Register FIFO is full.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFE</name>
                     <description>RFE indicates that the Read Data Register FIFO is empty. RFE does not generate an interrupt.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>The IDLE status bit indicates when the SST/PECI bus is idle and a new transaction may begin.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERROR</name>
               <description>Error Register</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FERR</name>
                     <description>FERR (Frame Check Sequence Error). (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>BERR (Bus Error). Bus contention has been detected. BERR is asserted when the PECI Module reads a value that is different from what it has driven (R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REQERR</name>
                     <description>REQERR is asserted if PEC_AVAILABLE (READY) input is not asserted when the counts down to zero as shown in. When asserted, REQERR can generate interrupt. (R/WC)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WROV</name>
                     <description>WROV (Write Overrun). (R/WC)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUN</name>
                     <description>WRUN (Write Underrun). (R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDOV</name>
                     <description>RDOV (Read Overrun). RDOV indicates that the internal read buffer has overflowed (R/WC)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKERR</name>
                     <description>CLKERR indicates that the READY signal function in the Hardware Interface was de-asserted in the middle of a transaction (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN1</name>
               <description>Interrupt Enable 1 Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>BIEN</name>
                     <description>When the BIEN bit is asserted '1' the BOF interrupt is enabled.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIEN</name>
                     <description>When the EIEN bit is asserted '1' the EOF interrupt is enabled.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EREN</name>
                     <description>When the EREN bit is asserted '1' the ERR interrupt is enabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEN</name>
                     <description>When the RLEN bit is asserted '1' the RDYLO interrupt is enabled.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RHEN</name>
                     <description>When the RHEN bit is asserted '1' the RDYHI interrupt is enabled.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN2</name>
               <description>Interrupt Enable 2 Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENWFE</name>
                     <description>When the ENWFE bit is asserted '1' the WFE interrupt is enabled.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENRFF</name>
                     <description>When the ENRFF bit is asserted '1' the RFF interrupt is enabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTBTLO</name>
               <description>Optimal Bit Time Register (Low Byte)</description>
               <addressOffset>0x20</addressOffset>
               <size>8</size>
               <resetValue>0x16</resetValue>
            </register>
            <register>
               <name>OPTBTHI</name>
               <description>Optimal Bit Time Register (High Byte)</description>
               <addressOffset>0x24</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>BDCTRL</name>
               <description>Baud Control Register.\n     The baud div value divides down the sytem clock frequency to create the peci CORE_CLK frequency.\n</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000006</resetValue>
            </register>
            <register>
               <name>BLKID</name>
               <description>Block ID Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x000000C0</resetValue>
            </register>
            <register>
               <name>BLKREV</name>
               <description>Revision Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
