Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ADC</name>
         <version>1771.0</version>
         <description>This block is designed to convert external analog voltage readings into digital values.</description>
         <baseAddress>0x40007C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x90</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC_SNGL</name>
            <value>78</value>
         </interrupt>
         <interrupt>
            <name>ADC_RPT</name>
            <value>79</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>The ADC Control Register is used to control the behavior of the Analog to Digital Converter.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00010106</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>0: The ADC is disabled and placed in its lowest power state. 1: ADC block is enabled for operation.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_SIN</name>
                     <description>(START_SINGLE) 0: The ADC Single Mode is disabled. 1: The ADC Single Mode is enabled. Note: This bit is self-clearing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_RPT</name>
                     <description>0: The ADC Repeat Mode is disabled. 1: The ADC Repeat Mode is enabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWR_SAV_DIS</name>
                     <description>0: Power saving feature is enabled. 1: Power saving feature is disabled.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT_RST</name>
                     <description>(SOFT_RESET) 1: writing one causes a reset of the ADC block hardware (not the registers) 0: writing zero takes the ADC block out of reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPT_DONE_STS</name>
                     <description>0: ADC repeat-sample conversion is not complete. 1: ADC repeat-sample conversion is completed. (R/WC)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIN_DONE_STS</name>
                     <description>0: ADC single-sample conversion is not complete. 1: ADC single-sample conversion is completed. (R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DELAY</name>
               <description>The ADC Delay register determines the delay from setting Start_Repeat in the ADC Control Register and the start of a conversion cycle. This register also controls the interval between conversion cycles in repeat mode.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRT_DLY</name>
                     <description>This field determines the starting delay before a conversion cycle is begun when Start_Repeat is written with a 1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RPT_DLY</name>
                     <description>This field determines the interval between conversion cycles when Start_Repeat is 1.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHAN_STS</name>
               <description>The ADC Status Register indicates whether the ADC has completed a conversion cycle. All bits are cleared by being written with a 1. \n            0: conversion of the corresponding ADC channel is not complete\n            1: conversion of the corresponding ADC channel is complete</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STS</name>
                     <description>All bits are cleared by being written with a '1'. 1=conversion of the corresponding ADC channel is complete;\n      0=conversion of the corresponding ADC channel is not complete. For enabled single cycles, the SINGLE_DONE_STATUS bit in the\n      ADC Control Register is also set after all enabled channel conversion are done; for enabled repeat cycles, the REPEAT_DONE_STATUS\n      in the ADC Control Register is also set after all enabled channel conversion are done.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNG_EN</name>
               <description>The ADC Single Register is used to control which ADC channel is captured during a Single-Sample conversion cycle initiated by the Start_Single bit in the ADC Control Register. \n            APPLICATION NOTE: Do not change the bits in this register in the middle of a conversion cycle to insure proper operation.\n            0: single cycle conversions for this channel are disabled\n            1: single cycle conversions for this channel are enabled</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>S_EN</name>
                     <description>Each bit in this field enables the corresponding ADC channel when a single cycle of conversions is started when the\n      START_SINGLE bit in the ADC Control Register is written with a 1. 1=single cycle conversions for this channel are enabled\n      0=single cycle conversions for this channel are disabled. Note: If this register is changed while a conversion.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REPT_EN</name>
               <description>The ADC Repeat Register is used to control which ADC channels are captured during a repeat conversion cycle initiated by the Start_Repeat bit in the ADC Control Register.</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>R_EN</name>
                     <description>Each bit in this field enables the corresponding ADC channel for each pass of the Repeated ADC Conversion that is\n      controlled by bit START_REPEAT in the ADC Control Register. 1=repeat conversions for this channel are enabled;\n      0=repeat conversions for this channel are disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>CHAN_RD[%s]</name>
               <description>All 16 ADC channels return their results into a 32-bit reading register. In each case the low 10 bits of the reading register\n     return the result of the Analog to Digital conversion and the upper 22 bits return 0.</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>CFG</name>
               <description>The ADC Configuration Register is used to configure the ADC clock timing.</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000101</resetValue>
               <fields>
                  <field>
                     <name>CLKLW_TIM</name>
                     <description>These bits define the low time count of the ADC clock.\n         0= not used.\n         1= 1 System Clock.\n         2= 2 System Clock.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLKHIGH_TIM</name>
                     <description>These bits define the high time count of the ADC clock.\n         0= not used.\n         1= 1 System Clock.\n         2= 2 System Clock.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLKDUMY_TIM</name>
                     <description>These bits define the dummy cycles of the ADC clock.\n         Valid Values are from 0x0 to 0xF.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PWRUP_DLY</name>
                     <description>These bits define the power up delay in number of micro-seconds.\n         Valid Values are from 0x0 to 0xF.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DUMYCYC_GAP</name>
                     <description>These bits define the number of micro-seconds between consective Starts.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREF_CHAN</name>
               <description>The ADC Channel Register is used to configure the reference voltage to the clock timing.\n</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>These bits define the reference voltage for Channel 0.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL1</name>
                     <description>These bits define the reference voltage for Channel 1.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL2</name>
                     <description>These bits define the reference voltage for Channel 2.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL3</name>
                     <description>These bits define the reference voltage for Channel 3.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL4</name>
                     <description>These bits define the reference voltage for Channel 4.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL5</name>
                     <description>These bits define the reference voltage for Channel 5.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL6</name>
                     <description>These bits define the reference voltage for Channel 6.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL7</name>
                     <description>These bits define the reference voltage for Channel 7.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL8</name>
                     <description>These bits define the reference voltage for Channel 8.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL9</name>
                     <description>These bits define the reference voltage for Channel 9.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL10</name>
                     <description>These bits define the reference voltage for Channel 10.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL11</name>
                     <description>These bits define the reference voltage for Channel 11.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL12</name>
                     <description>These bits define the reference voltage for Channel 12.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL13</name>
                     <description>These bits define the reference voltage for Channel 13.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL14</name>
                     <description>These bits define the reference voltage for Channel 14.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SEL15</name>
                     <description>These bits define the reference voltage for Channel 15.\n         0h= VREF0\n         1h= VREF1\n         2h= Reserved\n         3h= Reserved\n</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREF_CTRL</name>
               <description>This is the VREF Control Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHRG_DLY</name>
                     <description>This field represnts the delay time to charge up the external VREF capacitor.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SWITCH_DLY</name>
                     <description>This field represnts the delay time interval between switching VREF Selects.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>PADCTRL</name>
                     <description>This fields give the choice to the application whether to float the unused PAD's or to Drive them to 0.\n         1= Drive unused PAD's Low 0b\n         0= Leave unused PAD's Floating.\n</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELSTAT</name>
                     <description>This fields gives information about the current VREF selected.\n         0x0= VREF0\n         0x1= VREF1\n         0x2= Reserved\n         0x3= Reserved\n</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAR_CTRL</name>
               <description>This is the SAR ADC Control Register.\n</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <resetValue>0x00000006</resetValue>
               <fields>
                  <field>
                     <name>SEL_DIFF</name>
                     <description>This field select between Single ended / Differential input.\n    0= ADC core is enabled for single ended input operation.\n    1= ADC core is enabled for differential input operation.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEL_RES</name>
                     <description>This field select the ADC Resolution (10/12 bits).\n    0x0= Reserved.\n    0x1= Reserved.\n    0x2= 10 bit ADC resolution.\n    0x3= 12 bit ADC resolution.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SHIFT_DAT</name>
                     <description>This field defined if the ADC output is Right or Left Justified.\n         1= adc_dout is not shifted and lower bits are set to 0.\n         0= adc_dout is shifted right following resolution selected.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_ASYN_SMPL</name>
                     <description>This field enables asynchronous sampling.\n         0= Async Sampling Disabled.\n         1= Async Sampling Enabled.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_SERIAL</name>
                     <description>This field enables serial output (dout) from ADC.\n         0= Parallel dout.\n         1= Serial dout.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WARM_UP_DLY</name>
                     <description>This field represents the warmup delay number in microseconds.\n</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
