Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SAR_CFG</name>
               <description>This is the SAR ADC Configuration Register.\n</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN_CMBF</name>
                     <description>Enable Common Mode Buffer Amplifier.\n    0= Common Mode Buffer Amplifier is high all the time.\n    1= Controls Common Mode Buffer Amplifier during power cycling.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS_DOUT</name>
                     <description>Disable Parallel Output.\n    0= Enable Parallel Output.\n    1= Disable Parallel Output.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_DITHER</name>
                     <description>Enable Dithering.\n    0= Disable Dither.\n    1= Enable Dither.\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAZ_AU_ZERO</name>
                     <description>Enable F_AZ AUTOZEROING.\n    1= Disable f_az autozeroing.\n    0= Enable f_az autozeroing.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAZ_AU_ZERO</name>
                     <description>Enable S_AZ AUTOZEROING.\n    1= Disable S_AZ autozeroing.\n    0= Enable S_AZ autozeroing.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAZ_AU_ZERO</name>
                     <description>Enable L_AZ AUTOZEROING.\n    1= Disable L_AZ autozeroing.\n    0= Enable L_AZ autozeroing.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_RADC</name>
                     <description>Enable RADC.\n    1 = RDAC remains high during power cycling.\n    0 = Controls RDAC during power cycling.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGEN_DLY</name>
                     <description>This register defines the delay between regen and latch.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLK_DIV</name>
                     <description>This register defines the programmable ADC Clock divider value.         Divider ratios of 256,128,64,32,16 are supported.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>IADC_RANGE2</name>
                     <description>This register controls the current consumption for the whole ADC.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IADC_RANGE1</name>
                     <description>This register controls the current consumption for the whole ADC.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF_STG1</name>
                     <description>This register controls the bias current for the 1st stage of the comparator.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF_STG2</name>
                     <description>This register controls the bias current for the 2nd stage of the comparator.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ICMBF</name>
                     <description>This register controls the bias current for common mode buffer amplifier.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EN_EXT_BIAS</name>
                     <description>EN external bias.\n    1 = Disables internal switched cap bias circuit.\n    0 = Enables internal switched cap bias circuit.\n</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PHOT</name>
         <version>511.0</version>
         <description>This block monitors the PROCHOT# signal generated by the host processor. It is designed to detect single assertions and monitor cumulative PROCHOT active time.</description>
         <baseAddress>0x40003400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PHOT</name>
            <value>87</value>
         </interrupt>
         <registers>
            <register>
               <name>CUCNT</name>
               <description>PROCHOT Cumulative Count Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>This register contains the current filtered PROCHOT Active Counter value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DC_CNT</name>
               <description>PROCHOT Duty Cycle Count Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>The contents of the PROCHOT Cumulative Count Register is copied into this register when the PROCHOT Duty Cycle Period Register transitions from 1 to 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DC_PER</name>
               <description>PROCHOT Duty Cycle Period Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>This register defines the number of 100KHz periods required for a duty cycle measurement.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL_STS</name>
               <description>PROCHOT Status/Control Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>This bit enables the PROCHOT Monitor logic.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>When PHOT_ENABLE is 1b, this bit reflects the state of the PROCHOT# Pin input.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASSERT_EN</name>
                     <description>This bit determines whether or not an interrupt will be generated when the PHOT_ASSERT bit is set.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER_EN</name>
                     <description>This bit determines whether or not an interrupt will be generated when the PHOT_PERIOD bit is set.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>Writing this self-clearing bit to one resets all the registers and logic in the PROCHOT Monitor block to its defined initial state.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILT_EN</name>
                     <description>This bit determines whether a digital filter eliminates pulses on the PROCHOT# signal before PROCHOT# is sampled by the Assertion counter or the Active counter.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASSERT</name>
                     <description>This bit is set when the PROCHOT Assertion Counter Register value is greater than or equal to the PROCHOT Assertion Counter Limit Register value. (R/WC)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>This sticky status bit is set to '1b' when the PROCHOT Period Counter transitions from '1b' to '0b.' (R/WC)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASCNT</name>
               <description>PROCHOT Assertion Counter Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>The PROCHOT Assertion Counter is a 16-bit up-counter that is clocked by the 100KHz and is gated and reset by the PROCHOT# input signal. This counter is used to measure a single PROCHOT assertion.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASCLIM</name>
               <description>PROCHOT Assertion Counter Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLIM</name>
                     <description>The PROCHOT Assertion Counter Limit register is compared to the 16-bit PROCHOT Assertion Counter.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
