Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="LED0">
         <name>LED1</name>
         <baseAddress>0x4000B900</baseAddress>
         <interrupt>
            <name>LED1</name>
            <value>84</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="LED0">
         <name>LED2</name>
         <baseAddress>0x4000BA00</baseAddress>
         <interrupt>
            <name>LED2</name>
            <value>85</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>KMS</name>
         <version>331.0</version>
         <description>The Keyboard Scan Interface block provides a register interface to directly scan an external keyboard matrix of size up to 18x8.</description>
         <baseAddress>0x40009C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>KEYSCAN</name>
            <value>135</value>
         </interrupt>
         <registers>
            <register>
               <name>KSO_SEL</name>
               <description>KSO Select and control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>This field selects a KSO line (00000b = KSO[0] etc.) for output according to the value off KSO_INVERT in this register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ALL</name>
                     <description>0=When key scan is enabled, KSO output controlled by the KSO_SELECT field.\n                1=KSO[x] driven high when selected.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KSEN</name>
                     <description>0= Keyboard scan enabled, 1= Keyboard scan disabled. All KSO output buffers disabled.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>0= KSO[x] driven low when selected, 1= KSO[x] driven high when selected.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KSI</name>
               <description>[7:0] This field returns the current state of the KSI pins.</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>KSI_STS</name>
               <description>[7:0] Each bit in this field is set on the falling edge of the corresponding KSI input pin.\n            A KSI interrupt is generated when its corresponding status bit and interrupt enable bit are both set. KSI interrupts are logically ORed together to produce KSC_INT and KSC_INT_WAKE.\n            Writing a '1' to a bit will clear it. Writing a '0' to a bit has no effect.</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>KSI_IEN</name>
               <description>[7:0] Each bit in KSI_INT_EN enables interrupt generation due to highto-low transition on a KSI input. An interrupt is generated when the corresponding bits in KSI_STATUS and KSI_INT_EN are both set.</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>EXT_CTRL</name>
               <description>[0:0] PREDRIVE_ENABLE enables the PREDRIVE mode to actively drive the KSO pins high for approximately 100ns before switching to open-drain operation.\n            0=Disable predrive on KSO pins\n            1=Enable predrive on KSO pins.</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SMB0</name>
         <version>311.0</version>
         <description>The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface.</description>
         <groupName>SMB</groupName>
         <prependToName>SMB_</prependToName>
         <baseAddress>0x40004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x79</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GIRQ13</name>
            <value>5</value>
         </interrupt>
         <interrupt>
            <name>I2CSMB0</name>
            <value>20</value>
         </interrupt>
         <registers>
            <register>
               <name>WCTRL</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STO</name>
                     <description>See STA description</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STA</name>
                     <description>The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENI</name>
                     <description>Enable Interrupt bit (ENI) controls the Interrupt Interface</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESO</name>
                     <description>The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSTS</name>
               <description>Status Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000081</resetValue>
               <fields>
                  <field>
                     <name>NBB</name>
                     <description>The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAB</name>
                     <description>The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AAS</name>
                     <description>The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LRB_AD0</name>
                     <description>The Last Received Bit  or Address 0 (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BER</name>
                     <description>When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STS</name>
                     <description>When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAD</name>
                     <description>SMBus Address Decoded (SAD)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>Pending Interrupt bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OWN_ADDR</name>
               <description>Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR1</name>
                     <description>The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ADDR2</name>
                     <description>The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>I2CDATA</name>
               <description>This register holds the data that are either shifted out to or shifted in from the I2C port.</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <dim>3</dim>
               <dimIncrement>1</dimIncrement>
               <name>RSVD1[%s]</name>
               <description>Reserved</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>MCMD</name>
               <description>SMBus Master Command Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MRUN</name>
                     <description>While this bit is 1, transfer bytes over SMBus. As long as WriteCount is non-zero, a byte from the Master Transmit Buffer is transmitted to the slave device and WriteCount is decremented.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MPROCEED</name>
                     <description>When this bit is 0, the Master State Machine does not transition out of the IDLE or PAUSE states. When this bit is 1, the Master State Machine immediately transitions to the WAIT-BUSBUSY and MRUN-RECEIVE states, respectively.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START0</name>
                     <description>If this bit is 1, send a Start bit on the SMBus before the first byte of the WriteCount is sent to the SMBus transmitter.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTN</name>
                     <description>If this bit is 1, send a Start bit just before the last byte of the WriteCount is sent to the SMBus transmitter.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>If this bit is 1, send a Stop bit after the transaction completes.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEC_TERM</name>
                     <description>If this bit is 1, a copy of the PEC register is transmitted when WriteCount is 0. After the PEC register is read, both the PEC register and this bit are cleared to 0.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READM</name>
                     <description>If this bit is 1, then the ReadCount field is replaced by the byte that is read from the SMBus when ReadCount[7:0] is 1. After ReadCount[7:0] is updated, this bit is cleared to 0.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD_PEC</name>
                     <description>If this bit is 0, reading from the SMBus stops when ReadCount reaches 0. If this bit is 1, reading continues when ReadCount is 0 for one more byte.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR_CNT</name>
                     <description>This field is a count of the number of bytes to transmit to the SMBus from the SMBus Master Transmit Buffer Register It is decremented by 1 for each byte written to the SMBus from the SMBus Master Transmit Buffer Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RD_CNT</name>
                     <description>This field is a count of the number of bytes to read in from the SMBus to the SMBus Master Receive Buffer Register and must be greater than 0 in order for the Master State Machine to initiate a read phase. It is decremented by 1 for each byte read from the SMBus into the SMBus Master Receive Buffer Register. It can be overwritten by the first byte read in from the SMBus.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCMD</name>
               <description>SMBus Slave Command Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRUN</name>
                     <description>Setting this bit to 1 enables the Slave State Machine to operate.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPROCEED</name>
                     <description>When this bit is 0, the Slave State Machine does not transition out of the IDLE, REPEAT_START_WRITE or REPEAT_START_READ states. When this bit is 1, the Slave State Machine immediately transitions to the START_WAIT, RECEIVE and TRANSMIT states, respectively.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEC</name>
                     <description>If Slave_WriteCount is 0 and Slave_PEC is 1 when the Master requests data, the PEC Register is copied to the DATA register. After the PEC Register is copied to the SMBus, the PEC Register is cleared and Slave_PEC is set to 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR_CNT</name>
                     <description>This field is set to the number of bytes software expects to send to the Master.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RD_CNT</name>
                     <description>This field is decremented each time a byte is copied from DATA to the SMBus Slave Receive Buffer Register.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEC</name>
               <description>Packet Error Check (PEC) Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEC</name>
                     <description>The SMBus Packet Error Check (PEC) byte.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSHTM</name>
               <description>Repeated Start Hold Time Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x0000004D</resetValue>
               <fields>
                  <field>
                     <name>RSHTM</name>
                     <description>This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSVD2</name>
               <description>Reserved</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
            </register>
