Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>COMPL</name>
               <description>Completion Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTEN</name>
                     <description>When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCEN</name>
                     <description>When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCEN</name>
                     <description>When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIDEN</name>
                     <description>When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMERR</name>
                     <description>The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTO</name>
                     <description>DTO is the Device Time-out bit. (R/WC)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCTO</name>
                     <description>MCTO is the Master Cumulative Time-out bit. (R/WC)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCTO</name>
                     <description>SCTO is the Slave Cumulative Time-out bit(R/WC)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDL</name>
                     <description>CHDL is the clock high time-out detect bit(R/WC)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDH</name>
                     <description>CHDH is the bus idle time-out detect bit(R/WC)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BER</name>
                     <description>If this bit is 1, the BER bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAB</name>
                     <description>If this bit is 1, the LAB bit in the Status register was set while either the Slave state machine or the Master state machine was not in the Idle state.(R/WC)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SNAKR</name>
                     <description>If this bit is 1, the Slave state machine sent a NACK to the transmitting Master while the Slave was receiving data from the SMBus interface.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STR</name>
                     <description>0: Slave has just finished the receive phase of a transaction. \n                1: Slave has just finished the transmit phase of a transaction.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPROT</name>
                     <description>If this bit is 1, the WriteCount[7:0] counter in the Slave state machine either counted down to 0 before the Master sent a NACK signal, or the Slave received a NACK signal before the counter reached 0.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP_RD</name>
                     <description>If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 1, indicating that the Master requested a Read operation.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP_WR</name>
                     <description>If this bit is 1, the Slave State Machine stopped because it detected a Repeat Start bit, with bit[0] of the byte containing the slave address equal to 0, indicating that the Master requested a Write operation.</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MNAKX</name>
                     <description>If this bit is 1, the Master state machine received a NACK from the receiving Slave while the Master was transmitting data over the SMBus interface. (R/WC)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTR</name>
                     <description>0: Master has just finished the receive phase of a transaction. \n                1: Master has just finished the transmit phase of a transaction.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>This bit is set when the I2C bus becomes idle (on the rising edge of nBB). (R/WC)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDONE</name>
                     <description>If this bit is 1, Master State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect. (R/WC)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDONE</name>
                     <description>If this bit is 1, Slave State machine completed operation and returned to the Idle state. It is cleared when written with a 1. Writes of a 0 have no effect.(R/WC)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDLSC</name>
               <description>Idle Scaling Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x01FC01ED</resetValue>
               <fields>
                  <field>
                     <name>FAIR_BUS_IDL_MIN</name>
                     <description>This field defines the number of ticks of the baud clock required to satisfy the fairness protocol. The default value for this field sets the idle window to 31us, which is the appropriate value for a 100 KHz bus</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>FAIR_IDL_DLY</name>
                     <description>This field defines the number of ticks of the baud clock required to program the delay. The default value for this field sets the delay period to 32us, which is the appropriate value for a 100 KHz bus</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <description>Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PORT_SEL</name>
                     <description>The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TCEN</name>
                     <description>When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLOW_CLK</name>
                     <description>When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Must be always written with 0.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECEN</name>
                     <description>When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEN</name>
                     <description>Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSA</name>
                     <description>0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FAIR</name>
                     <description>If this bit is 1, the MCTP Fairness protocol is in effect.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST0</name>
                     <description>Must be always written with 0.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GC_DIS</name>
                     <description>This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFG_PROMIS</name>
                     <description>This bit define the Mode of SM Bus Controler Mode of operation.         0= Normal Operation.         1=  Promiscuous Mode Enable.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLUSH_SXBUF</name>
                     <description>A write of a 1 to this bit forces the SMBus Slave Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLUSH_SRBUF</name>
                     <description>A write of a 1 to this bit forces the SMBus Slave Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLUSH_MXBUF</name>
                     <description>A write of a 1 to this bit forces the SMBus Master Transmit Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLUSH_MRBUF</name>
                     <description>A write of a 1 to this bit forces the SMBus Master Receive Buffer Register to be marked empty. A write of 0 has no effect. This is a self-clearing bit.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN_AAS</name>
                     <description>0: Disable the AAS, 1: Enable the AAS Interrupt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENIDI</name>
                     <description>If this bit is 1, the Idle interrupt is enabled. If this bit is 0, the Idle interrupt is disabled.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENMI</name>
                     <description>If this bit is 1, the Master Done interrupt is enabled. If this bit is 0, the Master Done interrupt is disabled.</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENSI</name>
                     <description>If this bit is 1, the Slave Done interrupt is enabled. If this bit is 0, the Slave Done interrupt is disabled</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUSCLK</name>
               <description>Bus Clock Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00004F4F</resetValue>
               <fields>
                  <field>
                     <name>LOW_PER</name>
                     <description>This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HIGH_PER</name>
                     <description>This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLKID</name>
               <description>Block ID Register</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x11</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Block ID.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BLKREV</name>
               <description>Revision Register</description>
               <addressOffset>0x34</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>Block Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBCTRL</name>
               <description>Bit-Bang Control Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>BBEN</name>
                     <description>Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLDIR</name>
                     <description>Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DADIR</name>
                     <description>Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBCLK</name>
                     <description>Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1'</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBDAT</name>
                     <description>Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1'</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBCLKI</name>
                     <description>Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBDATI</name>
                     <description>Bit-Bang Data In. The BBDATI bit always returns the state of SDAT</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEST</name>
               <description>Test</description>
               <addressOffset>0x3C</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x05</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>This register must not be written, or undesirable results may occur.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
