Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>DATATM</name>
               <description>Data Timing Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x0C4D5006</resetValue>
               <fields>
                  <field>
                     <name>DATA_HOLD</name>
                     <description>The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RESTART_SETUP</name>
                     <description>The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STOP_SETUP</name>
                     <description>The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FIRST_START_HOLD</name>
                     <description>This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMOUTSC</name>
               <description>Time-Out Scaling Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x4B9CC2C7</resetValue>
               <fields>
                  <field>
                     <name>CLK_HIGH_TIM_OUT</name>
                     <description>Clock High time out period = Clock High Time-Out [7:0] x Baud_Clock_Period x 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SLV_CUM_TIM_OUT</name>
                     <description>Slave Cumulative Time-Out duration = Slave Cum Time-Out [7:0] x Baud_Clock_Period x 1024</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAST_CUM_TIM_OUT</name>
                     <description>Master Cumulative Time-Out duration = Master Cum Time-Out [7:0] x Baud_Clock_Period x 512</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BUS_IDLE_MIN</name>
                     <description>Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_TXB</name>
               <description>SMBus Slave Transmit Buffer Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STXB</name>
                     <description>SLAVE_TRANSMIT_BUFFER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_RXB</name>
               <description>SMBus Slave Receive Buffer Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRXB</name>
                     <description>SLAVE_RECEIVE_BUFFER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MTR_TXB</name>
               <description>SMBus Master Transmit Buffer Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MTXB</name>
                     <description>MASTER_TRANSMIT_BUFFER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MTR_RXB</name>
               <description>SMBus Master Receive Buffer Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MRXB</name>
                     <description>MASTER_RECEIVE_BUFFER</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAKE_STS</name>
               <description>WAKE STATUS Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START_BIT_DET</name>
                     <description>This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAKE_EN</name>
               <description>WAKE ENABLE Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START_DET_INT_EN</name>
                     <description>Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n      1=Start Bit Detection Interrupt enabled; 0=Start Bit Detection Interrupt disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLV_ADDR</name>
               <description>This is the Slave Address Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SADDR</name>
                     <description>This register stores value of address + LSB direction after the 8th clock of the Address Byte.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_STS</name>
               <description>This is the Promiscuous Interrupt Register</description>
               <addressOffset>0x70</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADDR_INTR</name>
                     <description>This is the Promiscuous Address Status interrupt and is set on the 8th clock of the I2C Address.\n         This bit will hold the Clock line low till this register bit is cleared. This is Write 1 to clear.\n         R/W1C.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_IEN</name>
               <description>This is the Promiscuous Interrupt Enable Register</description>
               <addressOffset>0x74</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRM_CTRL</name>
               <description>This is the Promiscuous Control Register</description>
               <addressOffset>0x78</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACK_NAK</name>
                     <description>This is the Promiscuous ACK / NAK response register.\n         1= ACK. \n         0= NAK. \n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
