Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>IEN</name>
               <description>QMSPI Interrupt Enable Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00002000</resetValue>
               <fields>
                  <field>
                     <name>TRANS_COMPL_EN</name>
                     <description>1=Enable an interrupt if TRANSFER_COMPLETE is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_COMPL_EN</name>
                     <description>1=Enable an interrupt if DMA_COMPLETE is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUF_ERR_EN</name>
                     <description>1=Enable an interrupt if TRANSMIT_BUFFER_ERROR is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUF_ERR_EN</name>
                     <description>1=Enable an interrupt if RECEIVE_BUFFER_ERROR is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRGM_ERR_EN</name>
                     <description>1=Enable an interrupt if PROGRAMMING_ERROR is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUF_FULL_EN</name>
                     <description>1=Enable an interrupt if TRANSMIT_BUFFER_FULL is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUF_EMPTY_EN</name>
                     <description>1=Enable an interrupt if TRANSMIT_BUFFER_EMPTY is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_BUF_REQ_EN</name>
                     <description>1=Enable an interrupt if TRANSMIT_BUFFER_REQUEST is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUF_FUL_EN</name>
                     <description>1=Enable an interrupt if RECEIVE_BUFFER_FULL is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUF_EMPTY_EN</name>
                     <description>1=Enable an interrupt if RECEIVE_BUFFER_EMPTY is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUF_REQ_EN</name>
                     <description>1=Enable an interrupt if RECEIVE_BUFFER_REQUEST is asserted\n     0=Disable the interrupt.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUF_CNT_TRIG</name>
               <description>QMSPI Buffer Count Trigger Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_BUF_TRIG</name>
                     <description>An interrupt is triggered if the TRANSMIT_BUFFER_COUNT field is less than or equal to this value. A value of 0 disables the interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUF_TRIG</name>
                     <description>An interrupt is triggered if the RECEIVE_BUFFER_COUNT field is greater than or equal to this value. A value of 0 disables the interrupt.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_FIFO</name>
               <description>QMSPI Transmit Buffer Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_BUF</name>
                     <description>Writes to this register store data to be transmitted from the SPI Master to the external SPI Slave.\n     Writes to this block will be written to the Transmit FIFO. A 1 Byte write fills 1 byte of the FIFO. A Word write fills 2 Bytes and a Doubleword write fills 4 bytes.\n     The data must always be aligned to the bottom most byte (so 1 byte write is on bits [7:0] and Word write is on [15:0]).\n     An overflow condition, TRANSMIT_BUFFER_ERROR, if a write to a full FIFO occurs. Write accesses to this register increment the TRANSMIT_BUFFER_COUNT field.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_FIFO</name>
               <description>QMSPI Receive Buffer Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RX_BUF</name>
                     <description>Buffer that stores data from the external SPI Slave device to the SPI Master (this block), which is received over MISO or IO.\n     Reads from this register will empty the Rx FIFO. A 1 Byte read will have valid data on bits [7:0] and a Word read will have data on bits [15:0].\n     It is possible to request more data than the FIFO has (underflow condition), but this will cause an error (Rx Buffer Error).\n     Read accesses to this register decrement the RECEIVE_BUFFER_COUNT field.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSTM</name>
               <description>QMSPI Chip Select Timing Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x06060406</resetValue>
               <fields>
                  <field>
                     <name>DLY_CS_ON_CLK_STRT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DLY_CLK_STOP_CS_OFF</name>
                     <description>This selects the number of system clock cycles between the last clock edge and the deassertion of CS.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DLY_LAST_DAT_HLD</name>
                     <description>This selects the number of system clock cycles between CS deassertion to the data ports for WP and HOLD \n    switching from input to output. This is only used if the WP/HOLD functions are in use and only on IO2/WP \n           and IO3/HOLD pins.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DLY_OFF_TO_ON</name>
                     <description>This selects the number of system clock cycles between CS deassertion to CS assertion. This is the minimum \n           pulse width of CS deassertion.</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>DESCR[%s]</name>
               <description>QMSPI Description Buffer 0 Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INFACE_MOD</name>
                     <description>This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n     3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TX_TRANS_EN</name>
                     <description>This field bit selects the transmit function of the SPI interface.\n     3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used\n     2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n     1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n     0=Transmit is Disabled. No data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TX_DMA_EN</name>
                     <description>This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either the interface\n     reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n      2=DMA is enabled and set to 2 Bytes\n      3=DMA is enabled and set to 4 Bytes     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RX_TRANS_EN</name>
                     <description>This bit enables the receive function of the SPI interface.\n     1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer; 0=Receive is disabled.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_DMA_EN</name>
                     <description>This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface reaches TRANSFER_LENGTH or the DMA sends a termination request.\n The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n     2=DMA is enabled and set to 2 Bytes\n     3=DMA is enabled and set to 4 Bytes\n     0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLOSE_TRANS_EN</name>
                     <description>This selects what action is taken at the end of a transfer. This bit must be set only on the Last Buffer.\n     1=The transfer is terminated. The Chip Select de-asserts, the SPI interface returns to IDLE and the DMA interface completes the transfer.\n     0=The transfer is not closed. Chip Select remains asserted and the DMA interface and the SPI interface remain active</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRANS_LEN_BITS</name>
                     <description>1=TRANSFER_LENGTH defined in bits\n      0=TRANSFER_LENGTH defined in bytes</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DESCR_BUF_LAST</name>
                     <description>If this bit is 1 then this is the last Description Buffer in the chain. When the transfer described by this buffer completes the TRANSFER_COMPLETE status will be set to 1.\n     If this bit is 0, then this is not the last buffer in use. When the transfer completes the next buffer will be activated, and no additional status will be asserted.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DESCR_BUF_NXT_PTR</name>
                     <description>This defines the next buffer to be used if Description Buffers are enabled and this is not the last buffer. This can point to the current buffer, creating an infinite loop.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TX_LEN</name>
                     <description>The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS. A value of 0 means an infinite length transfer.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
