Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PS2_0</name>
         <version>521.0</version>
         <description>The four PS/2 Ports implementation eliminates the need to bit bang I/O ports to generate PS/2 traffic</description>
         <groupName>PS2</groupName>
         <prependToName>PS2_</prependToName>
         <baseAddress>0x40009000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PS2_0_ACT</name>
            <value>100</value>
         </interrupt>
         <interrupt>
            <name>PS2_0A_WAKE</name>
            <value>129</value>
         </interrupt>
         <interrupt>
            <name>PS2_0B_WAKE</name>
            <value>130</value>
         </interrupt>
         <registers>
            <register>
               <name>TX_DATA</name>
               <description>Writes to bits 7:0 of this register start a transmission of the data in this register to the peripheral</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>RX_DATA</name>
               <description>Data received from a peripheral are recorded in this register in bits 7:0.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000FF</resetValue>
            </register>
            <register>
               <name>CONTROL</name>
               <description>PS2 Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TR</name>
                     <description>PS/2 Transmit/Receive \n                  0=The P2/2 channel is enabled to receive data.\n                  1=The PS2 channel is enabled to transmit data.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>PS/2 Enable. 0=The PS/2 state machine is disabled. 1=The PS/2 state machine is enabled.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARITY</name>
                     <description>00b=Receiver expects Odd Parity (default). \n                  01b=Receiver expects Even Parity.\n                  10b=Receiver ignores level of the parity bit (10th bit is not interpreted as a parity bit).\n                  11b=Reserved</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>00b=Receiver expects an active high stop bit. \n                  01b=Receiver expects an active low stop bit.\n                  10b=Receiver ignores the level of the Stop bit (11th bit is not interpreted as a stop bit). \n                  11b=Reserved.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>PS2 Status Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>RDATA_RDY</name>
                     <description>Receive Data Ready. Reading the Receive Register clears this bit. A low to high transition on this bit generates a PS2 Activity interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REC_TIMEOUT</name>
                     <description>Receive Timeout. The REC_TIMEOUT bit is cleared when the Status Register is read. A low to high transition on this bit generates a PS2 Activity interrupt. (R/WC)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Parity Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Framing Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XMIT_IDLE</name>
                     <description>Transmitter Idle. 0=The channel is actively transmitting PS/2 data. 1=The channel is not transmitting. A low to high transition on this bit generates a PS2 Activity interrupt.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XMIT_TIME_OUT</name>
                     <description>Transmitter Time-out. When the XMIT_TIMEOUT bit is set, the PS2_T/R bit is held clear, the PS/2 channel's CLK line is pulled low for a minimum of 300us until the PS/2 Status register is read.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BUSY</name>
                     <description>Receive Channel Busy.\n                  0=The channel is idle\n                  1=The channel is actively receiving PS/2 data</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XMIT_START_TIMEOUT</name>
                     <description>Transmit Start Timeout.\n                  0=No transmit start timeout detected\n                  1=A start bit was not received within 25 ms following the transmit start event. The transmit start bit time-out condition is also indicated by the XMIT_TIMEOUT bit.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
