Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="PS2_0">
         <name>PS2_1</name>
         <baseAddress>0x40009040</baseAddress>
         <interrupt>
            <name>PS2_1_ACT</name>
            <value>101</value>
         </interrupt>
         <interrupt>
            <name>PS2_1B_WAKE</name>
            <value>132</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TFDP</name>
         <version>681.0</version>
         <description>The TFDP serially transmits EC-originated diagnostic vectors to an external debug trace system.</description>
         <baseAddress>0x40008C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x5</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MSDATA</name>
               <description>Debug data to be shifted out on the TFDP Debug port. While data is being shifted out, the Host Interface will 'hold-off' additional writes to the data register until the transfer is complete.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>CTRL</name>
               <description>Debug Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable. 1=Clock enabled, 0=Clock is disabled (Default)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EDGE_SEL</name>
                     <description>1= Data is shifted out on the falling edge of the debug clock, 0= Data is shifted out on the rising edge of the debug clock (Default)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIVSEL</name>
                     <description>Clock Divider Select.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IP_DLY</name>
                     <description>Inter-packet Delay. The delay is in terms of TFDP Debug output clocks.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PORT_80_DEBUG0</name>
         <version>1161.0</version>
         <description>Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port</description>
         <groupName>PORT_80_DEBUG</groupName>
         <prependToName>PORT_80_DEBUG_</prependToName>
         <baseAddress>0x400F8000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x334</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>P80CAP0</name>
            <value>62</value>
         </interrupt>
         <registers>
            <register>
               <name>HOST_DATA</name>
               <description>Host Data Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>H_DAT</name>
                     <description>This is the host data.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_DATA</name>
               <description>EC Data Register.</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EC_DAT</name>
                     <description>This is the EC data.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TIME_STAMP</name>
                     <description>This is the time stamp.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <description>Configuration Register.</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLUSH</name>
                     <description>When this field is written with a 1, the FIFO is flushed. Writes of a 0 to this field have no effect. Reads always return 0.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_TIME_STAMP</name>
                     <description>When this field is written with a 1, the 24-bit Timer is reset to 0. Writing zero to the Count Register has the same effect.\n      Writes of a 0 to this field have no effect. Reads always return 0.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMEBASE_SEL</name>
                     <description>These bits determine the clock for the 24-bit Timer: 3=48MHz/64; 2=48MHz/32; 1=48MHz/16; 0=48MHz/8.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TMR_EN</name>
                     <description>When the TIMER_ENABLE bit is 1, the 24-bit Timer is actively counting at a rate determined by the TIMEBASE_SELECT bits.\n      When the TIMER ENABLE bit is 0, counting is stopped.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFO_THRES</name>
                     <description>This field determines the threshold for the Port 80 BIOS Debug Port Interrupts:\n      3=14 entry threshold; 2=8 entry threshold; 1=4 entry threshold; 0=1 entry threshold.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STS</name>
               <description>Status Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NOT_EMPTY</name>
                     <description>The NOT EMPTY bit is 1 when there is data in the FIFO. The NOT EMPTY bit is 0 when the FIFO is empty.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERRUN</name>
                     <description>The OVERRUN bit is 1 when the host writes the Host Data Register when the FIFO is full.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>Count Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Writes load data into the 24-bit Timer. Reads return the 24-bit Timer current value.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACTIVATE</name>
               <description>Activate Register</description>
               <addressOffset>0x330</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>When this bit is asserted 1, the block is enabled. When this bit is 0, writes by the Host interface to the Host Data Register\n      are not claimed, the FIFO is flushed, the 24-bit Timer is reset, and the timer clock is stopped. Control bits in the Configuration Register are\n      not affected by the state of ACTIVATE.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
