Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>VBAT_RAM</name>
         <version>931.0</version>
         <description>The VBAT RAM is operational while the main power rail is operational, and will retain its values powered by battery power while the main rail is unpowered.</description>
         <baseAddress>0x4000A800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>MEM[%s]</name>
               <description>32-bits of VBAT powered RAM.</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>VBAT</name>
         <version>941.0</version>
         <description>The VBAT Register Bank block is a block implemented for miscellaneous battery-backed registers</description>
         <baseAddress>0x4000A400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PFRS</name>
               <description>The Power-Fail and Reset Status Register collects and retains the VBAT RST and WDT event status when VCC1 is unpowered.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>SOFT</name>
                     <description>This bit is set to '1b' if a was triggered by an assertion of the SOFT_SYS_RESET bit in the System Reset Register.\n      This bit is cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTI</name>
                     <description>This bit is set to '1b' if a RESET_SYS was triggered by a low signal on the RESETI# input pin. This bit is\n      cleared to '0b' when written with a '1b'; writes of a '0b' have no effect. (R/WC)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_EVT</name>
                     <description>This bit is set to '1b' if a RESET_SYS was triggered by a Watchdog Timer event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYS_RSTREQ</name>
                     <description>This bit is set to '1b' if a RESET_SYS was triggered by an ARM SYSRESETREQ event. This bit is cleared to '0b' when\n      written with a '1b'; writes of a '0b' have no effect. (R/WC)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBAT_RST</name>
                     <description>The VBAT RST bit is set to '1' by hardware when a RESET_VBAT is detected. This is the register default value.\n      To clear VBAT RST EC firmware must write a '1' to this bit; writing a '0' to VBAT RST has no affect.(R/WC)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK32_EN</name>
               <description>CLOCK ENABLE</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>This is a test bit and must not be modified.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT_32K</name>
                     <description>This bit selects the source for the 32KHz clock domain.\n      1=The 32KHZ_IN VTR-powered pin is used as a source for the 32KHz clock domain. If an activity detector does not detect a\n      clock on the selected source, the always-on 32KHz internal clock source is automatically selected\n      0=The always-on32Khz clock source is used as the source for the 32KHz clock domain.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C32KHZ_SRC</name>
                     <description>This field determines the source for the always-on 32KHz internal clock source. If set to '1b', this bit\n      will only take effect if an active clock has been detected on the crystal pins. Once the 32KHz source has been switched,\n      activity detection on the crystal no longer functions. Therefore, if the crystal oscillator uses a single-ended\n      input, once started that input must not stop while this bit is '1b'.\n      1=Crystal Oscillator. The selection between a singled-ended input or a resonant crystal is determined by XOSEL in this register\n      0=Silicon Oscillator.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSEL</name>
                     <description>This bit selects between a single-ended clock source for the crystal oscillator or an external parallel crystal.\n                1= the Crystal Oscillator is driven by a single-ended 32KHz clock source connected to the XTAL2 pin. \n                0= the Crystal Oscillator requires a 32KHz parallel resonant crystal connected between the XTAL1 and XTAL2 pins (default).</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYS_SHDN</name>
               <description>System Shutdown Enable register.\n</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIS</name>
                     <description>This bit controls the System Shutdown.\n         0 = Enable System Shutdown (SYS_SHDN#).\n         1 = Disable System Shutdown (SYS_SHDN#).\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCNT_LO</name>
               <description>MONOTONIC COUNTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNTR</name>
                     <description>Read-only register that increments by 1 every time it is read. It is reset to 0 on a VBAT Power On Reset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCNT_HI</name>
               <description>COUNTER HIWORD</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNTR</name>
                     <description>Thirty-two bit read/write register. If software sets this register to an incrementing value, based on an external\n      non-volatile store, this register may be combined with the Monotonic Counter Register to form a 64-bit monotonic counter.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VWR_BCKP</name>
               <description>VWIRE_BACKUP</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>M2S_2H_BCKUP</name>
                     <description>The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 2h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>M2S_42H_BCKUP</name>
                     <description>The Boot ROM firmware will copy this field into the SRC3 to SRC0 bits of the Master-to-Slave Virtual Wire Register\n      that corresponds to Virtual Wire Index 42h on a RESET_SYS. If software always saves the state of the Index 2h SRC bits on the falling\n      edge of the SUSWARN# virtual wire, the state of the four SRC bits will be synchronized to the state of the four bits in the core logic.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
