Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EC_REG_BANK</name>
         <version>951.0</version>
         <description>This block is designed to be accessed internally by the EC via the register interface.</description>
         <baseAddress>0x4000FC00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x190</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>AHB_ERR_ADDR</name>
               <description>AHB Error Address [0:0] AHB_ERR_ADDR, In priority order:\n     1. AHB address is registered when an AHB error occurs on the processor's AHB master port and the register value was\n     already 0. This way only the first address to generate an exception is captured.\n     2. The processor can clear this register by writing any 32-bit value to this register.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>AHB_ERR_CTRL</name>
               <description>AHB Error Control [0:0] AHB_ERROR_DISABLE, 0: EC memory exceptions are enabled. 1: EC memory exceptions are disabled.</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
            </register>
            <register>
               <name>INTR_CTRL</name>
               <description>Interrupt Control [0:0] NVIC_EN (NVIC_EN) This bit enables Alternate NVIC IRQ's Vectors. The Alternate NVIC Vectors provides each interrupt event with a dedicated (direct) NVIC vector.\n            0 = Alternate NVIC vectors disabled, 1= Alternate NVIC vectors enabled</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
            </register>
            <register>
               <name>ETM_CTRL</name>
               <description>ETM TRACE Enable [0:0] TRACE_EN (TRACE_EN) This bit enables the ARM TRACE debug port (ETM/ITM). The Trace Debug Interface pins are forced to the TRACE functions.            0 = ARM TRACE port disabled, 1= ARM TRACE port enabled</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>DEBUG_CTRL</name>
               <description>Debug Enable Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>DEBUG_EN (JTAG_EN) This bit enables the JTAG/SWD debug port.\n               0= JTAG/SWD port disabled. JTAG/SWD cannot be enabled (i.e., the TRST# pin is ignored and the JTAG signals remain in their non-JTAG state)\n               1= JTAG/SWD port enabled. A high on TRST# enables JTAG or SWD, as determined by SWD_EN.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PIN_CFG</name>
                     <description>This field determines which pins are affected by the TRST# debug enable pin.      3=Reserved      2=The pins associated with the JTAG TCK and TMS switch to the debug interface when TRST# is de-asserted high. The pins      associated with TDI and TDO remain controlled by the associated GPIO. This setting should be used when the ARM Serial      Wire Debug (SWD) is required for debugging and the Serial Wire Viewer is not required      1=The pins associated with the JTAG TCK, TMS and TDO switch to the debug interface when TRST# is de-asserted high. The pin      associated with TDI remains controlled by the associated GPIO. This setting should be used when the ARM Serial Wire Debug      (SWD) and Serial Wire Viewer (SWV) are both required for debugging      0=All four pins associated with JTAG (TCK, TMS, TDI and TDO) switch to the debug interface when TRST# is de-asserted high.      This setting should be used when the JTAG TAP controller is required for debugging.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PIN_CFGSelect</name>
                        <enumeratedValue>
                           <name>JTAG_TCK_TMS</name>
                           <description>2=The pins associated with the JTAG TCK and TMS switch to the debug interface when TRST# is de-asserted high. The pins\n           associated with TDI and TDO remain controlled by the associated GPIO. This setting should be used when the ARM Serial\n          Wire Debug (SWD) is required for debugging and the Serial Wire Viewer is not required </description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTAG_TCK_TMS_TDO</name>
                           <description>1=The pins associated with the JTAG TCK, TMS and TDO switch to the debug interface when TRST# is de-asserted high. The pin\n           associated with TDI remains controlled by the associated GPIO. This setting should be used when the ARM Serial Wire Debug\n             (SWD) and Serial Wire Viewer (SWV) are both required for debugging</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTAG_TCK_TMS_TDO_TDI</name>
                           <description>0=All four pins associated with JTAG (TCK, TMS, TDI and TDO) switch to the debug interface when TRST# is de-asserted high.\n         This setting should be used when the JTAG TAP controller is required for debugging.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PU_EN</name>
                     <description>If this bit is set to '1b' internal pull-up resistors are automatically enabled on the appropriate debugging port\n      wires whenever the debug port is enabled (the DEBUG_EN bit in this register is '1b' and the JTAG_RST# pin is high). The setting\n      of DEBUG_PIN_CFG determines which pins have pull-ups enabled when the debug port is enabled.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSP_EN</name>
                     <description>This bit sets the boundary scan tap controller accessibility from JTAG port.\n         1= Boundary scan tap controller accessibile through JTAG Port.\n         0= Boundary scan tap controller not accessibile through JTAG Port.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTP_LOCK</name>
               <description>Lock Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>Test</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBAT_RAM_LOCK</name>
                     <description>VBAT RAM LOCK bit.\n         0 = Not Locked.\n         1 = Locked.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBAT_REG_LOCK</name>
                     <description>VBAT REG LOCK.\n         0 = Not Locked.\n         1 = Locked.\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT_CNT</name>
               <description>WDT Event Count [3:0] WDT_COUNT (WDT_COUNT) These EC R/W bits are cleared to 0 on VCC1 POR, but not on a WDT.\n            Note: This field is written by Boot ROM firmware to indicate the number of times a WDT fired before loading a good EC code image.</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>AESH_BSWAP_CTRL</name>
               <description>AES HASH Byte Swap Control Register.</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IP_BYTE_SWAP_EN</name>
                     <description>Used to enable byte swap on a DWORD during AHB read from AES / HASH block: 1=Enable; 0=Disable.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OP_BYTE_SWAP_EN</name>
                     <description>Used to enable byte swap on a DWORD during AHB write from AES / HASH block: 1=Enable; 0=Disable.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IP_BLK_SWAP_EN</name>
                     <description>Used to enable word swap on a DWORD during AHB read from AES / HASH block      4=Swap 32-bit doublewords in 128-byte blocks      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,      0x0, 0xC, 0x8, ...      0=Disable.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>IP_BLK_SWAP_ENSelect</name>
                        <enumeratedValue>
                           <name>SWAP_128_BYTE_BLOCK</name>
                           <description>4=Swap 32-bit doublewords in 128-byte blocks </description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_64_BYTE_BLOCK</name>
                           <description>3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n          0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_16_BYTE_BLOCK</name>
                           <description>2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_8_BYTE_BLOCK</name>
                           <description>1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n       0x0, 0xC, 0x8, ...\n</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>0=Disable.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OP_BLK_SWAP_EN</name>
                     <description>Used to enable word swap on a DWORD during AHB write from AES / HASH block      4=Swap 32-bit doublewords in 128-byte blocks      3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,      0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...      2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...      1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,      0x0, 0xC, 0x8, ...      0=Disable.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OP_BLK_SWAP_ENSelect</name>
                        <enumeratedValue>
                           <name>SWAP_128_BYTE_BLOCK</name>
                           <description>4=Swap 32-bit doublewords in 128-byte blocks </description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_64_BYTE_BLOCK</name>
                           <description>3=Swap doublewords in 64-byte blocks. Useful for SHA-256. Bus references issued in the order 0x3C, 0x38, 0x34, 0x30, 0x2C,\n          0x28, 0x24, 0x20, 0x1C, 0x18, 0x14, 0x10, 0xC, 0x8, 0x4, 0x0,...</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_16_BYTE_BLOCK</name>
                           <description>2=Swap doublewords in 16-byte blocks. Useful for AES. Bus references issued in the order 0xC, 0x8, 0x4, 0x0, 0x1C, 0x18,...</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP_8_BYTE_BLOCK</name>
                           <description>1=Swap doublewords in 8-byte blocks. Useful for SHA-512, which works on 64-bit words. Bus references issued in the order 0x4,\n       0x0, 0xC, 0x8, ...\n</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>0=Disable.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PECI_DIS</name>
               <description>PECI Disable</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>P_DIS</name>
                     <description>When this bit is asserted ('1'), it disables the PECI pads to reduce leakage.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAP_TMIR</name>
               <description>This register is a mirror of the Boot Control Register.\n</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QA_MODE</name>
                     <description>This is the mirror of the QA_MODE (bit 0) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the QA mode.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VLD_MODE</name>
                     <description>This is the mirror of the Validation MODE (bit 1) of Boot Control Register.\n         This register bit tells BOOT ROM to enter the Validation mode.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS_STATUS</name>
                     <description>This register bit tells BOOT ROM about the Boundary Scan Status.\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INT_SPI_RECOV</name>
                     <description>This register bit tells BOOT ROM that SPI FLASH Recovery Mode is entered.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VCI_FW_OVR</name>
               <description>This register contains the system shutdown bit programmable by Firmware.\n</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>SYS_SHDN</name>
                     <description>This register contains the active low system shutdown bit programmable by Firmware.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BROM_STS</name>
               <description>This register contains the VTR Reset Status for BOOT ROM.\n</description>
               <addressOffset>0x54</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>VTR_RST_STS</name>
                     <description>This bit contains the RESET_SYS Status for BOOT ROM usage.\n         1= RESET_SYS event occured.\n         0= RESET_SYS event did not occured.\n         This registe is R/W1C (read / write 1 to clear).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_EVT</name>
                     <description>This bit contains the WDT Event Status for BOOT ROM usage.\n         1= WDT event occured.\n         0= WDT event did not occured.\n         This registe is R/W1C (read / write 1 to clear).</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRYPTO_SRST</name>
               <description>System Shutdown Reset</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RNG</name>
                     <description>When this bit is asserted ('1'), the Random Number Generator block is reset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUB_KEY</name>
                     <description>When this bit is asserted ('1'), the Public Key block is reset.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_HASH</name>
                     <description>When this bit is asserted ('1'), the AES and Hash blocks are reset.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIO_BANK_PWR</name>
               <description>GPIO Bank Power Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEST</name>
                     <description>This bit must be programmed to 0h for proper operation of the device.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VTR_LVL2</name>
                     <description>Voltage value on VTR2. This bit is set by Firmware after a VTR Power On Reset.\n         It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted.\n         Write access is determined by bit 7.\n      1=VTR2 is powered by 1.8V\n      0=VTR2 is powered by 3.3V.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VTR_LVL3</name>
                     <description>Voltage value on VTR3. This bit is set by hardware after a VTR Power On Reset, but may be overridden by software.\n      It must be set by software if the VTR power rail is not active when RESET_SYS is de-asserted. Write access is determined by bit 7.\n      1=VTR3 is powered by 1.8V\n      0=VTR3 is powered by 3.3V.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_BANK_PWR_LOCK</name>
                     <description>GPIO Bank Power Lock. 0: VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are R/W\n      1 = VTR_LEVEL bits[2:0] and GPIO Bank Power Lock bit are Read Only.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
