Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>JTAG_MCFG</name>
               <description>JTAG Master Configuration Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_CLK</name>
                     <description>This field determines the JTAG Master clock rate, derived from the 48MHz master clock.      7=375KHz; 6=750KHz; 5=1.5Mhz; 4=3Mhz; 3=6Mhz; 2=12Mhz; 1=24MHz; 0=Reserved.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>JTM_CLKSelect</name>
                        <enumeratedValue>
                           <name>JTM_CLK_375KHz</name>
                           <description>7=375KHz</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_750KHz</name>
                           <description>6=750KHz</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_1MHz</name>
                           <description>5=1.5Mhz</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_3Mhz</name>
                           <description>4=3Mhz</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_6Mhz</name>
                           <description>3=6Mhz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_12Mhz</name>
                           <description>2=12Mhz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JTM_CLK_24MHz</name>
                           <description>1=24MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAS_SLV</name>
                     <description>This bit controls the direction of the JTAG port. 1=The JTAG Port is configured as a Master\n      0=The JTAG Port is configures as a Slave.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG_MSTS</name>
               <description>JTAG Master Status Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_DONE</name>
                     <description>This bit is set to '1b' when the JTAG Master Command Register is written. It becomes '0b' when shifting has completed.\n      Software can poll this bit to determine when a command has completed and it is therefore safe to remove the data in the JTAG Master TDO\n      Register and load new data into the JTAG Master TMS Register and the JTAG Master TDI Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG_MTDO</name>
               <description>JTAG Master TDO Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_TDO</name>
                     <description>When the JTAG Master Command Register is written, from 1 to 32 bits are shifted into this register, starting with bit 0,\n      from the JTAG_TDO pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG_MTDI</name>
               <description>JTAG Master TDI Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_TDI</name>
                     <description>When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TDI pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG_MTMS</name>
               <description>JTAG Master TMS Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_TMS</name>
                     <description>When the JTAG Master Command Register is written, from 1 to 32 bits are shifted out of this register, starting with bit 0,\n      onto the JTAG_TMS pin. Shifting is at the rate determined by the JTM_CLK field in the JTAG Master Configuration Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG_MCMD</name>
               <description>JTAG Master Command Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JTM_COUNT</name>
                     <description>If the JTAG Port is configured as a Master, writing this register starts clocking and shifting on the JTAG port. The JTAG\n      Master port will shift JTM_COUNT+1 times, so writing a '0h' will shift 1 bit, and writing '31h' will shift 32 bits. The signal JTAG_CLK\n      will cycle JTM_COUNT+1 times. The contents of the JTAG Master TMS Register and the JTAG Master TDI Register will be shifted out on\n      the falling edge of JTAG_CLK and the.JTAG Master TDO Register will get shifted in on the rising edge of JTAG_CLK.\n      If the JTAG Port is configured as a Slave, writing this register has no effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACOMP_CTRL</name>
               <description>Comparator Enable</description>
               <addressOffset>0x94</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CMP0EN</name>
                     <description>Comparator 0 Enable         0: Disable Comparator for operation         1: Enable Comparator operation.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONF0LCK</name>
                     <description>Comparator 0 Configuration Locked         0: Configuration Not Locked. Bits[2,0] are Read-Write         1: Configuration Locked. Bits[2,0] are Read-Only                  Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written         this bit becomes a read-only bit.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1EN</name>
                     <description>Comparator 1 Enable         0: Disable Comparator for operation         1: Enable Comparator operation.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACOMP_SLP_CTRL</name>
               <description>Analog Comparator Sleep Control Register</description>
               <addressOffset>0x98</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CMP0SLP_EN</name>
                     <description>Comparator 0 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n         Note: If the CMP_STRAP0 Pin = 1 the Boot ROM writes this bit. Once it is written \n         this bit becomes a read-only bit.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1SLP_EN</name>
                     <description>Comparator 1 Deep Sleep Enable.\n         0 = Comparator Deep Sleep Disable.\n         1 = Comparator Deep Sleep Enable.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FW_SCR0</name>
               <description>BOOT ROM Scratch 0 Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR0</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FW_SCR1</name>
               <description>BOOT ROM Scratch 1 Register</description>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR1</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FW_SCR2</name>
               <description>BOOT ROM Scratch 2 Register</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR2</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FW_SCR3</name>
               <description>BOOT ROM Scratch 3 Register</description>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR3</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
