Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ESPI_SCRATCH</name>
         <version>401.0</version>
         <description>32 Byte ESPI Test Register</description>
         <baseAddress>0x400FBC00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SCRATCH0</name>
               <description>Scratch 0 Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR0</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH1</name>
               <description>Scratch 1 Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR1</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH2</name>
               <description>Scratch 2 Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR2</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH3</name>
               <description>Scratch 3 Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR3</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH4</name>
               <description>Scratch 4 Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR4</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH5</name>
               <description>Scratch 5 Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR5</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH6</name>
               <description>Scratch 6 Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR6</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRATCH7</name>
               <description>Scratch 7 Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR7</name>
                     <description>This field has no functionality other than storage. This register is aliased to  ESPI Config Scratch Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>HDMI_CEC</name>
         <version>1141.0</version>
         <description>The HDMI-CEC provides high-level control functions between all the various audiovisual products in a users environment.</description>
         <baseAddress>0x40006800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CEC</name>
            <value>160</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>HDMI CEC Control Register.     Only bits [3:0] are used. Bits [31:4] are Reserved.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ACT</name>
                     <description>Enable the blocks operation. (R/W)\n                1=The block is enabled for normal operation.\n                0=The block is disabled and placed in its lowest power state.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>Soft reset the entire module. This bit is self-clearing.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTEN</name>
                     <description>1=Filtering on the CEC bus is enabled.\n       0=Filtering is disabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT5</name>
                     <description>When this bit is written to '1', the Signal Free Time (SFT) is changed                    to '5' once only.\n This bit is cleared and normal SFT behavior resumes when the Bus                    Idle condition is asserted.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLOG_ADDR</name>
               <description>HDMI CEC Claimed Logical Address Register.     Only bits [15:0] are used. Bits [31:16] are Reserved.</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>When any bit in this register is asserted ('1'), Follower Directed Messages                  and Follower Broadcast Messages addressed to that logical                  address are claimed by the Follower Interface. The Claimed Logical                  Address Register default effectively disables the Follower Interface.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INITIATOR_DAT</name>
               <description>HDMI CEC Initiator Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved.</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>INI_DAT</name>
                     <description>When any bit in this register is asserted ('1'), Follower Directed Messages                     and Follower Broadcast Messages addressed to that logical                     address are claimed by the Follower Interface. The Claimed Logical                     Address Register default effectively disables the Follower Interface.                     Reads of this field return 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EOM</name>
                     <description>This bit is used for the End of Message bit in header/data blocks in                    CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete.                    Reads of this field return 0.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOLLOW_DAT</name>
               <description>HDMI CEC Follower Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved.</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>FLW_DATA</name>
                     <description>This field is used for the received Information bits from header/data                    blocks in CEC message frames.\n                    Reads of this register when the FFNE bit in the Follower Status Register                    is not asserted ('0') return undefined data.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EOM</name>
                     <description>This bit is the received End of Message bit from header/data blocks                    in CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INITIATOR_STS</name>
               <description>HDMI CEC Initiator Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x21</resetValue>
               <fields>
                  <field>
                     <name>IDLE</name>
                     <description>1=The CEC bus is idle.              0=The CEC bus is busy.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAB</name>
                     <description>Lost Arbitration (LAB).                    1=Bus contention is detected by the Initiator Interface during CEC line arbitration.                    0=No bus contention detected.                    R/WC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDRN</name>
                     <description>Initiator Underrun (UNDRN)        1=The Initiator shift register requires data from the Initiator Interface                        FIFO and the IFE bit is asserted.          0=No underrun detected.          R/WC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACKERR</name>
                     <description>The Acknowledge Error bit is asserted ('1') when the follower NACKs                     an acknowledge bit, both for Follower Directed Messages and Follower                     Broadcast Messages.                     For example, in Follower Directed Messages if the follower acknowledge                     bit response is '1' this bit is '1' in Follower Broadcast Messages                     if a follower acknowledge bit response is '0' the bit is '1'.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CE</name>
                     <description>The Contention Error bit is asserted ('1') when bus contention is                     detected by the Initiator Interface at any point following CEC line                     arbitration. This is likely to be a consequence of CEC Line Error                     Handling (see CEC 7.4, CEC Line Error Handling in References [1]).       R/WC.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IFE</name>
                     <description>The Initiator FIFO Empty bit is asserted ('1') when the Initiator Interface                     retrieves the last data entry from the FIFO.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IFDONE</name>
                     <description>The Initiator Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been transferred by the Initiator                     Interface, or the message frame has been terminated because an                     error occurred as defined by the LAB, UNDRN, ACKERR, and CE bits.        R/WC.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOLLOW_STS</name>
               <description>HDMI CEC Follower Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>OVRN</name>
                     <description>The Follower Overrun bit is asserted ('1') when data from the follower                     shift register is transferred to the Follower Interface FIFO when                     the FFF bit is asserted.                     R/WC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>The Bus Error Detected bit is asserted ('1') when the follower detects                    spurious pulses on the CEC Bus.                     R/WC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTO</name>
                     <description>The Bus Time Out Detected bit is asserted ('1') when the follower                        detects that the CEC Bus is held high too long          R/WC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFNE</name>
                     <description>The Follower FIFO Not Empty bit is asserted ('1') when there is data                         in the Follower Interface FIFO. The bit is not asserted ('0') when                         the Follower Interface FIFO is empty.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFF</name>
                     <description>The Follower FIFO Full bit is asserted ('1') when there is no room in                         the Follower Interface FIFO for more data.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDR</name>
                     <description>The Follower Data Ready bit is asserted ('1') whenever received                        data is written to the Follower Interface FIFO.          R/WC.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFDONE</name>
                     <description>The Follower Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been received by the Follower                     Interface, or the message frame has been terminated because an                     error occurred as defined by the OVRN, BERR, and BTO bits.       R/WC.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INITIATOR_CTRL</name>
               <description>HDMI CEC Initiator Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>IFLUSH</name>
                     <description>When this bit is asserted ('1'), data in the Initiator Interface FIFO is       cleared. When set, the bit is automatically cleared by hardware within one        register access cycle.                     This bit can be used to terminate an Initiator Interface message frame transfer.                     R/WC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>When this bit is asserted ('1'), the Initiator Interface begins a message                    frame transfer if the IFE bit is not asserted. If the Initiator                    Interface FIFO is empty when this bit is asserted, the message                    frame transfer begins as soon as a write to the Initiator Data Register                    occurs. In both cases, the bit is automatically cleared by hardware                    within one register access cycle.                    The START bit only needs to be asserted once per message frame.                    R/WC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IFE_EN</name>
                     <description>Enable bit for the IFE interrupt.                        1=Interrupt is enabled with IFE is asserted                        0=Interrupt is disabled          R/WC.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IFDONE_EN</name>
                     <description>Enable bit for the IFDONE interrupt.                        1=Interrupt is enabled with IFDONE is asserted                        0=Interrupt is disabled          R/WC.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOLLOW_CTRL</name>
               <description>HDMI CEC Follower Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FFLUSH</name>
                     <description>When this bit is asserted ('1'), data in the Follower Interface FIFO is                     cleared. When set, the bit is automatically cleared by hardware                     within one register access cycle.                      R/WC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFF_EN</name>
                     <description>Enable bit for the FFF interrupt.                    1=Interrupt is enabled with FFF is asserted                    0=Interrupt is disabled                    R/WC.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDR_EN</name>
                     <description>Enable bit for the FDR interrupt.                        1=Interrupt is enabled with FDR is asserted                        0=Interrupt is disabled          R/WC.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFDONE_EN</name>
                     <description>Enable bit for the FFDONE interrupt.                        1=Interrupt is enabled with FFDONE is asserted                        0=Interrupt is disabled          R/WC.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
