Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>CLK_DIV</name>
               <description>HDMI CEC Clock Divier Register.\n    Reset value of this reister is 0x01E0.\n</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x000001E0</resetValue>
               <fields>
                  <field>
                     <name>CLK_DIV</name>
                     <description>HDMI CEC Clock Divier Register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SAFBC</name>
         <version>1431.0</version>
         <description>SAF BRIDGE COMPONENT</description>
         <baseAddress>0x40008000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1B4</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SAF_DONE</name>
            <value>166</value>
         </interrupt>
         <interrupt>
            <name>SAF_ERR</name>
            <value>167</value>
         </interrupt>
         <registers>
            <register>
               <name>ECP_CMD</name>
               <description>This register defines the command type and length of transfers requested by EC firmware</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EC_PUT_CMD</name>
                     <description>This field must contain the value 0Ah; that is, the eSPI command                       PUT_FLASH_NP.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EC_CTYPE_CMD</name>
                     <description>This field encodes the operation requested:                       00h = Read                       01h = Write (Page Program)                       02h = Erase                       Other encodings are undefined</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EC_LEN</name>
                     <description>This field contains the Length field for all requests.                       Read or Write: The length in bytes of the data transfer, to or from                       the SRAM buffer. Must be in the range 1 -- 64 (01h -- 40h).                       Erase: Must encode an eSPI-defined Erase Block Size:                       00h = 4K                       01h = 32K                       02h = 64K                       Other encodings are undefined.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECP_FLASH_ADDR</name>
               <description>This register hold the Flash Space address to be accessed by the current command from EC firmware.</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>FLASH_ADDR: This field holds the Flash address to be accessed.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECP_START</name>
               <description>This register contains the Start control for a Flash access requested in the rest of the EC    Portal registers. It triggers the requested transfer.</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>This bit is written with '1' to start a new request, but always appears                   '0' when being read. Writing '1' to this bit immediately sets the                   EC_BUSY bit to '1' as an acknowledgement that the request is being serviced.                   Writing '1' to the START bit again, while the EC_BUSY bit is                   already '1' will do nothing except to set the START_OVERFLOW                   error status bit to '1' and the request already in service will complete                   normally except for the START_OVERFLOW=1 status indication.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECP_BUF_ADDR</name>
               <description>This register holds a location in the EC's own address space that is to be used as     the SRAM buffer for an EC Flash access.</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADR</name>
                     <description>This field holds bits [31:2] of the SRAM buffer address.                   Bits[1:0] of the address are fixed at 00.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECP_STS</name>
               <description>This register holds the DONE status bit, which indicates when a request is completed     by rising to '1'. It may be used as an interrupt trigger for INTR_FLASH. It may be cleared     at any time after it rises, but must be cleared before issuing the next request.</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>This bit is set to '1' by hardware to indicate the end of a requested access by the EC.        It can be enabled to trigger an interrupt when '1'. Writing a '1' clears this bit and the interrupt source.        This is R/WC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE_TST</name>
                     <description>This bit is set to '1' by hardware during a requested access by the EC. It has no usage        except for possible diagnostic purposes, but should be cleared (with the rest of this register)         by writing '1' before starting any new access.        This is R/WC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>This bit indicates that an Erase or Write request from the EC has failed because the Flash        has timed out. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_OF_RANGE</name>
                     <description>This bit indicates that a request from the EC has been rejected because it is beyond the        physical limits of the attached Flash devices, as declared in the Size Limit and Threshold        Registers. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCESS_VIOLAT</name>
                     <description>This bit indicates that a request from the EC has been rejected because it violates the        Protection Register settings. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOUND_4K</name>
                     <description>This bit indicates that a Read request from the EC has been rejected because it has attempted         to cross a 4K Flash address boundary. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERASE_SIZE</name>
                     <description>This bit indicates that an invalid Erase Block Size has been specified in an Erase request        from the EC. This error is detected by seeing 00h in the specific Erase Size opcode field. This         bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT_OVRFLW</name>
                     <description>This bit indicates that an access was already in progress when a new access was        requested by writing '1' to the START bit. Such a request is ignored except to set this bit.        This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD_REQ</name>
                     <description>This bit indicates that an invalid Request code has been specified in the Portal        Command Register at the time the START bit was set to trigger it.        This bit is cleared by writing '1' to its position.         This is R/WC.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECP_IEN</name>
               <description>This register contains the one bit DONE_EN in bit position[0]. This bit enables the DONE bit in     the status register to trigger an interrupt.</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE_EN</name>
                     <description>This bit enables interrupts from the DONE bit in the Status register.         1 = Enabled         0 = Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_SIZE_LIM</name>
               <description>This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices.</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LIMIT</name>
                     <description>This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_THR</name>
               <description>This register declares whether there are two Flash devices, and if so, where the boundary is     between the devices.</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THRES</name>
                     <description>The address placed in this register is the address of the first byte of the second Flash         device. If there is only one Flash device, then this register must contain a value greater than         the Size Limit register above.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_MISC_CFG</name>
               <description>Bits[7:6] (PREFIX) declare the need for some Flash devices (notably Micron) to be given an     explicit command to enter Continuous Mode, as opposed to requiring only Mode bits in the first     Read access.</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PREFETCH_OPT_EN</name>
                     <description>Selects optimized data prefetching from the Flash devices to the eSPI Master. This field has no        effect unless the PREFETCH_EN bit is also '1'         00= Prefetched data from Flash is delivered using canonical eSPI methods. (Default)        11= Prefetched data from Flash is delivered using expedited eSPI methods.        01,10= (Reserved)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CS0_4BYTE_ADDR_MODE</name>
                     <description>Declares whether the Flash device on CS0# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS0# Flash device.         1=Issue 4-byte addresses to the CS0# Flash device.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS1_4BYTE_ADDR_MODE</name>
                     <description>Declares whether the Flash device on CS1# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS1# Flash device.         1=Issue 4-byte addresses to the CS1# Flash device.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS0_CONT_PREFIX_EN</name>
                     <description>Declares whether the Flash device on CS0# requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS0#.         1=A Prefix command will be issued from the CS0 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS0# before entry into Continuous Mode.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS1_CONT_PREFIX_EN</name>
                     <description>Declares whether the Flash device on CS1# (if any) requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS1#.         1=A Prefix command will be issued from the CS1 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS1# before entry into Continuous Mode.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_MODE_EN</name>
                     <description>0=SAFS Mode operation is globally disabled.               1=SAFS Mode operation is globally enabled. The Captive QMSPI Block register set and       the SAF Communication register set also become inaccessible to EC firmware.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_MODE_LOCK</name>
                     <description>0=The SAF Bridge register sets are unlocked and available R/W to EC firmware.               1=The SAF Bridge register sets Device Configuration and Device Timing, including this                register, are locked read-only to EC firmware.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESPI_ERRINTR_STAT</name>
               <description>These bits may be individually enabled to trigger interrupts using the corresponding        Interrupt Enable register.</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT</name>
                     <description>This bit indicates that an Erase or Write request from the Host Chipset has failed               because the Flash has timed out. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_OF_RANGE</name>
                     <description>This bit indicates that a request from the Host Chipset has been rejected because        it is beyond the physical limits of the attached Flash devices. This bit is cleared by        writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCESS_VIOLAT</name>
                     <description>This bit indicates that a request from the Host Chipset has been rejected because        it violates the Protection Register settings. This bit is cleared by writing '1' to its        position.        This is R/WC.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOUND_4K</name>
                     <description>This bit indicates that a Read request from the Host Chipset has been rejected        because it has attempted to cross a 4K Flash address boundary. This bit is cleared by        writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERASE_SIZE</name>
                     <description>This bit indicates that an invalid Erase Block Size has been specified in        an Erase request from the Host Chipset. This bit is cleared by writing '1' to its position.        This is R/WC.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESPI_MON_STS</name>
               <description>These bits individually enable the bits in SAF eSPI Monitor Status Register  to trigger    interrupts to the EC firmware.</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT_EN</name>
                     <description>This bit enables the TIMEOUT status bit as an interrupt.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT_OF_RANGE_EN</name>
                     <description>This bit enables the OUT_OF_RANGE status bit as an interrupt.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACCESS_VIOLAT_EN</name>
                     <description>This bit enables the ACCESS_VIOLATION status bit as an interrupt.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOUND_4K_EN</name>
                     <description>This bit enables the 4K_BOUNDARY status bit as an interrupt.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERASE_SIZE_EN</name>
                     <description>This bit enables the ERASE_SIZE status bit as an interrupt.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_BUSY</name>
               <description>This register holds the EC_BUSY status bit, which indicates when the EC Portal    is busy performing an access.</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EC_BUSY</name>
                     <description>This Read-Only bit is set to '1' by hardware when the START bit is written with        '1' to start a new request. It is cleared to '0' when request completes, and its        falling edge sets the DONE bit. While this bit is '1', the EC Portal Command, Flash        Address and Buffer Address registers are locked Read-Only, and the START bit is disabled,        causing it only to set the START_OVERFLOW error status bit to '1'.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
