Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>CS0_OPA</name>
               <description>There are two Opcode A registers, one associated with each of the Flashes. If the CS1     Flash does not exist, its register can be left in its default state. The four fields in each     register represent the 8-bit Flash opcodes for Write Enable, Suspend, Resume and Read Status     Register. The Status Register referred to is the register inside the Flash which contains the     (BUSY) or (IN PROGRESS) status bit in position 0.</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_WE</name>
                     <description>This field contains the 8-bit Opcode for Write Enable in the respective Flash device.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_SUS</name>
                     <description>This field contains the 8-bit Opcode for Suspend in the respective Flash device.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_RSM</name>
                     <description>This field contains the 8-bit Opcode for Resume in the respective Flash device.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_POLL1</name>
                     <description>This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS0_OPB</name>
               <description>There are two Opcode B registers, one associated with each of the Flashes. If the CS1 Flash    does not exist, its register can be left in its default state. The OP_PROGRAM field is mandatory,    and must hold the Page Program opcode for the respective Flash. The Erase size of 4K is mandatory,    and so the OP_ERASE0 field must be initialized to the appropriate opcode for the Flash device.    There is only one bit declaring each Erase size up to the Host System (instead of one per Flash device,    see eSPI Configuration Register 44h), so if there are two Flash devices, each    Erase size over 4K must be declared here only if BOTH Flash devices support it.</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_ERASE0</name>
                     <description>This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_ERASE1</name>
                     <description>This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_ERASE2</name>
                     <description>This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_PRG</name>
                     <description>This field contains the 8-bit Opcode for Page Program in the respective Flash device.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS0_OPC</name>
               <description>There are two Opcode C registers, one associated with each of the Flashes. If the CS1 Flash     does not exist, its register can be left in its default state. Two fields (OP) define opcodes,     and two fields (MODE) represent the Mode code values. Mode codes are provided immediately after     the Address in Continuous Read traffic, and are used to keep the Flash device in Continuous     Read Mode. Depending on the Flash device manufacturer, this mode may be documented in their     datasheet as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy     clock. The recommended Mode values given below are selected to be appropriate for any Flash device.</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_READ</name>
                     <description>This field must contain the 8-bit Opcode for Fast Read Quad or Fast Read Dual in the         respective Flash device. This code is used in entering Continuous Read mode, and does not         appear afterward.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MODE_NONC</name>
                     <description>This field is currently a placeholder and is not used. The recommended value for this         field, for future compatibility, is FFh.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MODE_CONT</name>
                     <description>This field contains the 8-bit Mode code used to place (or keep) the Flash device in         Continuous Read mode. It is strongly recommended that this value be set to A5h, as a         universally-acceptable value among Flash devices.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_POLL2</name>
                     <description>This field contains the 8-bit Opcode used to confirm Suspended status in the Flash device.         It is issued using a designated Timing Descriptor chain Poll which is used to read a 16-bit         value. This value is evaluated using the Mask values in the Poll2 Mask register</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS0_PFD</name>
               <description>There are two Per-Flash Descriptors registers, one associated with each of the Flash devices.     If the CS1 Flash does not exist, its register can be left in its default state. Each 4-bit field     is a pointer which identifies a Timing Descriptor location in the Captive QMSPI block's Timing     Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENTER_CONT</name>
                     <description>This field points to the first Descriptor element of the Enter Continuous Mode chain.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>READ_CONT</name>
                     <description>This field points to the first Descriptor element of the Continuous Read chain.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE_CONT</name>
                     <description>This field points to the Descriptor element within the READ_CONT chain that contains         the Length field for data.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS1_OPA</name>
               <description>This is the CS1 Opcode A register. \n   If the CS1 Flash does not exist, its register can be left in its default state. The four fields in each register represent the 8-bit Flash\n   opcodes for Write Enable, Suspend, Resume and Read Status Register. The Status Register referred to is the register inside the Flash which\n          contains the BUSY or IN PROGRESS status bit in position 0.</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_WE</name>
                     <description>This field contains the 8-bit Opcode for Write Enable in the respective Flash device.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_SUS</name>
                     <description>This field contains the 8-bit Opcode for Suspend in the respective Flash device.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_RSM</name>
                     <description>This field contains the 8-bit Opcode for Resume in the respective Flash device.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_POLL1</name>
                     <description>This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS1_OPB</name>
               <description>This is the CS1 Flash Opcode B register. If the CS1 Flash does not exist, its register can be     left in its default state. The OP_PROGRAM field is mandatory, and must hold the Page Program     opcode for the respective Flash. The Erase size of 4K is mandatory, and so the OP_ERASE0 field     must be initialized to the appropriate opcode for the Flash device. There is only one bit     declaring each Erase size up to the Host System (instead of one per Flash device, see eSPI     Configuration Register 44h), so if there are two Flash devices, each Erase size over 4K must     be declared here only if BOTH Flash devices support it.</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_ERASE0</name>
                     <description>This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_ERASE1</name>
                     <description>This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_ERASE2</name>
                     <description>This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_PROGRAM</name>
                     <description>This field contains the 8-bit Opcode for Page Program in the respective Flash device.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS1_OPC</name>
               <description>This is the CS1 Flash device Opcode C register. If the CS1 Flash does not exist, its     register can be left in its default state. Two fields (OP) define opcodes, and two fields     (MODE) represent the Mode code values. Mode codes are provided immediately after the Address     in Continuous Read traffic, and are used to keep the Flash device in Continuous Read Mode.     Depending on the Flash device manufacturer, this mode may be documented in their datasheet     as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy clock.     The recommended Mode values given below are selected to be appropriate for any Flash device.</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OP_READ</name>
                     <description>This field must contain the 8-bit Opcode for Fast Read Quad or Fast Read Dual in the         respective Flash device. This code is used in entering Continuous Read mode, and does not         appear afterward.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MODE_NONC</name>
                     <description>This field is currently a placeholder and is not used. The recommended value for this         field, for future compatibility, is FFh.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MODE_CONT</name>
                     <description>This field contains the 8-bit Mode code used to place (or keep) the Flash device in         Continuous Read mode. It is strongly recommended that this value be set to A5h, as a         universally-acceptable value among Flash devices.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>OP_POLL2</name>
                     <description>This field contains the 8-bit Opcode used to confirm Suspended status in the Flash device.         It is issued using a designated Timing Descriptor chain Poll which is used to read a 16-bit         value. This value is evaluated using the Mask values in the Poll2 Mask register</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS1_PFD</name>
               <description>This is the Per-Flash Descriptors register for CS1 Flash . If the CS1 Flash does not exist,     its register can be left in its default state. Each 4-bit field is a pointer which identifies a     Timing Descriptor location in the Captive QMSPI block's Timing Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENTER_CONT</name>
                     <description>This field points to the first Descriptor element of the Enter Continuous Mode chain.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>READ_CONT</name>
                     <description>This field points to the first Descriptor element of the Continuous Read chain.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE_CONT</name>
                     <description>This field points to the Descriptor element within the READ_CONT chain that contains         the Length field for data.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GEND</name>
               <description>This is a single register, which accompanies the two Per-Flash Descriptors registers, and     provides Descriptor pointers that are shared by both CS0 and CS1 devices uniformly.     Each 4-bit field is a pointer which identifies a Timing Descriptor location in the Captive     QMSPI block's memory. The EXIT_CONT field (Exit Continuous Mode) points to the single chain     invoked to exit the Flash from Continuous Mode, allowing an Erase or Program command to be     entered. This chain is identical for either Flash device, regardless of its manufacturer, and     simply directs a universal Exit symbol to the appropriate CS0/CS1 device. The POLL1 and POLL2     fields should both point to the same chain. This chain will issue the appropriate opcode for the     operation (Poll1 or Poll2) supplied by the SAF Bridge from the Opcode registers, and will read     back 16 bits of information for use by the SAF Bridge.</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXIT_CONT</name>
                     <description>This field points to the first Descriptor element of the Exit Continuous Mode chain.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>POLL1</name>
                     <description>This field points to the first Descriptor element of the Poll chain, used when         polling for Busy status.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>POLL2</name>
                     <description>This field points to the first Descriptor element of the Poll chain, used when         polling for Suspended status.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
