Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>PRLOCK</name>
               <description>There is a bit in this register for each of the 17 Protection Region Register sets. Writing     '1' to a bit locks the associated 4-Register set to Read-Only access, and also locks this bit     itself to a Read-Only '1'.</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SAF_0</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 0: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_1</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 1: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_2</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 2: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_3</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 3: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_4</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 4: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_5</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 5: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_6</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 6: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_7</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 7: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_8</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 8: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_9</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 9: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_10</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 10: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_11</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 11: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_12</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 12: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_13</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 13: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_14</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 14: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_15</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 15: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_16</name>
                     <description>In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 16: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRDIRTY</name>
               <description>There is a bit in this register for each of the 12 Flash Regions that can be allocated from     the Region Table in the Intel Descriptor structure. Register sets 12 through 16 do not represent     allocated Flash regions, and so they do not have bits in this register.</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SAF_0</name>
                     <description>Indicates whether contents of Region 0 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_1</name>
                     <description>Indicates whether contents of Region 1 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_2</name>
                     <description>Indicates whether contents of Region 2 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_3</name>
                     <description>Indicates whether contents of Region 3 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_4</name>
                     <description>Indicates whether contents of Region 4 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_5</name>
                     <description>Indicates whether contents of Region 5 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_6</name>
                     <description>Indicates whether contents of Region 6 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_7</name>
                     <description>Indicates whether contents of Region 7 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_8</name>
                     <description>Indicates whether contents of Region 8 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_9</name>
                     <description>Indicates whether contents of Region 9 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_10</name>
                     <description>Indicates whether contents of Region 10 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAF_11</name>
                     <description>Indicates whether contents of Region 11 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAG_MAP0</name>
               <description>The default values in this register match hard-wired assignments made in the Chipset for eSPI     Tag values 0h through 7h. A default value of 7 indicates a non-existent map entry, for a Tag value     which should never happen.</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x23221100</resetValue>
               <fields>
                  <field>
                     <name>STM_0</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 0h to its 3-bit Protection Master         number.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_1</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 1h to its 3-bit Protection Master         number.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_2</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 2h to its 3-bit Protection Master         number.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_3</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 3h to its 3-bit Protection Master         number.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_4</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 4h to its 3-bit Protection Master         number.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_5</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 5h to its 3-bit Protection Master         number.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_6</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 6h to its 3-bit Protection Master         number.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_7</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 7h to its 3-bit Protection Master         number.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAG_MAP1</name>
               <description>The default values in this register match hard-wired assignments made in the Chipset for eSPI Tag     values 8h through Fh. A default value of 7 indicates a non-existent map entry, for a Tag value which     should never happen.</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x77677767</resetValue>
               <fields>
                  <field>
                     <name>STM_8</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 8h to its 3-bit Protection Master         number.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_9</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value 9h to its 3-bit Protection Master         number.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_A</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Ah to its 3-bit Protection Master         number.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_B</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Bh to its 3-bit Protection Master         number.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_C</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Ch to its 3-bit Protection Master         number.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_D</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Dh to its 3-bit Protection Master         number.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_E</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Eh to its 3-bit Protection Master         number.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_F</name>
                     <description>This bit contains the mapping of the 4-bit eSPI Tag value Fh to its 3-bit Protection Master         number.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAG_MAP2</name>
               <description>The default value in bits [2:0] of this register matches the hard-wired assignment made in the     Chipset for accesses made by an EC. After ensuring that all three Tag Map Registers [2:0] contain     valid mappings, the STM_LK bit should be set to '1' to lock them, preventing firmware from     re-assigning them later.</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>SM_EC</name>
                     <description>This bit maps the 3-bit Protection Master number assigned to EC Firmware accesses.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>STM_LK</name>
                     <description>1 Locks all bits in the Tag Map Registers, including this bit.              0 (Default) keeps all Tag Map Register fields R/W.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
