Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <cluster>
               <dim>17</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>SAF_PROT[%s]</name>
               <description/>
               <addressOffset>0x84</addressOffset>
               <register>
                  <name>START</name>
                  <description>This is Start00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <resetValue>0x00007FFF</resetValue>
                  <fields>
                     <field>
                        <name>SAF_PROT</name>
                        <description>This field contains the start address of this Region, in units of 4K bytes.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>20</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LIMIT</name>
                  <description>This is Limit00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SAF_PROT</name>
                        <description>This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>20</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WRITE</name>
                  <description>This is Write00 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively.</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000001</resetValue>
                  <fields>
                     <field>
                        <name>SAF_PROT_WR0</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR1</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR2</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR3</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR4</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR5</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR6</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_WR7</name>
                        <description>This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>READ</name>
                  <description>This is Read00 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively.</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000001</resetValue>
                  <fields>
                     <field>
                        <name>SAF_PROT_RD0</name>
                        <description>This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD1</name>
                        <description>This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD2</name>
                        <description>This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD3</name>
                        <description>This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD4</name>
                        <description>This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD5</name>
                        <description>This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD6</name>
                        <description>This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SAF_PROT_RD7</name>
                        <description>This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>POLL_TMOUT</name>
               <description>This is an error timeout value imposed on any consecutive series of Poll-1 commands to a     Flash. The timeout counter starts whenever any new Poll-1 sequence starts, and stops when a     Poll-1 detects Not-BUSY status from the Flash.</description>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TOUT</name>
                     <description>This field provides a polling timeout value in units of the 32KHz clock. Recommended         value is 5 seconds, expressed as 28000h (163,840 decimal) in this field.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLL_INTRVL</name>
               <description>This register should be kept zero except for diagnostic purposes. Where needed, it can be set     to provide spacing between consecutive Poll-1 operations to limit the amount of traffic.</description>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTRVL</name>
                     <description>This field provides an interval in units of the EC internal clock MCLK.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP_RES_INTRVL</name>
               <description>The value placed in this register provides necessary programmable support to a Flash that is     performing an Erase or a Program operation.  When an Erase or Program is started or Resumed, a     Suspend is held off until this time expires.  While an Erase or Program is in process but     Suspended, a Resume is forced when this time expires, even if Read requests are still pending,     causing the Erase or Program operation to continue, and again inhibiting the next Suspend until     it expires again.</description>
               <addressOffset>0x19C</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INTRVL</name>
                     <description>This field provides an interval value in units of the 32KHz RTC clock. Its value should         be taken from the Flash datasheet parameter that specifies minimum time for an Erase or         Program step to make progress.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONSEC_RD_TMOUT</name>
               <description>This register is used to detect when a series of Read transfers has finished. When this time     expires without any new Read request, any suspended Erase or Program operation is given the     Resume command to continue.</description>
               <addressOffset>0x1A0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RD_TOUT</name>
                     <description>This field provides a timeout value in units of the EC internal clock MCLK. This value is         tunable for system performance, but a value at or below 20us is suggested.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_POLL2_MASK</name>
               <description>Upon issuing a Suspend command, a Poll-1 operation is repeated until the Flash is no longer     BUSY, then a Poll-2 operation to determine whether the Flash device is in a Suspended state.</description>
               <addressOffset>0x1A4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CS0_POLL2</name>
                     <description>A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS0 Flash.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CS1_POLL2</name>
                     <description>A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS1 Flash.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_SPEC_MODE</name>
               <description>This register provides special mode control.</description>
               <addressOffset>0x1A8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIS_SUSPEND</name>
                     <description>A '1' in this field enters DISABLE_SUSPEND mode, which prevents suspending an Erase or         Write in progress. In this mode, Read operations will be held waiting until the Erase or         Write finishes.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP_CHECK_DLY</name>
               <description>This register provides a time delay for support of some Flash devices. It holds off the     first Poll-1 check after a Suspend command has been given to the Flash.</description>
               <addressOffset>0x1AC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>This field provides a delay value in units of the EC internal clock MCLK. This value         should be set to 20us.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FC_SPEC_MODE2</name>
               <description>Micron requires a prefix consisting of two command frames (in separate CS# assertions) to     be sent before Mode information will be recognized to enter Continuous Read mode. This     technique is called (Micron XIP) in their datasheets.  The support for these chips requires     setting up this register and setting the corresponding Prefix Enable bit(s) to enable this     handling.  The first command frame of the Prefix sequence will be a single byte consisting of     the Write Enable opcode, taken from the OP_WE opcode field of the appropriate Opcode A register     (Section 7.3.5, on page 113).  The second command frame of the Prefix sequence comes from this     register, consisting of first the PREFIX_OP byte for the corresponding Flash device (CS0/CS1),     and then its PREFIX_DAT byte.  The PREFIX_OP byte will be 81h always, which is documented as     the Micron opcode (WRITE VOLATILE CONFIGURATION REGISTER) The PREFIX_DAT byte contains the data     written to the Micron Flash device's Volatile Configuration Register. It has potential     side-effects beyond just enabling Micron XIP Mode, so it must be constructed very carefully.</description>
               <addressOffset>0x1B0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CS0_PRE_OP</name>
                     <description>This field is the Prefix Opcode for Micron XIP mode on CS0. It should be set to 81h,         for Micron parts.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CS0_PRE_DAT</name>
                     <description>This field is the data sent with the CS0_PREFIX_OP command.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CS1_PRE_OP</name>
                     <description>This field is the Prefix Opcode for Micron XIP mode on CS1. It should be set to 81h,         for Micron parts.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CS1_PRE_DAT</name>
                     <description>This field is the data sent with the CS1_PREFIX_OP command.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
