Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SAFCOMM</name>
         <version>1431.0</version>
         <description>This region contains one register “SAF Communication Mode” that may (and should) be set for optimal SAFS operation</description>
         <baseAddress>0x40071000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2BC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>COMM_MODE</name>
               <description>This register contains one bit PREFETCH_EN that should be set to '1' during initialization, to enable Prefetch Mode operation in SAFS Mode.</description>
               <addressOffset>0x2B8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PREFETCH_EN</name>
                     <description>1= Allow Prefetching from Flash devices, and use the bits CS0_PREFETCH_OPT_EN and         CS1_PREFETCH_OPT_EN to select any additional optimization.         0= Do not perform Prefetches from Flash devices</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SGPIO0</name>
         <version>1721.0</version>
         <description>This is Serial General Purpous Input Output block</description>
         <groupName>SGPIO</groupName>
         <prependToName>SGPIO_</prependToName>
         <baseAddress>0x4000A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x15</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SGPIO0</name>
            <value>161</value>
         </interrupt>
         <registers>
            <register>
               <name>CFG</name>
               <description>SGPIO Configuration Register.</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x04</resetValue>
               <fields>
                  <field>
                     <name>DRIVCNT</name>
                     <description>This field indicates the number of drives supported in each packet by the         SGPIO_TARGET_SPB block. The number of bits shifted in and out is three times         the value of this field, since there are three LEDs per drive.           This field is hard-coded to 04h.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXOTLD</name>
               <description>This register contains the values received during the last SGPIO transaction.</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUT</name>
                     <description>This field contains the values shifted in from the SGPIO_OUT pin. This field         clears to zero when a link-reset is detected.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>This field contains the values shifted in from the SGPIO_LD pin. This field         clears to zero when a link-reset is detected.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXIN</name>
               <description>This register contains the values to be transmitted during the next SGPIO transaction.</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IN</name>
                     <description>This register contains the values to be transmitted during the next SGPIO transaction.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <description>This register contains the SPIO status.</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EOF_STS</name>
                     <description>This field is set by the hardware whenever a SGPIO frame has finished shifting on the         bus. This field is cleared by F/W writing a 1. This is R/WC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNKRST_STS</name>
                     <description>This field is set by the hardware whenever the SGPIO pins have been detected high for         atleast 64ms. This field is cleared by F/W writing a 1. This is R/WC</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN</name>
               <description>This is register SPIO Enable Register.</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EOF</name>
                     <description>When this bit is set and sts_eof is asserted by the h/w, an interrupt is thrown to         the processor.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNKRST</name>
                     <description>When this bit is set and sts_link_reset is asserted by the h/w, an interrupt is         thrown to the processor.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>This is the SPIO Control Register.</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>When this bit is set to one, the SGPIO_TARGET_SPB block will be enabled.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFTRST</name>
                     <description>When this bit is set to one, the SGPIO_TARGET_SPB block will reset. This         bit is self clearing. This field is auto cleared by hardware.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTREN</name>
                     <description>When this bit is set to one, analog filters will be used to remove up to         50ns glitches on SGPIO_CLK, SGPIO_DOUT, and SGPIO_LD.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
