Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SPI_IEN</name>
               <description>SPI Slave Interrupt Enable Register.\n</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_WR_DONE</name>
                     <description>Enable Memory Write Done Interrupt to SPI Master.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_DONE</name>
                     <description>Enable Memory Read Done Interrupt to SPI Master.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_WR_BUSY</name>
                     <description>Enable Memory Write Busy Interrupt to SPI Master.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_BUSY</name>
                     <description>Enable Memory Read Busy Interrupt to SPI Master.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SREG_TRANS</name>
                     <description>Enable SREG Trans Busy Interrupt to SPI Master.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLL_HI</name>
                     <description>Enable Poll High Request Interrupt to SPI Master.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_EMP</name>
                     <description>Enable SREG RX FIFO Empty Interrupt to SPI Master.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_FUL</name>
                     <description>Enable RX FIFO Full Interrupt to SPI Master.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_EMP</name>
                     <description>Enable TX FIFO Empty Interrupt to SPI Master.\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_FUL</name>
                     <description>Enable TX FIFI FULL Interrupt to SPI Master.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMCLK_CNT_ERR</name>
                     <description>Enable Test Mode SPI Clock Count Error Interrupt to SPI Master.\n</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF_FLG</name>
                     <description>Enable Input Buffer Signaling Interrupt to SPI Master.\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBF_FLG</name>
                     <description>Enable Output Buffer signaling Interrupt to SPI Master.\n</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPIM_RST_REQ</name>
                     <description>Enable SPI Master Request Reset Interrupt to SPI Master.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_RST_DN</name>
                     <description>Enable RX FIFO Reset Done Interrupt to SPI Master.\n</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_RST_DN</name>
                     <description>Enable TX FIFO Reset Done Interrupt to SPI Master.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL0_ERR</name>
                     <description>Enable Out Of Limit 0 Error Interrupt to SPI Master.\n</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL1_ERR</name>
                     <description>Enable Out Of Limit 1 Error Interrupt to SPI Master.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARMBUS_ERR</name>
                     <description>Enable AHB BUS Error Interrupt to SPI Master.\n</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF_CMD_ERR</name>
                     <description>Enable Undefined Command Error Interrupt to SPI Master.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DV_BUSY</name>
                     <description>Enable Device Busy Interrupt to SPI Master.\n</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_SIZE_ERR</name>
                     <description>Enable RX FIFO SIZE Error Interrupt to SPI Master.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_UNFLW</name>
                     <description>Enable TX FIFO Underflow Interrupt to SPI Master.\n</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_OVRFLOW</name>
                     <description>Enable TX FIFO Overflow Interrupt to SPI Master.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_UNFLW</name>
                     <description>Enable RX FIFO Underflow Interrupt to SPI Master.\n</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_OVRFLW</name>
                     <description>Enable RX FIFO Overflow Interrupt to SPI Master.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC_IEN</name>
               <description>SPI Slave EC Interrupt Enable Register.\n</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_WR_DONE</name>
                     <description>Enable Memory Write Done Interrupt to EC.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_DONE</name>
                     <description>Enable Memory Read Done Interrupt to EC.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_WR_BUSY</name>
                     <description>Enable Memory Write Busy Interrupt to EC.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_RD_BUSY</name>
                     <description>Enable Memory Read Busy Interrupt to EC.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SREG_TRANS</name>
                     <description>Enable SREG Trans Busy Interrupt to EC.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLL_HI</name>
                     <description>Enable Poll High Request Interrupt to EC.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_EMP</name>
                     <description>Enable SREG RX FIFO Empty Interrupt to EC.\n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_FUL</name>
                     <description>Enable RX FIFO Full Interrupt to EC.\n</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_EMP</name>
                     <description>Enable TX FIFO Empty Interrupt to EC.\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_FUL</name>
                     <description>Enable TX FIFI FULL Interrupt to EC.\n</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMCLK_CNT_ERR</name>
                     <description>Enable Test Mode SPI Clock Count Error Interrupt to EC.\n</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBF_FLG</name>
                     <description>Enable Input Buffer Signaling Interrupt to EC.\n</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBF_FLG</name>
                     <description>Enable Output Buffer signaling Interrupt to EC.\n</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPIM_RST_REQ</name>
                     <description>Enable SPI Master Request Reset Interrupt to EC.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_RST_DN</name>
                     <description>Enable RX FIFO Reset Done Interrupt to EC.\n</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_RST_DN</name>
                     <description>Enable TX FIFO Reset Done Interrupt to EC.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL0_ERR</name>
                     <description>Enable Out Of Limit 0 Error Interrupt to EC.\n</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOL1_ERR</name>
                     <description>Enable Out Of Limit 1 Error Interrupt to EC.\n</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARMBUS_ERR</name>
                     <description>Enable AHB BUS Error Interrupt to EC.\n</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDEF_CMD_ERR</name>
                     <description>Enable Undefined Command Error Interrupt to EC.\n</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DV_BUSY</name>
                     <description>Enable Device Busy Interrupt to EC.\n</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_SIZE_ERR</name>
                     <description>Enable RX FIFO SIZE Error Interrupt to EC.\n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_UNFLW</name>
                     <description>Enable TX FIFO Underflow Interrupt to EC.\n</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXF_OVRFLW</name>
                     <description>Enable TX FIFO Overflow Interrupt to EC.\n</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_UNFLW</name>
                     <description>Enable RX FIFO Underflow Interrupt to EC.\n</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXF_OVRFLW</name>
                     <description>Enable RX FIFO Overflow Interrupt to EC.\n</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_CFG</name>
               <description>SPI Slave Memory Configuration Register.\n</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAR_EN0_SEL</name>
                     <description>Enables Region 0 operation.         0 = Disable Region 0.\n         1 = Enable Region 0.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAR_EN1_SEL</name>
                     <description>Enables Region 1 operation.         0 = Disable Region 1.\n         1 = Enable Region 1.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_BAR0</name>
               <description>SPI Slave Memory Base Address0 Register.\n</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAS_ADD0</name>
                     <description>Base Address for Region 0.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_WR_LIM0</name>
               <description>SPI Slave Memory Write LIMIT 0 Register.\n</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LMT0</name>
                     <description>Write Limit for Region 0.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_RD_LIM0</name>
               <description>SPI Slave Memory Read LIMIT 0 Register.\n</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LMT0</name>
                     <description>Read Limit for Region 0.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_BAR1</name>
               <description>SPI Slave Memory Base Address1 Register.\n</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD1</name>
                     <description>Base Address for Region 1.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_WR_LIM1</name>
               <description>SPI Slave Memory Write LIMIT 1 Register.\n</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LMT1</name>
                     <description>Write Limit for Region 1.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEM_RD_LIM1</name>
               <description>SPI Slave Memory Read LIMIT 1 Register.\n</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LMT1</name>
                     <description>Read Limit for Region 1.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF_HOST_BAR</name>
               <description>SPI Slave RX FIFO Host Bar Register.\n</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAR</name>
                     <description>RX FIFO Host Bar Register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF_BYTE_CNT</name>
               <description>SPI Slave RX FIFO Byte Counter Register.\n</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BCNT</name>
                     <description>RX FIFO Byte Count Register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXF_HOST_BAR</name>
               <description>SPI Slave TX FIFO Host Bar Register.\n</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAR</name>
                     <description>TX FIFO Host Bar Register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXF_BYTE_CNT</name>
               <description>SPI Slave TX FIFO Byte Counter Register.\n</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BCNT</name>
                     <description>TX FIFO Byte Count Register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
