Ac6Embedded/svd-microchip/PIC32CX_SG/PIC32CX0525SG12144.svd
            <register>
               <name>SYS_CFG</name>
               <description>SPI Slave System Configuration Register.\n</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x000004C0</resetValue>
               <fields>
                  <field>
                     <name>SOFT_RST</name>
                     <description>Soft reset for entire SPI Slave Block. This bit is self clearing.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_QUAD_SNGL_WRMOD</name>
                     <description>Lock Quad / Single Write Mode bit, write access from SPI Master.\n</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_TAR_TIME</name>
                     <description>Lock Tar Time bit, write access from SPI Master.\n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_WAIT_CYCL</name>
                     <description>Lock Wait Cycle bits, write access from SPI Master.\n</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_MEM_CFG</name>
                     <description>Lock Memory Configuration register, write access from SPI Master.\n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_SPIINT_EN</name>
                     <description>Lock SPI Interrupt Enable register, write access from SPI Master.\n</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_MEM_BAR0</name>
                     <description>Lock Memory Bar 0 register, write access from SPI Master.\n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_MEM_BAR1</name>
                     <description>Lock Memory Bar 1 register, write access from SPI Master.\n</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK_TEST_MODE</name>
                     <description>Lock TEST Mode register, write access from SPI Master.\n</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI_SLV_EN</name>
                     <description>Enable / Disable SPI Slave Block.\n         0 = Disable SPI Slave module.\n         1 = Enable SPI Slave module.\n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAS_ECREG</name>
                     <description>Mask EC register 'fld_mask_ec_register' from SPI Master. All the register are         neither readable now writable from SPI Master.\n</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIM_EN</name>
                     <description>Enable SPI Slave Simple Mode operation.\n</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECDAT_AVL</name>
                     <description>Notification to TX FIFO Engine that data is available for AHB Transfer. This register         but is cleared by Hardware at the end of the transaction, with SPI_CS_N de-assertion.         (R/WC).\n</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPIM2EC_MBX</name>
               <description>SPI Slave Master to EC Mailbox Register.\n</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>M2EC</name>
                     <description>Write only register for the Host. When data is written to this register the IBF Flag         is set. EC can read the data and writes of 0xFFFF will clear this register. Any form of         read will clear the flag for this register.\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EC2SPIM_MBX</name>
               <description>SPI Slave Master to EC Mailbox Register.\n</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EC2M</name>
                     <description>Read only register for the Host. When data is written to this register the OBF Flag         is set. Host can read the data and writes of 0xFFFF_FFFF will clear this register, also         clearing the flag. Any form of read will clear the flag for this register\n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
